{"modelTopology":{"class_name":"Model","config":{"name":"model131","layers":[{"name":"input131","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input131"},"inbound_nodes":[]},{"name":"dense_Dense521","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense521","trainable":true},"inbound_nodes":[[["input131",0,0,{}]]]},{"name":"dense_Dense522","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense522","trainable":true},"inbound_nodes":[[["dense_Dense521",0,0,{}]]]},{"name":"dense_Dense523","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense523","trainable":true},"inbound_nodes":[[["dense_Dense522",0,0,{}]]]},{"name":"dense_Dense524","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense524","trainable":true},"inbound_nodes":[[["dense_Dense523",0,0,{}]]]}],"input_layers":[["input131",0,0]],"output_layers":[["dense_Dense524",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense521/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense521/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense522/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense522/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense523/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense523/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense524/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense524/bias","shape":[1],"dtype":"float32"}]}]}