{"modelTopology":{"class_name":"Model","config":{"name":"model730","layers":[{"name":"input730","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input730"},"inbound_nodes":[]},{"name":"dense_Dense4375","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4375","trainable":true},"inbound_nodes":[[["input730",0,0,{}]]]},{"name":"dense_Dense4376","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4376","trainable":true},"inbound_nodes":[[["dense_Dense4375",0,0,{}]]]},{"name":"dense_Dense4377","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4377","trainable":true},"inbound_nodes":[[["dense_Dense4376",0,0,{}]]]},{"name":"dense_Dense4378","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4378","trainable":true},"inbound_nodes":[[["dense_Dense4377",0,0,{}]]]},{"name":"dense_Dense4379","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4379","trainable":true},"inbound_nodes":[[["dense_Dense4378",0,0,{}]]]},{"name":"dense_Dense4380","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4380","trainable":true},"inbound_nodes":[[["dense_Dense4379",0,0,{}]]]}],"input_layers":[["input730",0,0]],"output_layers":[["dense_Dense4380",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4375/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4375/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4376/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4376/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4377/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense4377/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4378/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense4378/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4379/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense4379/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4380/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4380/bias","shape":[1],"dtype":"float32"}]}]}