{"modelTopology":{"class_name":"Model","config":{"name":"model615","layers":[{"name":"input615","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input615"},"inbound_nodes":[]},{"name":"dense_Dense3685","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3685","trainable":true},"inbound_nodes":[[["input615",0,0,{}]]]},{"name":"dense_Dense3686","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3686","trainable":true},"inbound_nodes":[[["dense_Dense3685",0,0,{}]]]},{"name":"dense_Dense3687","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3687","trainable":true},"inbound_nodes":[[["dense_Dense3686",0,0,{}]]]},{"name":"dense_Dense3688","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3688","trainable":true},"inbound_nodes":[[["dense_Dense3687",0,0,{}]]]},{"name":"dense_Dense3689","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3689","trainable":true},"inbound_nodes":[[["dense_Dense3688",0,0,{}]]]},{"name":"dense_Dense3690","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3690","trainable":true},"inbound_nodes":[[["dense_Dense3689",0,0,{}]]]}],"input_layers":[["input615",0,0]],"output_layers":[["dense_Dense3690",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3685/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3685/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3686/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3686/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3687/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3687/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3688/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3688/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3689/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3689/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3690/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3690/bias","shape":[1],"dtype":"float32"}]}]}