{"modelTopology":{"class_name":"Model","config":{"name":"model672","layers":[{"name":"input672","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input672"},"inbound_nodes":[]},{"name":"dense_Dense4027","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4027","trainable":true},"inbound_nodes":[[["input672",0,0,{}]]]},{"name":"dense_Dense4028","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4028","trainable":true},"inbound_nodes":[[["dense_Dense4027",0,0,{}]]]},{"name":"dense_Dense4029","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4029","trainable":true},"inbound_nodes":[[["dense_Dense4028",0,0,{}]]]},{"name":"dense_Dense4030","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4030","trainable":true},"inbound_nodes":[[["dense_Dense4029",0,0,{}]]]},{"name":"dense_Dense4031","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4031","trainable":true},"inbound_nodes":[[["dense_Dense4030",0,0,{}]]]},{"name":"dense_Dense4032","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4032","trainable":true},"inbound_nodes":[[["dense_Dense4031",0,0,{}]]]}],"input_layers":[["input672",0,0]],"output_layers":[["dense_Dense4032",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4027/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4027/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4028/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4028/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4029/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4029/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4030/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense4030/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4031/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4031/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4032/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4032/bias","shape":[1],"dtype":"float32"}]}]}