{"modelTopology":{"class_name":"Model","config":{"name":"model1101","layers":[{"name":"input1101","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1101"},"inbound_nodes":[]},{"name":"dense_Dense5501","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5501","trainable":true},"inbound_nodes":[[["input1101",0,0,{}]]]},{"name":"dense_Dense5502","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5502","trainable":true},"inbound_nodes":[[["dense_Dense5501",0,0,{}]]]},{"name":"dense_Dense5503","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5503","trainable":true},"inbound_nodes":[[["dense_Dense5502",0,0,{}]]]},{"name":"dense_Dense5504","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5504","trainable":true},"inbound_nodes":[[["dense_Dense5503",0,0,{}]]]},{"name":"dense_Dense5505","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5505","trainable":true},"inbound_nodes":[[["dense_Dense5504",0,0,{}]]]}],"input_layers":[["input1101",0,0]],"output_layers":[["dense_Dense5505",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5501/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5501/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5502/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5502/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5503/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense5503/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5504/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense5504/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5505/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5505/bias","shape":[1],"dtype":"float32"}]}]}