{"modelTopology":{"class_name":"Model","config":{"name":"model727","layers":[{"name":"input727","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input727"},"inbound_nodes":[]},{"name":"dense_Dense4357","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4357","trainable":true},"inbound_nodes":[[["input727",0,0,{}]]]},{"name":"dense_Dense4358","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4358","trainable":true},"inbound_nodes":[[["dense_Dense4357",0,0,{}]]]},{"name":"dense_Dense4359","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4359","trainable":true},"inbound_nodes":[[["dense_Dense4358",0,0,{}]]]},{"name":"dense_Dense4360","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4360","trainable":true},"inbound_nodes":[[["dense_Dense4359",0,0,{}]]]},{"name":"dense_Dense4361","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4361","trainable":true},"inbound_nodes":[[["dense_Dense4360",0,0,{}]]]},{"name":"dense_Dense4362","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4362","trainable":true},"inbound_nodes":[[["dense_Dense4361",0,0,{}]]]}],"input_layers":[["input727",0,0]],"output_layers":[["dense_Dense4362",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4357/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense4357/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4358/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4358/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4359/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense4359/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4360/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense4360/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4361/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4361/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4362/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense4362/bias","shape":[1],"dtype":"float32"}]}]}