{"modelTopology":{"class_name":"Model","config":{"name":"model1290","layers":[{"name":"input1290","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1290"},"inbound_nodes":[]},{"name":"dense_Dense7735","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7735","trainable":true},"inbound_nodes":[[["input1290",0,0,{}]]]},{"name":"dense_Dense7736","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7736","trainable":true},"inbound_nodes":[[["dense_Dense7735",0,0,{}]]]},{"name":"dense_Dense7737","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7737","trainable":true},"inbound_nodes":[[["dense_Dense7736",0,0,{}]]]},{"name":"dense_Dense7738","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7738","trainable":true},"inbound_nodes":[[["dense_Dense7737",0,0,{}]]]},{"name":"dense_Dense7739","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7739","trainable":true},"inbound_nodes":[[["dense_Dense7738",0,0,{}]]]},{"name":"dense_Dense7740","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7740","trainable":true},"inbound_nodes":[[["dense_Dense7739",0,0,{}]]]}],"input_layers":[["input1290",0,0]],"output_layers":[["dense_Dense7740",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7735/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense7735/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7736/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense7736/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7737/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7737/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7738/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense7738/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7739/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7739/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7740/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense7740/bias","shape":[1],"dtype":"float32"}]}]}