{"modelTopology":{"class_name":"Model","config":{"name":"model1260","layers":[{"name":"input1260","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1260"},"inbound_nodes":[]},{"name":"dense_Dense7555","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7555","trainable":true},"inbound_nodes":[[["input1260",0,0,{}]]]},{"name":"dense_Dense7556","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7556","trainable":true},"inbound_nodes":[[["dense_Dense7555",0,0,{}]]]},{"name":"dense_Dense7557","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7557","trainable":true},"inbound_nodes":[[["dense_Dense7556",0,0,{}]]]},{"name":"dense_Dense7558","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7558","trainable":true},"inbound_nodes":[[["dense_Dense7557",0,0,{}]]]},{"name":"dense_Dense7559","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7559","trainable":true},"inbound_nodes":[[["dense_Dense7558",0,0,{}]]]},{"name":"dense_Dense7560","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7560","trainable":true},"inbound_nodes":[[["dense_Dense7559",0,0,{}]]]}],"input_layers":[["input1260",0,0]],"output_layers":[["dense_Dense7560",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7555/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense7555/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7556/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense7556/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7557/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense7557/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7558/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7558/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7559/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7559/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7560/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense7560/bias","shape":[1],"dtype":"float32"}]}]}