{"modelTopology":{"class_name":"Model","config":{"name":"model536","layers":[{"name":"input536","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input536"},"inbound_nodes":[]},{"name":"dense_Dense3211","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3211","trainable":true},"inbound_nodes":[[["input536",0,0,{}]]]},{"name":"dense_Dense3212","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3212","trainable":true},"inbound_nodes":[[["dense_Dense3211",0,0,{}]]]},{"name":"dense_Dense3213","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3213","trainable":true},"inbound_nodes":[[["dense_Dense3212",0,0,{}]]]},{"name":"dense_Dense3214","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3214","trainable":true},"inbound_nodes":[[["dense_Dense3213",0,0,{}]]]},{"name":"dense_Dense3215","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3215","trainable":true},"inbound_nodes":[[["dense_Dense3214",0,0,{}]]]},{"name":"dense_Dense3216","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3216","trainable":true},"inbound_nodes":[[["dense_Dense3215",0,0,{}]]]}],"input_layers":[["input536",0,0]],"output_layers":[["dense_Dense3216",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3211/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3211/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3212/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3212/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3213/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3213/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3214/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3214/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3215/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense3215/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3216/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3216/bias","shape":[1],"dtype":"float32"}]}]}