{"modelTopology":{"class_name":"Model","config":{"name":"model525","layers":[{"name":"input525","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input525"},"inbound_nodes":[]},{"name":"dense_Dense2621","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2621","trainable":true},"inbound_nodes":[[["input525",0,0,{}]]]},{"name":"dense_Dense2622","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2622","trainable":true},"inbound_nodes":[[["dense_Dense2621",0,0,{}]]]},{"name":"dense_Dense2623","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2623","trainable":true},"inbound_nodes":[[["dense_Dense2622",0,0,{}]]]},{"name":"dense_Dense2624","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2624","trainable":true},"inbound_nodes":[[["dense_Dense2623",0,0,{}]]]},{"name":"dense_Dense2625","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2625","trainable":true},"inbound_nodes":[[["dense_Dense2624",0,0,{}]]]}],"input_layers":[["input525",0,0]],"output_layers":[["dense_Dense2625",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2621/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2621/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2622/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2622/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2623/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense2623/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2624/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2624/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2625/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2625/bias","shape":[1],"dtype":"float32"}]}]}