{"modelTopology":{"class_name":"Model","config":{"name":"model109","layers":[{"name":"input109","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input109"},"inbound_nodes":[]},{"name":"dense_Dense649","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense649","trainable":true},"inbound_nodes":[[["input109",0,0,{}]]]},{"name":"dense_Dense650","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense650","trainable":true},"inbound_nodes":[[["dense_Dense649",0,0,{}]]]},{"name":"dense_Dense651","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense651","trainable":true},"inbound_nodes":[[["dense_Dense650",0,0,{}]]]},{"name":"dense_Dense652","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense652","trainable":true},"inbound_nodes":[[["dense_Dense651",0,0,{}]]]},{"name":"dense_Dense653","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense653","trainable":true},"inbound_nodes":[[["dense_Dense652",0,0,{}]]]},{"name":"dense_Dense654","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense654","trainable":true},"inbound_nodes":[[["dense_Dense653",0,0,{}]]]}],"input_layers":[["input109",0,0]],"output_layers":[["dense_Dense654",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense649/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense649/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense650/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense650/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense651/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense651/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense652/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense652/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense653/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense653/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense654/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense654/bias","shape":[1],"dtype":"float32"}]}]}