{"modelTopology":{"class_name":"Model","config":{"name":"model183","layers":[{"name":"input183","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input183"},"inbound_nodes":[]},{"name":"dense_Dense911","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense911","trainable":true},"inbound_nodes":[[["input183",0,0,{}]]]},{"name":"dense_Dense912","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense912","trainable":true},"inbound_nodes":[[["dense_Dense911",0,0,{}]]]},{"name":"dense_Dense913","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense913","trainable":true},"inbound_nodes":[[["dense_Dense912",0,0,{}]]]},{"name":"dense_Dense914","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense914","trainable":true},"inbound_nodes":[[["dense_Dense913",0,0,{}]]]},{"name":"dense_Dense915","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense915","trainable":true},"inbound_nodes":[[["dense_Dense914",0,0,{}]]]}],"input_layers":[["input183",0,0]],"output_layers":[["dense_Dense915",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense911/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense911/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense912/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense912/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense913/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense913/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense914/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense914/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense915/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense915/bias","shape":[1],"dtype":"float32"}]}]}