{"modelTopology":{"class_name":"Model","config":{"name":"model638","layers":[{"name":"input638","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input638"},"inbound_nodes":[]},{"name":"dense_Dense3186","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3186","trainable":true},"inbound_nodes":[[["input638",0,0,{}]]]},{"name":"dense_Dense3187","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3187","trainable":true},"inbound_nodes":[[["dense_Dense3186",0,0,{}]]]},{"name":"dense_Dense3188","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3188","trainable":true},"inbound_nodes":[[["dense_Dense3187",0,0,{}]]]},{"name":"dense_Dense3189","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3189","trainable":true},"inbound_nodes":[[["dense_Dense3188",0,0,{}]]]},{"name":"dense_Dense3190","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3190","trainable":true},"inbound_nodes":[[["dense_Dense3189",0,0,{}]]]}],"input_layers":[["input638",0,0]],"output_layers":[["dense_Dense3190",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3186/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3186/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3187/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3187/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3188/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense3188/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3189/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense3189/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3190/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3190/bias","shape":[1],"dtype":"float32"}]}]}