{"modelTopology":{"class_name":"Model","config":{"name":"model877","layers":[{"name":"input877","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input877"},"inbound_nodes":[]},{"name":"dense_Dense5257","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5257","trainable":true},"inbound_nodes":[[["input877",0,0,{}]]]},{"name":"dense_Dense5258","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5258","trainable":true},"inbound_nodes":[[["dense_Dense5257",0,0,{}]]]},{"name":"dense_Dense5259","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5259","trainable":true},"inbound_nodes":[[["dense_Dense5258",0,0,{}]]]},{"name":"dense_Dense5260","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5260","trainable":true},"inbound_nodes":[[["dense_Dense5259",0,0,{}]]]},{"name":"dense_Dense5261","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5261","trainable":true},"inbound_nodes":[[["dense_Dense5260",0,0,{}]]]},{"name":"dense_Dense5262","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5262","trainable":true},"inbound_nodes":[[["dense_Dense5261",0,0,{}]]]}],"input_layers":[["input877",0,0]],"output_layers":[["dense_Dense5262",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5257/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense5257/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5258/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense5258/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5259/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense5259/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5260/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense5260/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5261/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5261/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5262/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5262/bias","shape":[1],"dtype":"float32"}]}]}