{"modelTopology":{"class_name":"Model","config":{"name":"model188","layers":[{"name":"input188","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input188"},"inbound_nodes":[]},{"name":"dense_Dense1123","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1123","trainable":true},"inbound_nodes":[[["input188",0,0,{}]]]},{"name":"dense_Dense1124","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1124","trainable":true},"inbound_nodes":[[["dense_Dense1123",0,0,{}]]]},{"name":"dense_Dense1125","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1125","trainable":true},"inbound_nodes":[[["dense_Dense1124",0,0,{}]]]},{"name":"dense_Dense1126","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1126","trainable":true},"inbound_nodes":[[["dense_Dense1125",0,0,{}]]]},{"name":"dense_Dense1127","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1127","trainable":true},"inbound_nodes":[[["dense_Dense1126",0,0,{}]]]},{"name":"dense_Dense1128","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1128","trainable":true},"inbound_nodes":[[["dense_Dense1127",0,0,{}]]]}],"input_layers":[["input188",0,0]],"output_layers":[["dense_Dense1128",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1123/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1123/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1124/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1124/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1125/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense1125/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1126/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1126/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1127/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1127/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1128/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1128/bias","shape":[1],"dtype":"float32"}]}]}