{"modelTopology":{"class_name":"Model","config":{"name":"model1084","layers":[{"name":"input1084","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1084"},"inbound_nodes":[]},{"name":"dense_Dense5416","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5416","trainable":true},"inbound_nodes":[[["input1084",0,0,{}]]]},{"name":"dense_Dense5417","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5417","trainable":true},"inbound_nodes":[[["dense_Dense5416",0,0,{}]]]},{"name":"dense_Dense5418","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5418","trainable":true},"inbound_nodes":[[["dense_Dense5417",0,0,{}]]]},{"name":"dense_Dense5419","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5419","trainable":true},"inbound_nodes":[[["dense_Dense5418",0,0,{}]]]},{"name":"dense_Dense5420","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5420","trainable":true},"inbound_nodes":[[["dense_Dense5419",0,0,{}]]]}],"input_layers":[["input1084",0,0]],"output_layers":[["dense_Dense5420",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5416/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5416/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5417/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5417/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5418/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5418/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5419/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense5419/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5420/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5420/bias","shape":[1],"dtype":"float32"}]}]}