{"modelTopology":{"class_name":"Model","config":{"name":"model825","layers":[{"name":"input825","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input825"},"inbound_nodes":[]},{"name":"dense_Dense4945","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4945","trainable":true},"inbound_nodes":[[["input825",0,0,{}]]]},{"name":"dense_Dense4946","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4946","trainable":true},"inbound_nodes":[[["dense_Dense4945",0,0,{}]]]},{"name":"dense_Dense4947","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4947","trainable":true},"inbound_nodes":[[["dense_Dense4946",0,0,{}]]]},{"name":"dense_Dense4948","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4948","trainable":true},"inbound_nodes":[[["dense_Dense4947",0,0,{}]]]},{"name":"dense_Dense4949","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4949","trainable":true},"inbound_nodes":[[["dense_Dense4948",0,0,{}]]]},{"name":"dense_Dense4950","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4950","trainable":true},"inbound_nodes":[[["dense_Dense4949",0,0,{}]]]}],"input_layers":[["input825",0,0]],"output_layers":[["dense_Dense4950",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4945/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense4945/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4946/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4946/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4947/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4947/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4948/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense4948/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4949/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense4949/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4950/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4950/bias","shape":[1],"dtype":"float32"}]}]}