{"modelTopology":{"class_name":"Model","config":{"name":"model510","layers":[{"name":"input510","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input510"},"inbound_nodes":[]},{"name":"dense_Dense3055","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3055","trainable":true},"inbound_nodes":[[["input510",0,0,{}]]]},{"name":"dense_Dense3056","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3056","trainable":true},"inbound_nodes":[[["dense_Dense3055",0,0,{}]]]},{"name":"dense_Dense3057","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3057","trainable":true},"inbound_nodes":[[["dense_Dense3056",0,0,{}]]]},{"name":"dense_Dense3058","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3058","trainable":true},"inbound_nodes":[[["dense_Dense3057",0,0,{}]]]},{"name":"dense_Dense3059","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3059","trainable":true},"inbound_nodes":[[["dense_Dense3058",0,0,{}]]]},{"name":"dense_Dense3060","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3060","trainable":true},"inbound_nodes":[[["dense_Dense3059",0,0,{}]]]}],"input_layers":[["input510",0,0]],"output_layers":[["dense_Dense3060",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3055/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense3055/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3056/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense3056/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3057/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3057/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3058/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3058/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3059/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense3059/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3060/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3060/bias","shape":[1],"dtype":"float32"}]}]}