{"modelTopology":{"class_name":"Model","config":{"name":"model444","layers":[{"name":"input444","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input444"},"inbound_nodes":[]},{"name":"dense_Dense2659","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2659","trainable":true},"inbound_nodes":[[["input444",0,0,{}]]]},{"name":"dense_Dense2660","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2660","trainable":true},"inbound_nodes":[[["dense_Dense2659",0,0,{}]]]},{"name":"dense_Dense2661","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2661","trainable":true},"inbound_nodes":[[["dense_Dense2660",0,0,{}]]]},{"name":"dense_Dense2662","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2662","trainable":true},"inbound_nodes":[[["dense_Dense2661",0,0,{}]]]},{"name":"dense_Dense2663","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2663","trainable":true},"inbound_nodes":[[["dense_Dense2662",0,0,{}]]]},{"name":"dense_Dense2664","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2664","trainable":true},"inbound_nodes":[[["dense_Dense2663",0,0,{}]]]}],"input_layers":[["input444",0,0]],"output_layers":[["dense_Dense2664",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2659/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense2659/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2660/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense2660/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2661/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2661/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2662/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2662/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2663/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2663/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2664/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2664/bias","shape":[1],"dtype":"float32"}]}]}