{"modelTopology":{"class_name":"Model","config":{"name":"model1229","layers":[{"name":"input1229","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1229"},"inbound_nodes":[]},{"name":"dense_Dense7369","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7369","trainable":true},"inbound_nodes":[[["input1229",0,0,{}]]]},{"name":"dense_Dense7370","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7370","trainable":true},"inbound_nodes":[[["dense_Dense7369",0,0,{}]]]},{"name":"dense_Dense7371","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7371","trainable":true},"inbound_nodes":[[["dense_Dense7370",0,0,{}]]]},{"name":"dense_Dense7372","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7372","trainable":true},"inbound_nodes":[[["dense_Dense7371",0,0,{}]]]},{"name":"dense_Dense7373","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7373","trainable":true},"inbound_nodes":[[["dense_Dense7372",0,0,{}]]]},{"name":"dense_Dense7374","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7374","trainable":true},"inbound_nodes":[[["dense_Dense7373",0,0,{}]]]}],"input_layers":[["input1229",0,0]],"output_layers":[["dense_Dense7374",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7369/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense7369/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7370/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense7370/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7371/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense7371/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7372/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7372/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7373/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense7373/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7374/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7374/bias","shape":[1],"dtype":"float32"}]}]}