{"modelTopology":{"class_name":"Model","config":{"name":"model1066","layers":[{"name":"input1066","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1066"},"inbound_nodes":[]},{"name":"dense_Dense6391","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6391","trainable":true},"inbound_nodes":[[["input1066",0,0,{}]]]},{"name":"dense_Dense6392","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6392","trainable":true},"inbound_nodes":[[["dense_Dense6391",0,0,{}]]]},{"name":"dense_Dense6393","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6393","trainable":true},"inbound_nodes":[[["dense_Dense6392",0,0,{}]]]},{"name":"dense_Dense6394","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6394","trainable":true},"inbound_nodes":[[["dense_Dense6393",0,0,{}]]]},{"name":"dense_Dense6395","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6395","trainable":true},"inbound_nodes":[[["dense_Dense6394",0,0,{}]]]},{"name":"dense_Dense6396","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6396","trainable":true},"inbound_nodes":[[["dense_Dense6395",0,0,{}]]]}],"input_layers":[["input1066",0,0]],"output_layers":[["dense_Dense6396",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6391/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6391/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6392/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6392/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6393/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6393/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6394/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense6394/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6395/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense6395/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6396/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense6396/bias","shape":[1],"dtype":"float32"}]}]}