{"modelTopology":{"class_name":"Model","config":{"name":"model184","layers":[{"name":"input184","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input184"},"inbound_nodes":[]},{"name":"dense_Dense916","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense916","trainable":true},"inbound_nodes":[[["input184",0,0,{}]]]},{"name":"dense_Dense917","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense917","trainable":true},"inbound_nodes":[[["dense_Dense916",0,0,{}]]]},{"name":"dense_Dense918","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense918","trainable":true},"inbound_nodes":[[["dense_Dense917",0,0,{}]]]},{"name":"dense_Dense919","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense919","trainable":true},"inbound_nodes":[[["dense_Dense918",0,0,{}]]]},{"name":"dense_Dense920","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense920","trainable":true},"inbound_nodes":[[["dense_Dense919",0,0,{}]]]}],"input_layers":[["input184",0,0]],"output_layers":[["dense_Dense920",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense916/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense916/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense917/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense917/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense918/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense918/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense919/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense919/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense920/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense920/bias","shape":[1],"dtype":"float32"}]}]}