{"modelTopology":{"class_name":"Model","config":{"name":"model172","layers":[{"name":"input172","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input172"},"inbound_nodes":[]},{"name":"dense_Dense1027","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1027","trainable":true},"inbound_nodes":[[["input172",0,0,{}]]]},{"name":"dense_Dense1028","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1028","trainable":true},"inbound_nodes":[[["dense_Dense1027",0,0,{}]]]},{"name":"dense_Dense1029","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1029","trainable":true},"inbound_nodes":[[["dense_Dense1028",0,0,{}]]]},{"name":"dense_Dense1030","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1030","trainable":true},"inbound_nodes":[[["dense_Dense1029",0,0,{}]]]},{"name":"dense_Dense1031","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1031","trainable":true},"inbound_nodes":[[["dense_Dense1030",0,0,{}]]]},{"name":"dense_Dense1032","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1032","trainable":true},"inbound_nodes":[[["dense_Dense1031",0,0,{}]]]}],"input_layers":[["input172",0,0]],"output_layers":[["dense_Dense1032",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1027/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense1027/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1028/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1028/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1029/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1029/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1030/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense1030/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1031/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense1031/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1032/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1032/bias","shape":[1],"dtype":"float32"}]}]}