{"modelTopology":{"class_name":"Model","config":{"name":"model1032","layers":[{"name":"input1032","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1032"},"inbound_nodes":[]},{"name":"dense_Dense6187","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6187","trainable":true},"inbound_nodes":[[["input1032",0,0,{}]]]},{"name":"dense_Dense6188","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6188","trainable":true},"inbound_nodes":[[["dense_Dense6187",0,0,{}]]]},{"name":"dense_Dense6189","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6189","trainable":true},"inbound_nodes":[[["dense_Dense6188",0,0,{}]]]},{"name":"dense_Dense6190","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6190","trainable":true},"inbound_nodes":[[["dense_Dense6189",0,0,{}]]]},{"name":"dense_Dense6191","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6191","trainable":true},"inbound_nodes":[[["dense_Dense6190",0,0,{}]]]},{"name":"dense_Dense6192","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6192","trainable":true},"inbound_nodes":[[["dense_Dense6191",0,0,{}]]]}],"input_layers":[["input1032",0,0]],"output_layers":[["dense_Dense6192",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6187/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6187/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6188/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6188/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6189/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6189/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6190/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6190/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6191/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6191/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6192/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6192/bias","shape":[1],"dtype":"float32"}]}]}