{"modelTopology":{"class_name":"Model","config":{"name":"model1106","layers":[{"name":"input1106","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1106"},"inbound_nodes":[]},{"name":"dense_Dense6631","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6631","trainable":true},"inbound_nodes":[[["input1106",0,0,{}]]]},{"name":"dense_Dense6632","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6632","trainable":true},"inbound_nodes":[[["dense_Dense6631",0,0,{}]]]},{"name":"dense_Dense6633","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6633","trainable":true},"inbound_nodes":[[["dense_Dense6632",0,0,{}]]]},{"name":"dense_Dense6634","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6634","trainable":true},"inbound_nodes":[[["dense_Dense6633",0,0,{}]]]},{"name":"dense_Dense6635","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6635","trainable":true},"inbound_nodes":[[["dense_Dense6634",0,0,{}]]]},{"name":"dense_Dense6636","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6636","trainable":true},"inbound_nodes":[[["dense_Dense6635",0,0,{}]]]}],"input_layers":[["input1106",0,0]],"output_layers":[["dense_Dense6636",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6631/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6631/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6632/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense6632/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6633/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6633/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6634/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense6634/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6635/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense6635/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6636/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6636/bias","shape":[1],"dtype":"float32"}]}]}