{"modelTopology":{"class_name":"Model","config":{"name":"model86","layers":[{"name":"input86","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input86"},"inbound_nodes":[]},{"name":"dense_Dense511","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense511","trainable":true},"inbound_nodes":[[["input86",0,0,{}]]]},{"name":"dense_Dense512","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense512","trainable":true},"inbound_nodes":[[["dense_Dense511",0,0,{}]]]},{"name":"dense_Dense513","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense513","trainable":true},"inbound_nodes":[[["dense_Dense512",0,0,{}]]]},{"name":"dense_Dense514","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense514","trainable":true},"inbound_nodes":[[["dense_Dense513",0,0,{}]]]},{"name":"dense_Dense515","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense515","trainable":true},"inbound_nodes":[[["dense_Dense514",0,0,{}]]]},{"name":"dense_Dense516","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense516","trainable":true},"inbound_nodes":[[["dense_Dense515",0,0,{}]]]}],"input_layers":[["input86",0,0]],"output_layers":[["dense_Dense516",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense511/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense511/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense512/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense512/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense513/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense513/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense514/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense514/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense515/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense515/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense516/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense516/bias","shape":[1],"dtype":"float32"}]}]}