{"modelTopology":{"class_name":"Model","config":{"name":"model736","layers":[{"name":"input736","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input736"},"inbound_nodes":[]},{"name":"dense_Dense4411","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4411","trainable":true},"inbound_nodes":[[["input736",0,0,{}]]]},{"name":"dense_Dense4412","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4412","trainable":true},"inbound_nodes":[[["dense_Dense4411",0,0,{}]]]},{"name":"dense_Dense4413","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4413","trainable":true},"inbound_nodes":[[["dense_Dense4412",0,0,{}]]]},{"name":"dense_Dense4414","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4414","trainable":true},"inbound_nodes":[[["dense_Dense4413",0,0,{}]]]},{"name":"dense_Dense4415","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4415","trainable":true},"inbound_nodes":[[["dense_Dense4414",0,0,{}]]]},{"name":"dense_Dense4416","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4416","trainable":true},"inbound_nodes":[[["dense_Dense4415",0,0,{}]]]}],"input_layers":[["input736",0,0]],"output_layers":[["dense_Dense4416",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4411/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense4411/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4412/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4412/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4413/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense4413/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4414/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense4414/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4415/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4415/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4416/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4416/bias","shape":[1],"dtype":"float32"}]}]}