{"modelTopology":{"class_name":"Model","config":{"name":"model850","layers":[{"name":"input850","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input850"},"inbound_nodes":[]},{"name":"dense_Dense5095","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5095","trainable":true},"inbound_nodes":[[["input850",0,0,{}]]]},{"name":"dense_Dense5096","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5096","trainable":true},"inbound_nodes":[[["dense_Dense5095",0,0,{}]]]},{"name":"dense_Dense5097","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5097","trainable":true},"inbound_nodes":[[["dense_Dense5096",0,0,{}]]]},{"name":"dense_Dense5098","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5098","trainable":true},"inbound_nodes":[[["dense_Dense5097",0,0,{}]]]},{"name":"dense_Dense5099","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5099","trainable":true},"inbound_nodes":[[["dense_Dense5098",0,0,{}]]]},{"name":"dense_Dense5100","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5100","trainable":true},"inbound_nodes":[[["dense_Dense5099",0,0,{}]]]}],"input_layers":[["input850",0,0]],"output_layers":[["dense_Dense5100",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5095/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5095/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5096/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5096/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5097/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense5097/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5098/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense5098/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5099/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense5099/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5100/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5100/bias","shape":[1],"dtype":"float32"}]}]}