{"modelTopology":{"class_name":"Model","config":{"name":"model694","layers":[{"name":"input694","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input694"},"inbound_nodes":[]},{"name":"dense_Dense4159","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4159","trainable":true},"inbound_nodes":[[["input694",0,0,{}]]]},{"name":"dense_Dense4160","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4160","trainable":true},"inbound_nodes":[[["dense_Dense4159",0,0,{}]]]},{"name":"dense_Dense4161","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4161","trainable":true},"inbound_nodes":[[["dense_Dense4160",0,0,{}]]]},{"name":"dense_Dense4162","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4162","trainable":true},"inbound_nodes":[[["dense_Dense4161",0,0,{}]]]},{"name":"dense_Dense4163","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4163","trainable":true},"inbound_nodes":[[["dense_Dense4162",0,0,{}]]]},{"name":"dense_Dense4164","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4164","trainable":true},"inbound_nodes":[[["dense_Dense4163",0,0,{}]]]}],"input_layers":[["input694",0,0]],"output_layers":[["dense_Dense4164",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4159/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4159/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4160/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4160/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4161/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense4161/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4162/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense4162/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4163/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense4163/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4164/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4164/bias","shape":[1],"dtype":"float32"}]}]}