{"modelTopology":{"class_name":"Model","config":{"name":"model1098","layers":[{"name":"input1098","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1098"},"inbound_nodes":[]},{"name":"dense_Dense6583","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6583","trainable":true},"inbound_nodes":[[["input1098",0,0,{}]]]},{"name":"dense_Dense6584","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6584","trainable":true},"inbound_nodes":[[["dense_Dense6583",0,0,{}]]]},{"name":"dense_Dense6585","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6585","trainable":true},"inbound_nodes":[[["dense_Dense6584",0,0,{}]]]},{"name":"dense_Dense6586","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6586","trainable":true},"inbound_nodes":[[["dense_Dense6585",0,0,{}]]]},{"name":"dense_Dense6587","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6587","trainable":true},"inbound_nodes":[[["dense_Dense6586",0,0,{}]]]},{"name":"dense_Dense6588","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6588","trainable":true},"inbound_nodes":[[["dense_Dense6587",0,0,{}]]]}],"input_layers":[["input1098",0,0]],"output_layers":[["dense_Dense6588",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6583/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6583/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6584/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6584/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6585/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6585/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6586/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense6586/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6587/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense6587/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6588/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6588/bias","shape":[1],"dtype":"float32"}]}]}