{"modelTopology":{"class_name":"Model","config":{"name":"model445","layers":[{"name":"input445","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input445"},"inbound_nodes":[]},{"name":"dense_Dense2665","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2665","trainable":true},"inbound_nodes":[[["input445",0,0,{}]]]},{"name":"dense_Dense2666","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2666","trainable":true},"inbound_nodes":[[["dense_Dense2665",0,0,{}]]]},{"name":"dense_Dense2667","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2667","trainable":true},"inbound_nodes":[[["dense_Dense2666",0,0,{}]]]},{"name":"dense_Dense2668","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2668","trainable":true},"inbound_nodes":[[["dense_Dense2667",0,0,{}]]]},{"name":"dense_Dense2669","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2669","trainable":true},"inbound_nodes":[[["dense_Dense2668",0,0,{}]]]},{"name":"dense_Dense2670","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2670","trainable":true},"inbound_nodes":[[["dense_Dense2669",0,0,{}]]]}],"input_layers":[["input445",0,0]],"output_layers":[["dense_Dense2670",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2665/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense2665/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2666/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2666/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2667/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2667/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2668/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense2668/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2669/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2669/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2670/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2670/bias","shape":[1],"dtype":"float32"}]}]}