{"modelTopology":{"class_name":"Model","config":{"name":"model28","layers":[{"name":"input28","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input28"},"inbound_nodes":[]},{"name":"dense_Dense82","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense82","trainable":true},"inbound_nodes":[[["input28",0,0,{}]]]},{"name":"dense_Dense83","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense83","trainable":true},"inbound_nodes":[[["dense_Dense82",0,0,{}]]]},{"name":"dense_Dense84","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense84","trainable":true},"inbound_nodes":[[["dense_Dense83",0,0,{}]]]}],"input_layers":[["input28",0,0]],"output_layers":[["dense_Dense84",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense82/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense82/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense83/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense83/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense84/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense84/bias","shape":[1],"dtype":"float32"}]}]}