{"modelTopology":{"class_name":"Model","config":{"name":"model406","layers":[{"name":"input406","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input406"},"inbound_nodes":[]},{"name":"dense_Dense2431","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2431","trainable":true},"inbound_nodes":[[["input406",0,0,{}]]]},{"name":"dense_Dense2432","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2432","trainable":true},"inbound_nodes":[[["dense_Dense2431",0,0,{}]]]},{"name":"dense_Dense2433","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2433","trainable":true},"inbound_nodes":[[["dense_Dense2432",0,0,{}]]]},{"name":"dense_Dense2434","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2434","trainable":true},"inbound_nodes":[[["dense_Dense2433",0,0,{}]]]},{"name":"dense_Dense2435","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2435","trainable":true},"inbound_nodes":[[["dense_Dense2434",0,0,{}]]]},{"name":"dense_Dense2436","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2436","trainable":true},"inbound_nodes":[[["dense_Dense2435",0,0,{}]]]}],"input_layers":[["input406",0,0]],"output_layers":[["dense_Dense2436",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2431/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2431/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2432/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense2432/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2433/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2433/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2434/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense2434/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2435/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2435/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2436/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2436/bias","shape":[1],"dtype":"float32"}]}]}