{"modelTopology":{"class_name":"Model","config":{"name":"model1076","layers":[{"name":"input1076","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1076"},"inbound_nodes":[]},{"name":"dense_Dense5376","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5376","trainable":true},"inbound_nodes":[[["input1076",0,0,{}]]]},{"name":"dense_Dense5377","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5377","trainable":true},"inbound_nodes":[[["dense_Dense5376",0,0,{}]]]},{"name":"dense_Dense5378","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5378","trainable":true},"inbound_nodes":[[["dense_Dense5377",0,0,{}]]]},{"name":"dense_Dense5379","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5379","trainable":true},"inbound_nodes":[[["dense_Dense5378",0,0,{}]]]},{"name":"dense_Dense5380","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5380","trainable":true},"inbound_nodes":[[["dense_Dense5379",0,0,{}]]]}],"input_layers":[["input1076",0,0]],"output_layers":[["dense_Dense5380",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5376/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5376/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5377/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense5377/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5378/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense5378/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5379/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense5379/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5380/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5380/bias","shape":[1],"dtype":"float32"}]}]}