{"modelTopology":{"class_name":"Model","config":{"name":"model906","layers":[{"name":"input906","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input906"},"inbound_nodes":[]},{"name":"dense_Dense5431","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5431","trainable":true},"inbound_nodes":[[["input906",0,0,{}]]]},{"name":"dense_Dense5432","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5432","trainable":true},"inbound_nodes":[[["dense_Dense5431",0,0,{}]]]},{"name":"dense_Dense5433","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5433","trainable":true},"inbound_nodes":[[["dense_Dense5432",0,0,{}]]]},{"name":"dense_Dense5434","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5434","trainable":true},"inbound_nodes":[[["dense_Dense5433",0,0,{}]]]},{"name":"dense_Dense5435","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5435","trainable":true},"inbound_nodes":[[["dense_Dense5434",0,0,{}]]]},{"name":"dense_Dense5436","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5436","trainable":true},"inbound_nodes":[[["dense_Dense5435",0,0,{}]]]}],"input_layers":[["input906",0,0]],"output_layers":[["dense_Dense5436",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5431/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense5431/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5432/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense5432/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5433/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense5433/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5434/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5434/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5435/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense5435/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5436/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5436/bias","shape":[1],"dtype":"float32"}]}]}