{"modelTopology":{"class_name":"Model","config":{"name":"model712","layers":[{"name":"input712","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input712"},"inbound_nodes":[]},{"name":"dense_Dense3556","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3556","trainable":true},"inbound_nodes":[[["input712",0,0,{}]]]},{"name":"dense_Dense3557","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3557","trainable":true},"inbound_nodes":[[["dense_Dense3556",0,0,{}]]]},{"name":"dense_Dense3558","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3558","trainable":true},"inbound_nodes":[[["dense_Dense3557",0,0,{}]]]},{"name":"dense_Dense3559","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3559","trainable":true},"inbound_nodes":[[["dense_Dense3558",0,0,{}]]]},{"name":"dense_Dense3560","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3560","trainable":true},"inbound_nodes":[[["dense_Dense3559",0,0,{}]]]}],"input_layers":[["input712",0,0]],"output_layers":[["dense_Dense3560",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3556/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3556/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3557/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense3557/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3558/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense3558/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3559/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense3559/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3560/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3560/bias","shape":[1],"dtype":"float32"}]}]}