{"modelTopology":{"class_name":"Model","config":{"name":"model57","layers":[{"name":"input57","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input57"},"inbound_nodes":[]},{"name":"dense_Dense337","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense337","trainable":true},"inbound_nodes":[[["input57",0,0,{}]]]},{"name":"dense_Dense338","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense338","trainable":true},"inbound_nodes":[[["dense_Dense337",0,0,{}]]]},{"name":"dense_Dense339","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense339","trainable":true},"inbound_nodes":[[["dense_Dense338",0,0,{}]]]},{"name":"dense_Dense340","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense340","trainable":true},"inbound_nodes":[[["dense_Dense339",0,0,{}]]]},{"name":"dense_Dense341","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense341","trainable":true},"inbound_nodes":[[["dense_Dense340",0,0,{}]]]},{"name":"dense_Dense342","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense342","trainable":true},"inbound_nodes":[[["dense_Dense341",0,0,{}]]]}],"input_layers":[["input57",0,0]],"output_layers":[["dense_Dense342",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense337/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense337/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense338/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense338/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense339/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense339/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense340/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense340/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense341/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense341/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense342/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense342/bias","shape":[1],"dtype":"float32"}]}]}