{"modelTopology":{"class_name":"Model","config":{"name":"model866","layers":[{"name":"input866","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input866"},"inbound_nodes":[]},{"name":"dense_Dense5191","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5191","trainable":true},"inbound_nodes":[[["input866",0,0,{}]]]},{"name":"dense_Dense5192","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5192","trainable":true},"inbound_nodes":[[["dense_Dense5191",0,0,{}]]]},{"name":"dense_Dense5193","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5193","trainable":true},"inbound_nodes":[[["dense_Dense5192",0,0,{}]]]},{"name":"dense_Dense5194","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5194","trainable":true},"inbound_nodes":[[["dense_Dense5193",0,0,{}]]]},{"name":"dense_Dense5195","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5195","trainable":true},"inbound_nodes":[[["dense_Dense5194",0,0,{}]]]},{"name":"dense_Dense5196","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5196","trainable":true},"inbound_nodes":[[["dense_Dense5195",0,0,{}]]]}],"input_layers":[["input866",0,0]],"output_layers":[["dense_Dense5196",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5191/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5191/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5192/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense5192/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5193/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense5193/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5194/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5194/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5195/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense5195/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5196/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5196/bias","shape":[1],"dtype":"float32"}]}]}