{"modelTopology":{"class_name":"Model","config":{"name":"model951","layers":[{"name":"input951","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input951"},"inbound_nodes":[]},{"name":"dense_Dense5701","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5701","trainable":true},"inbound_nodes":[[["input951",0,0,{}]]]},{"name":"dense_Dense5702","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5702","trainable":true},"inbound_nodes":[[["dense_Dense5701",0,0,{}]]]},{"name":"dense_Dense5703","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5703","trainable":true},"inbound_nodes":[[["dense_Dense5702",0,0,{}]]]},{"name":"dense_Dense5704","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5704","trainable":true},"inbound_nodes":[[["dense_Dense5703",0,0,{}]]]},{"name":"dense_Dense5705","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5705","trainable":true},"inbound_nodes":[[["dense_Dense5704",0,0,{}]]]},{"name":"dense_Dense5706","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5706","trainable":true},"inbound_nodes":[[["dense_Dense5705",0,0,{}]]]}],"input_layers":[["input951",0,0]],"output_layers":[["dense_Dense5706",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5701/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense5701/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5702/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense5702/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5703/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense5703/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5704/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense5704/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5705/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense5705/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5706/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5706/bias","shape":[1],"dtype":"float32"}]}]}