{"modelTopology":{"class_name":"Model","config":{"name":"model601","layers":[{"name":"input601","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input601"},"inbound_nodes":[]},{"name":"dense_Dense3601","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3601","trainable":true},"inbound_nodes":[[["input601",0,0,{}]]]},{"name":"dense_Dense3602","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3602","trainable":true},"inbound_nodes":[[["dense_Dense3601",0,0,{}]]]},{"name":"dense_Dense3603","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3603","trainable":true},"inbound_nodes":[[["dense_Dense3602",0,0,{}]]]},{"name":"dense_Dense3604","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3604","trainable":true},"inbound_nodes":[[["dense_Dense3603",0,0,{}]]]},{"name":"dense_Dense3605","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3605","trainable":true},"inbound_nodes":[[["dense_Dense3604",0,0,{}]]]},{"name":"dense_Dense3606","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3606","trainable":true},"inbound_nodes":[[["dense_Dense3605",0,0,{}]]]}],"input_layers":[["input601",0,0]],"output_layers":[["dense_Dense3606",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3601/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense3601/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3602/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense3602/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3603/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3603/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3604/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense3604/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3605/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3605/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3606/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense3606/bias","shape":[1],"dtype":"float32"}]}]}