{"modelTopology":{"class_name":"Model","config":{"name":"model398","layers":[{"name":"input398","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input398"},"inbound_nodes":[]},{"name":"dense_Dense2383","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2383","trainable":true},"inbound_nodes":[[["input398",0,0,{}]]]},{"name":"dense_Dense2384","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2384","trainable":true},"inbound_nodes":[[["dense_Dense2383",0,0,{}]]]},{"name":"dense_Dense2385","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2385","trainable":true},"inbound_nodes":[[["dense_Dense2384",0,0,{}]]]},{"name":"dense_Dense2386","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2386","trainable":true},"inbound_nodes":[[["dense_Dense2385",0,0,{}]]]},{"name":"dense_Dense2387","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2387","trainable":true},"inbound_nodes":[[["dense_Dense2386",0,0,{}]]]},{"name":"dense_Dense2388","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2388","trainable":true},"inbound_nodes":[[["dense_Dense2387",0,0,{}]]]}],"input_layers":[["input398",0,0]],"output_layers":[["dense_Dense2388",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2383/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2383/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2384/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2384/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2385/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2385/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2386/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2386/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2387/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2387/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2388/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense2388/bias","shape":[1],"dtype":"float32"}]}]}