{"modelTopology":{"class_name":"Model","config":{"name":"model1196","layers":[{"name":"input1196","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1196"},"inbound_nodes":[]},{"name":"dense_Dense7171","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7171","trainable":true},"inbound_nodes":[[["input1196",0,0,{}]]]},{"name":"dense_Dense7172","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7172","trainable":true},"inbound_nodes":[[["dense_Dense7171",0,0,{}]]]},{"name":"dense_Dense7173","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7173","trainable":true},"inbound_nodes":[[["dense_Dense7172",0,0,{}]]]},{"name":"dense_Dense7174","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7174","trainable":true},"inbound_nodes":[[["dense_Dense7173",0,0,{}]]]},{"name":"dense_Dense7175","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7175","trainable":true},"inbound_nodes":[[["dense_Dense7174",0,0,{}]]]},{"name":"dense_Dense7176","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7176","trainable":true},"inbound_nodes":[[["dense_Dense7175",0,0,{}]]]}],"input_layers":[["input1196",0,0]],"output_layers":[["dense_Dense7176",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7171/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense7171/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7172/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7172/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7173/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7173/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7174/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense7174/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7175/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense7175/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7176/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense7176/bias","shape":[1],"dtype":"float32"}]}]}