{"modelTopology":{"class_name":"Model","config":{"name":"model308","layers":[{"name":"input308","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input308"},"inbound_nodes":[]},{"name":"dense_Dense1843","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1843","trainable":true},"inbound_nodes":[[["input308",0,0,{}]]]},{"name":"dense_Dense1844","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1844","trainable":true},"inbound_nodes":[[["dense_Dense1843",0,0,{}]]]},{"name":"dense_Dense1845","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1845","trainable":true},"inbound_nodes":[[["dense_Dense1844",0,0,{}]]]},{"name":"dense_Dense1846","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1846","trainable":true},"inbound_nodes":[[["dense_Dense1845",0,0,{}]]]},{"name":"dense_Dense1847","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1847","trainable":true},"inbound_nodes":[[["dense_Dense1846",0,0,{}]]]},{"name":"dense_Dense1848","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1848","trainable":true},"inbound_nodes":[[["dense_Dense1847",0,0,{}]]]}],"input_layers":[["input308",0,0]],"output_layers":[["dense_Dense1848",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1843/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1843/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1844/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1844/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1845/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1845/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1846/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1846/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1847/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1847/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1848/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1848/bias","shape":[1],"dtype":"float32"}]}]}