{"modelTopology":{"class_name":"Model","config":{"name":"model813","layers":[{"name":"input813","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input813"},"inbound_nodes":[]},{"name":"dense_Dense4061","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4061","trainable":true},"inbound_nodes":[[["input813",0,0,{}]]]},{"name":"dense_Dense4062","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4062","trainable":true},"inbound_nodes":[[["dense_Dense4061",0,0,{}]]]},{"name":"dense_Dense4063","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4063","trainable":true},"inbound_nodes":[[["dense_Dense4062",0,0,{}]]]},{"name":"dense_Dense4064","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4064","trainable":true},"inbound_nodes":[[["dense_Dense4063",0,0,{}]]]},{"name":"dense_Dense4065","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4065","trainable":true},"inbound_nodes":[[["dense_Dense4064",0,0,{}]]]}],"input_layers":[["input813",0,0]],"output_layers":[["dense_Dense4065",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4061/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4061/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4062/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4062/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4063/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4063/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4064/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense4064/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4065/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4065/bias","shape":[1],"dtype":"float32"}]}]}