{"modelTopology":{"class_name":"Model","config":{"name":"model347","layers":[{"name":"input347","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input347"},"inbound_nodes":[]},{"name":"dense_Dense1731","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1731","trainable":true},"inbound_nodes":[[["input347",0,0,{}]]]},{"name":"dense_Dense1732","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1732","trainable":true},"inbound_nodes":[[["dense_Dense1731",0,0,{}]]]},{"name":"dense_Dense1733","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1733","trainable":true},"inbound_nodes":[[["dense_Dense1732",0,0,{}]]]},{"name":"dense_Dense1734","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1734","trainable":true},"inbound_nodes":[[["dense_Dense1733",0,0,{}]]]},{"name":"dense_Dense1735","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1735","trainable":true},"inbound_nodes":[[["dense_Dense1734",0,0,{}]]]}],"input_layers":[["input347",0,0]],"output_layers":[["dense_Dense1735",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1731/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1731/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1732/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense1732/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1733/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense1733/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1734/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense1734/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1735/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense1735/bias","shape":[1],"dtype":"float32"}]}]}