{"modelTopology":{"class_name":"Model","config":{"name":"model320","layers":[{"name":"input320","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input320"},"inbound_nodes":[]},{"name":"dense_Dense1915","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1915","trainable":true},"inbound_nodes":[[["input320",0,0,{}]]]},{"name":"dense_Dense1916","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1916","trainable":true},"inbound_nodes":[[["dense_Dense1915",0,0,{}]]]},{"name":"dense_Dense1917","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1917","trainable":true},"inbound_nodes":[[["dense_Dense1916",0,0,{}]]]},{"name":"dense_Dense1918","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1918","trainable":true},"inbound_nodes":[[["dense_Dense1917",0,0,{}]]]},{"name":"dense_Dense1919","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1919","trainable":true},"inbound_nodes":[[["dense_Dense1918",0,0,{}]]]},{"name":"dense_Dense1920","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1920","trainable":true},"inbound_nodes":[[["dense_Dense1919",0,0,{}]]]}],"input_layers":[["input320",0,0]],"output_layers":[["dense_Dense1920",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1915/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1915/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1916/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1916/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1917/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1917/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1918/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense1918/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1919/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1919/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1920/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1920/bias","shape":[1],"dtype":"float32"}]}]}