{"modelTopology":{"class_name":"Model","config":{"name":"model1214","layers":[{"name":"input1214","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1214"},"inbound_nodes":[]},{"name":"dense_Dense7279","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7279","trainable":true},"inbound_nodes":[[["input1214",0,0,{}]]]},{"name":"dense_Dense7280","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7280","trainable":true},"inbound_nodes":[[["dense_Dense7279",0,0,{}]]]},{"name":"dense_Dense7281","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7281","trainable":true},"inbound_nodes":[[["dense_Dense7280",0,0,{}]]]},{"name":"dense_Dense7282","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7282","trainable":true},"inbound_nodes":[[["dense_Dense7281",0,0,{}]]]},{"name":"dense_Dense7283","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7283","trainable":true},"inbound_nodes":[[["dense_Dense7282",0,0,{}]]]},{"name":"dense_Dense7284","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7284","trainable":true},"inbound_nodes":[[["dense_Dense7283",0,0,{}]]]}],"input_layers":[["input1214",0,0]],"output_layers":[["dense_Dense7284",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7279/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense7279/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7280/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense7280/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7281/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7281/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7282/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense7282/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7283/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense7283/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7284/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense7284/bias","shape":[1],"dtype":"float32"}]}]}