{"modelTopology":{"class_name":"Model","config":{"name":"model1012","layers":[{"name":"input1012","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1012"},"inbound_nodes":[]},{"name":"dense_Dense6067","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6067","trainable":true},"inbound_nodes":[[["input1012",0,0,{}]]]},{"name":"dense_Dense6068","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6068","trainable":true},"inbound_nodes":[[["dense_Dense6067",0,0,{}]]]},{"name":"dense_Dense6069","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6069","trainable":true},"inbound_nodes":[[["dense_Dense6068",0,0,{}]]]},{"name":"dense_Dense6070","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6070","trainable":true},"inbound_nodes":[[["dense_Dense6069",0,0,{}]]]},{"name":"dense_Dense6071","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6071","trainable":true},"inbound_nodes":[[["dense_Dense6070",0,0,{}]]]},{"name":"dense_Dense6072","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6072","trainable":true},"inbound_nodes":[[["dense_Dense6071",0,0,{}]]]}],"input_layers":[["input1012",0,0]],"output_layers":[["dense_Dense6072",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6067/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6067/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6068/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense6068/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6069/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6069/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6070/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6070/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6071/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense6071/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6072/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense6072/bias","shape":[1],"dtype":"float32"}]}]}