{"modelTopology":{"class_name":"Model","config":{"name":"model103","layers":[{"name":"input103","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input103"},"inbound_nodes":[]},{"name":"dense_Dense409","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense409","trainable":true},"inbound_nodes":[[["input103",0,0,{}]]]},{"name":"dense_Dense410","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense410","trainable":true},"inbound_nodes":[[["dense_Dense409",0,0,{}]]]},{"name":"dense_Dense411","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense411","trainable":true},"inbound_nodes":[[["dense_Dense410",0,0,{}]]]},{"name":"dense_Dense412","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense412","trainable":true},"inbound_nodes":[[["dense_Dense411",0,0,{}]]]}],"input_layers":[["input103",0,0]],"output_layers":[["dense_Dense412",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense409/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense409/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense410/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense410/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense411/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense411/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense412/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense412/bias","shape":[1],"dtype":"float32"}]}]}