{"modelTopology":{"class_name":"Model","config":{"name":"model87","layers":[{"name":"input87","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input87"},"inbound_nodes":[]},{"name":"dense_Dense517","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense517","trainable":true},"inbound_nodes":[[["input87",0,0,{}]]]},{"name":"dense_Dense518","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense518","trainable":true},"inbound_nodes":[[["dense_Dense517",0,0,{}]]]},{"name":"dense_Dense519","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense519","trainable":true},"inbound_nodes":[[["dense_Dense518",0,0,{}]]]},{"name":"dense_Dense520","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense520","trainable":true},"inbound_nodes":[[["dense_Dense519",0,0,{}]]]},{"name":"dense_Dense521","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense521","trainable":true},"inbound_nodes":[[["dense_Dense520",0,0,{}]]]},{"name":"dense_Dense522","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense522","trainable":true},"inbound_nodes":[[["dense_Dense521",0,0,{}]]]}],"input_layers":[["input87",0,0]],"output_layers":[["dense_Dense522",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense517/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense517/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense518/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense518/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense519/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense519/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense520/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense520/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense521/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense521/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense522/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense522/bias","shape":[1],"dtype":"float32"}]}]}