{"modelTopology":{"class_name":"Model","config":{"name":"model1192","layers":[{"name":"input1192","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1192"},"inbound_nodes":[]},{"name":"dense_Dense5956","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5956","trainable":true},"inbound_nodes":[[["input1192",0,0,{}]]]},{"name":"dense_Dense5957","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5957","trainable":true},"inbound_nodes":[[["dense_Dense5956",0,0,{}]]]},{"name":"dense_Dense5958","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5958","trainable":true},"inbound_nodes":[[["dense_Dense5957",0,0,{}]]]},{"name":"dense_Dense5959","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5959","trainable":true},"inbound_nodes":[[["dense_Dense5958",0,0,{}]]]},{"name":"dense_Dense5960","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5960","trainable":true},"inbound_nodes":[[["dense_Dense5959",0,0,{}]]]}],"input_layers":[["input1192",0,0]],"output_layers":[["dense_Dense5960",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5956/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5956/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5957/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense5957/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5958/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5958/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5959/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense5959/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5960/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5960/bias","shape":[1],"dtype":"float32"}]}]}