{"modelTopology":{"class_name":"Model","config":{"name":"model981","layers":[{"name":"input981","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input981"},"inbound_nodes":[]},{"name":"dense_Dense5881","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5881","trainable":true},"inbound_nodes":[[["input981",0,0,{}]]]},{"name":"dense_Dense5882","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5882","trainable":true},"inbound_nodes":[[["dense_Dense5881",0,0,{}]]]},{"name":"dense_Dense5883","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5883","trainable":true},"inbound_nodes":[[["dense_Dense5882",0,0,{}]]]},{"name":"dense_Dense5884","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5884","trainable":true},"inbound_nodes":[[["dense_Dense5883",0,0,{}]]]},{"name":"dense_Dense5885","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5885","trainable":true},"inbound_nodes":[[["dense_Dense5884",0,0,{}]]]},{"name":"dense_Dense5886","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5886","trainable":true},"inbound_nodes":[[["dense_Dense5885",0,0,{}]]]}],"input_layers":[["input981",0,0]],"output_layers":[["dense_Dense5886",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5881/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense5881/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5882/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense5882/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5883/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5883/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5884/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense5884/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5885/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense5885/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5886/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5886/bias","shape":[1],"dtype":"float32"}]}]}