{"modelTopology":{"class_name":"Model","config":{"name":"model203","layers":[{"name":"input203","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input203"},"inbound_nodes":[]},{"name":"dense_Dense809","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense809","trainable":true},"inbound_nodes":[[["input203",0,0,{}]]]},{"name":"dense_Dense810","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense810","trainable":true},"inbound_nodes":[[["dense_Dense809",0,0,{}]]]},{"name":"dense_Dense811","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense811","trainable":true},"inbound_nodes":[[["dense_Dense810",0,0,{}]]]},{"name":"dense_Dense812","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense812","trainable":true},"inbound_nodes":[[["dense_Dense811",0,0,{}]]]}],"input_layers":[["input203",0,0]],"output_layers":[["dense_Dense812",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense809/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense809/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense810/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense810/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense811/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense811/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense812/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense812/bias","shape":[1],"dtype":"float32"}]}]}