{"modelTopology":{"class_name":"Model","config":{"name":"model664","layers":[{"name":"input664","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input664"},"inbound_nodes":[]},{"name":"dense_Dense3979","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3979","trainable":true},"inbound_nodes":[[["input664",0,0,{}]]]},{"name":"dense_Dense3980","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3980","trainable":true},"inbound_nodes":[[["dense_Dense3979",0,0,{}]]]},{"name":"dense_Dense3981","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3981","trainable":true},"inbound_nodes":[[["dense_Dense3980",0,0,{}]]]},{"name":"dense_Dense3982","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3982","trainable":true},"inbound_nodes":[[["dense_Dense3981",0,0,{}]]]},{"name":"dense_Dense3983","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3983","trainable":true},"inbound_nodes":[[["dense_Dense3982",0,0,{}]]]},{"name":"dense_Dense3984","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3984","trainable":true},"inbound_nodes":[[["dense_Dense3983",0,0,{}]]]}],"input_layers":[["input664",0,0]],"output_layers":[["dense_Dense3984",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3979/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense3979/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3980/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense3980/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3981/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3981/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3982/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3982/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3983/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3983/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3984/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3984/bias","shape":[1],"dtype":"float32"}]}]}