{"modelTopology":{"class_name":"Model","config":{"name":"model576","layers":[{"name":"input576","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input576"},"inbound_nodes":[]},{"name":"dense_Dense3451","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3451","trainable":true},"inbound_nodes":[[["input576",0,0,{}]]]},{"name":"dense_Dense3452","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3452","trainable":true},"inbound_nodes":[[["dense_Dense3451",0,0,{}]]]},{"name":"dense_Dense3453","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3453","trainable":true},"inbound_nodes":[[["dense_Dense3452",0,0,{}]]]},{"name":"dense_Dense3454","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3454","trainable":true},"inbound_nodes":[[["dense_Dense3453",0,0,{}]]]},{"name":"dense_Dense3455","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3455","trainable":true},"inbound_nodes":[[["dense_Dense3454",0,0,{}]]]},{"name":"dense_Dense3456","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3456","trainable":true},"inbound_nodes":[[["dense_Dense3455",0,0,{}]]]}],"input_layers":[["input576",0,0]],"output_layers":[["dense_Dense3456",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3451/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3451/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3452/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3452/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3453/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3453/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3454/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense3454/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3455/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense3455/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3456/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3456/bias","shape":[1],"dtype":"float32"}]}]}