{"modelTopology":{"class_name":"Model","config":{"name":"model891","layers":[{"name":"input891","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input891"},"inbound_nodes":[]},{"name":"dense_Dense4451","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4451","trainable":true},"inbound_nodes":[[["input891",0,0,{}]]]},{"name":"dense_Dense4452","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4452","trainable":true},"inbound_nodes":[[["dense_Dense4451",0,0,{}]]]},{"name":"dense_Dense4453","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4453","trainable":true},"inbound_nodes":[[["dense_Dense4452",0,0,{}]]]},{"name":"dense_Dense4454","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4454","trainable":true},"inbound_nodes":[[["dense_Dense4453",0,0,{}]]]},{"name":"dense_Dense4455","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4455","trainable":true},"inbound_nodes":[[["dense_Dense4454",0,0,{}]]]}],"input_layers":[["input891",0,0]],"output_layers":[["dense_Dense4455",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4451/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4451/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4452/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4452/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4453/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense4453/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4454/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense4454/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4455/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4455/bias","shape":[1],"dtype":"float32"}]}]}