{"modelTopology":{"class_name":"Model","config":{"name":"model114","layers":[{"name":"input114","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input114"},"inbound_nodes":[]},{"name":"dense_Dense679","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense679","trainable":true},"inbound_nodes":[[["input114",0,0,{}]]]},{"name":"dense_Dense680","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense680","trainable":true},"inbound_nodes":[[["dense_Dense679",0,0,{}]]]},{"name":"dense_Dense681","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense681","trainable":true},"inbound_nodes":[[["dense_Dense680",0,0,{}]]]},{"name":"dense_Dense682","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense682","trainable":true},"inbound_nodes":[[["dense_Dense681",0,0,{}]]]},{"name":"dense_Dense683","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense683","trainable":true},"inbound_nodes":[[["dense_Dense682",0,0,{}]]]},{"name":"dense_Dense684","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense684","trainable":true},"inbound_nodes":[[["dense_Dense683",0,0,{}]]]}],"input_layers":[["input114",0,0]],"output_layers":[["dense_Dense684",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense679/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense679/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense680/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense680/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense681/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense681/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense682/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense682/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense683/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense683/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense684/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense684/bias","shape":[1],"dtype":"float32"}]}]}