{"modelTopology":{"class_name":"Model","config":{"name":"model246","layers":[{"name":"input246","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input246"},"inbound_nodes":[]},{"name":"dense_Dense1226","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1226","trainable":true},"inbound_nodes":[[["input246",0,0,{}]]]},{"name":"dense_Dense1227","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1227","trainable":true},"inbound_nodes":[[["dense_Dense1226",0,0,{}]]]},{"name":"dense_Dense1228","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1228","trainable":true},"inbound_nodes":[[["dense_Dense1227",0,0,{}]]]},{"name":"dense_Dense1229","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1229","trainable":true},"inbound_nodes":[[["dense_Dense1228",0,0,{}]]]},{"name":"dense_Dense1230","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1230","trainable":true},"inbound_nodes":[[["dense_Dense1229",0,0,{}]]]}],"input_layers":[["input246",0,0]],"output_layers":[["dense_Dense1230",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1226/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1226/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1227/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1227/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1228/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1228/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1229/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense1229/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1230/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1230/bias","shape":[1],"dtype":"float32"}]}]}