{"modelTopology":{"class_name":"Model","config":{"name":"model1057","layers":[{"name":"input1057","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1057"},"inbound_nodes":[]},{"name":"dense_Dense6337","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6337","trainable":true},"inbound_nodes":[[["input1057",0,0,{}]]]},{"name":"dense_Dense6338","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6338","trainable":true},"inbound_nodes":[[["dense_Dense6337",0,0,{}]]]},{"name":"dense_Dense6339","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6339","trainable":true},"inbound_nodes":[[["dense_Dense6338",0,0,{}]]]},{"name":"dense_Dense6340","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6340","trainable":true},"inbound_nodes":[[["dense_Dense6339",0,0,{}]]]},{"name":"dense_Dense6341","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6341","trainable":true},"inbound_nodes":[[["dense_Dense6340",0,0,{}]]]},{"name":"dense_Dense6342","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6342","trainable":true},"inbound_nodes":[[["dense_Dense6341",0,0,{}]]]}],"input_layers":[["input1057",0,0]],"output_layers":[["dense_Dense6342",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6337/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense6337/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6338/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense6338/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6339/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6339/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6340/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense6340/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6341/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6341/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6342/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense6342/bias","shape":[1],"dtype":"float32"}]}]}