{"modelTopology":{"class_name":"Model","config":{"name":"model485","layers":[{"name":"input485","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input485"},"inbound_nodes":[]},{"name":"dense_Dense2421","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2421","trainable":true},"inbound_nodes":[[["input485",0,0,{}]]]},{"name":"dense_Dense2422","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2422","trainable":true},"inbound_nodes":[[["dense_Dense2421",0,0,{}]]]},{"name":"dense_Dense2423","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2423","trainable":true},"inbound_nodes":[[["dense_Dense2422",0,0,{}]]]},{"name":"dense_Dense2424","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2424","trainable":true},"inbound_nodes":[[["dense_Dense2423",0,0,{}]]]},{"name":"dense_Dense2425","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2425","trainable":true},"inbound_nodes":[[["dense_Dense2424",0,0,{}]]]}],"input_layers":[["input485",0,0]],"output_layers":[["dense_Dense2425",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2421/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2421/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2422/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2422/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2423/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense2423/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2424/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2424/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2425/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2425/bias","shape":[1],"dtype":"float32"}]}]}