{"modelTopology":{"class_name":"Model","config":{"name":"model908","layers":[{"name":"input908","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input908"},"inbound_nodes":[]},{"name":"dense_Dense5443","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5443","trainable":true},"inbound_nodes":[[["input908",0,0,{}]]]},{"name":"dense_Dense5444","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5444","trainable":true},"inbound_nodes":[[["dense_Dense5443",0,0,{}]]]},{"name":"dense_Dense5445","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5445","trainable":true},"inbound_nodes":[[["dense_Dense5444",0,0,{}]]]},{"name":"dense_Dense5446","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5446","trainable":true},"inbound_nodes":[[["dense_Dense5445",0,0,{}]]]},{"name":"dense_Dense5447","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5447","trainable":true},"inbound_nodes":[[["dense_Dense5446",0,0,{}]]]},{"name":"dense_Dense5448","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5448","trainable":true},"inbound_nodes":[[["dense_Dense5447",0,0,{}]]]}],"input_layers":[["input908",0,0]],"output_layers":[["dense_Dense5448",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5443/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense5443/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5444/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense5444/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5445/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense5445/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5446/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense5446/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5447/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense5447/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5448/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5448/bias","shape":[1],"dtype":"float32"}]}]}