{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]},{"name":"dense_Dense19","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true},"inbound_nodes":[[["dense_Dense18",0,0,{}]]]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["dense_Dense19",0,0,{}]]]}],"input_layers":[["input5",0,0]],"output_layers":[["dense_Dense20",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense17/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense19/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[1],"dtype":"float32"}]}]}