{"modelTopology":{"class_name":"Model","config":{"name":"model1083","layers":[{"name":"input1083","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1083"},"inbound_nodes":[]},{"name":"dense_Dense6493","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6493","trainable":true},"inbound_nodes":[[["input1083",0,0,{}]]]},{"name":"dense_Dense6494","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6494","trainable":true},"inbound_nodes":[[["dense_Dense6493",0,0,{}]]]},{"name":"dense_Dense6495","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6495","trainable":true},"inbound_nodes":[[["dense_Dense6494",0,0,{}]]]},{"name":"dense_Dense6496","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6496","trainable":true},"inbound_nodes":[[["dense_Dense6495",0,0,{}]]]},{"name":"dense_Dense6497","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6497","trainable":true},"inbound_nodes":[[["dense_Dense6496",0,0,{}]]]},{"name":"dense_Dense6498","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6498","trainable":true},"inbound_nodes":[[["dense_Dense6497",0,0,{}]]]}],"input_layers":[["input1083",0,0]],"output_layers":[["dense_Dense6498",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6493/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense6493/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6494/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6494/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6495/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6495/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6496/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense6496/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6497/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense6497/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6498/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6498/bias","shape":[1],"dtype":"float32"}]}]}