{"modelTopology":{"class_name":"Model","config":{"name":"model96","layers":[{"name":"input96","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input96"},"inbound_nodes":[]},{"name":"dense_Dense571","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense571","trainable":true},"inbound_nodes":[[["input96",0,0,{}]]]},{"name":"dense_Dense572","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense572","trainable":true},"inbound_nodes":[[["dense_Dense571",0,0,{}]]]},{"name":"dense_Dense573","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense573","trainable":true},"inbound_nodes":[[["dense_Dense572",0,0,{}]]]},{"name":"dense_Dense574","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense574","trainable":true},"inbound_nodes":[[["dense_Dense573",0,0,{}]]]},{"name":"dense_Dense575","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense575","trainable":true},"inbound_nodes":[[["dense_Dense574",0,0,{}]]]},{"name":"dense_Dense576","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense576","trainable":true},"inbound_nodes":[[["dense_Dense575",0,0,{}]]]}],"input_layers":[["input96",0,0]],"output_layers":[["dense_Dense576",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense571/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense571/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense572/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense572/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense573/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense573/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense574/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense574/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense575/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense575/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense576/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense576/bias","shape":[1],"dtype":"float32"}]}]}