{"modelTopology":{"class_name":"Model","config":{"name":"model267","layers":[{"name":"input267","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input267"},"inbound_nodes":[]},{"name":"dense_Dense1597","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1597","trainable":true},"inbound_nodes":[[["input267",0,0,{}]]]},{"name":"dense_Dense1598","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1598","trainable":true},"inbound_nodes":[[["dense_Dense1597",0,0,{}]]]},{"name":"dense_Dense1599","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1599","trainable":true},"inbound_nodes":[[["dense_Dense1598",0,0,{}]]]},{"name":"dense_Dense1600","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1600","trainable":true},"inbound_nodes":[[["dense_Dense1599",0,0,{}]]]},{"name":"dense_Dense1601","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1601","trainable":true},"inbound_nodes":[[["dense_Dense1600",0,0,{}]]]},{"name":"dense_Dense1602","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1602","trainable":true},"inbound_nodes":[[["dense_Dense1601",0,0,{}]]]}],"input_layers":[["input267",0,0]],"output_layers":[["dense_Dense1602",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1597/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1597/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1598/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1598/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1599/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1599/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1600/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1600/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1601/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense1601/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1602/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1602/bias","shape":[1],"dtype":"float32"}]}]}