{"modelTopology":{"class_name":"Model","config":{"name":"model934","layers":[{"name":"input934","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input934"},"inbound_nodes":[]},{"name":"dense_Dense4666","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4666","trainable":true},"inbound_nodes":[[["input934",0,0,{}]]]},{"name":"dense_Dense4667","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4667","trainable":true},"inbound_nodes":[[["dense_Dense4666",0,0,{}]]]},{"name":"dense_Dense4668","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4668","trainable":true},"inbound_nodes":[[["dense_Dense4667",0,0,{}]]]},{"name":"dense_Dense4669","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4669","trainable":true},"inbound_nodes":[[["dense_Dense4668",0,0,{}]]]},{"name":"dense_Dense4670","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4670","trainable":true},"inbound_nodes":[[["dense_Dense4669",0,0,{}]]]}],"input_layers":[["input934",0,0]],"output_layers":[["dense_Dense4670",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4666/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4666/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4667/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4667/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4668/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense4668/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4669/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4669/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4670/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4670/bias","shape":[1],"dtype":"float32"}]}]}