{"modelTopology":{"class_name":"Model","config":{"name":"model465","layers":[{"name":"input465","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input465"},"inbound_nodes":[]},{"name":"dense_Dense2785","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2785","trainable":true},"inbound_nodes":[[["input465",0,0,{}]]]},{"name":"dense_Dense2786","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2786","trainable":true},"inbound_nodes":[[["dense_Dense2785",0,0,{}]]]},{"name":"dense_Dense2787","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2787","trainable":true},"inbound_nodes":[[["dense_Dense2786",0,0,{}]]]},{"name":"dense_Dense2788","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2788","trainable":true},"inbound_nodes":[[["dense_Dense2787",0,0,{}]]]},{"name":"dense_Dense2789","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2789","trainable":true},"inbound_nodes":[[["dense_Dense2788",0,0,{}]]]},{"name":"dense_Dense2790","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2790","trainable":true},"inbound_nodes":[[["dense_Dense2789",0,0,{}]]]}],"input_layers":[["input465",0,0]],"output_layers":[["dense_Dense2790",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2785/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2785/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2786/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense2786/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2787/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2787/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2788/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense2788/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2789/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense2789/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2790/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2790/bias","shape":[1],"dtype":"float32"}]}]}