{"modelTopology":{"class_name":"Model","config":{"name":"model496","layers":[{"name":"input496","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input496"},"inbound_nodes":[]},{"name":"dense_Dense2476","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2476","trainable":true},"inbound_nodes":[[["input496",0,0,{}]]]},{"name":"dense_Dense2477","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2477","trainable":true},"inbound_nodes":[[["dense_Dense2476",0,0,{}]]]},{"name":"dense_Dense2478","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2478","trainable":true},"inbound_nodes":[[["dense_Dense2477",0,0,{}]]]},{"name":"dense_Dense2479","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2479","trainable":true},"inbound_nodes":[[["dense_Dense2478",0,0,{}]]]},{"name":"dense_Dense2480","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2480","trainable":true},"inbound_nodes":[[["dense_Dense2479",0,0,{}]]]}],"input_layers":[["input496",0,0]],"output_layers":[["dense_Dense2480",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2476/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2476/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2477/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2477/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2478/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2478/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2479/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense2479/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2480/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2480/bias","shape":[1],"dtype":"float32"}]}]}