{"modelTopology":{"class_name":"Model","config":{"name":"model573","layers":[{"name":"input573","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input573"},"inbound_nodes":[]},{"name":"dense_Dense3433","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3433","trainable":true},"inbound_nodes":[[["input573",0,0,{}]]]},{"name":"dense_Dense3434","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3434","trainable":true},"inbound_nodes":[[["dense_Dense3433",0,0,{}]]]},{"name":"dense_Dense3435","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3435","trainable":true},"inbound_nodes":[[["dense_Dense3434",0,0,{}]]]},{"name":"dense_Dense3436","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3436","trainable":true},"inbound_nodes":[[["dense_Dense3435",0,0,{}]]]},{"name":"dense_Dense3437","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3437","trainable":true},"inbound_nodes":[[["dense_Dense3436",0,0,{}]]]},{"name":"dense_Dense3438","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3438","trainable":true},"inbound_nodes":[[["dense_Dense3437",0,0,{}]]]}],"input_layers":[["input573",0,0]],"output_layers":[["dense_Dense3438",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3433/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense3433/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3434/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense3434/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3435/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3435/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3436/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense3436/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3437/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3437/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3438/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3438/bias","shape":[1],"dtype":"float32"}]}]}