{"modelTopology":{"class_name":"Model","config":{"name":"model381","layers":[{"name":"input381","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input381"},"inbound_nodes":[]},{"name":"dense_Dense2281","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2281","trainable":true},"inbound_nodes":[[["input381",0,0,{}]]]},{"name":"dense_Dense2282","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2282","trainable":true},"inbound_nodes":[[["dense_Dense2281",0,0,{}]]]},{"name":"dense_Dense2283","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2283","trainable":true},"inbound_nodes":[[["dense_Dense2282",0,0,{}]]]},{"name":"dense_Dense2284","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2284","trainable":true},"inbound_nodes":[[["dense_Dense2283",0,0,{}]]]},{"name":"dense_Dense2285","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2285","trainable":true},"inbound_nodes":[[["dense_Dense2284",0,0,{}]]]},{"name":"dense_Dense2286","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2286","trainable":true},"inbound_nodes":[[["dense_Dense2285",0,0,{}]]]}],"input_layers":[["input381",0,0]],"output_layers":[["dense_Dense2286",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2281/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2281/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2282/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2282/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2283/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2283/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2284/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense2284/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2285/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2285/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2286/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2286/bias","shape":[1],"dtype":"float32"}]}]}