{"modelTopology":{"class_name":"Model","config":{"name":"model128","layers":[{"name":"input128","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input128"},"inbound_nodes":[]},{"name":"dense_Dense763","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense763","trainable":true},"inbound_nodes":[[["input128",0,0,{}]]]},{"name":"dense_Dense764","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense764","trainable":true},"inbound_nodes":[[["dense_Dense763",0,0,{}]]]},{"name":"dense_Dense765","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense765","trainable":true},"inbound_nodes":[[["dense_Dense764",0,0,{}]]]},{"name":"dense_Dense766","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense766","trainable":true},"inbound_nodes":[[["dense_Dense765",0,0,{}]]]},{"name":"dense_Dense767","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense767","trainable":true},"inbound_nodes":[[["dense_Dense766",0,0,{}]]]},{"name":"dense_Dense768","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense768","trainable":true},"inbound_nodes":[[["dense_Dense767",0,0,{}]]]}],"input_layers":[["input128",0,0]],"output_layers":[["dense_Dense768",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense763/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense763/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense764/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense764/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense765/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense765/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense766/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense766/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense767/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense767/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense768/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense768/bias","shape":[1],"dtype":"float32"}]}]}