{"modelTopology":{"class_name":"Model","config":{"name":"model1272","layers":[{"name":"input1272","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1272"},"inbound_nodes":[]},{"name":"dense_Dense7627","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7627","trainable":true},"inbound_nodes":[[["input1272",0,0,{}]]]},{"name":"dense_Dense7628","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7628","trainable":true},"inbound_nodes":[[["dense_Dense7627",0,0,{}]]]},{"name":"dense_Dense7629","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7629","trainable":true},"inbound_nodes":[[["dense_Dense7628",0,0,{}]]]},{"name":"dense_Dense7630","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7630","trainable":true},"inbound_nodes":[[["dense_Dense7629",0,0,{}]]]},{"name":"dense_Dense7631","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7631","trainable":true},"inbound_nodes":[[["dense_Dense7630",0,0,{}]]]},{"name":"dense_Dense7632","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7632","trainable":true},"inbound_nodes":[[["dense_Dense7631",0,0,{}]]]}],"input_layers":[["input1272",0,0]],"output_layers":[["dense_Dense7632",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7627/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense7627/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7628/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7628/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7629/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7629/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7630/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense7630/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7631/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense7631/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7632/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense7632/bias","shape":[1],"dtype":"float32"}]}]}