{"modelTopology":{"class_name":"Model","config":{"name":"model843","layers":[{"name":"input843","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input843"},"inbound_nodes":[]},{"name":"dense_Dense5053","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5053","trainable":true},"inbound_nodes":[[["input843",0,0,{}]]]},{"name":"dense_Dense5054","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5054","trainable":true},"inbound_nodes":[[["dense_Dense5053",0,0,{}]]]},{"name":"dense_Dense5055","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5055","trainable":true},"inbound_nodes":[[["dense_Dense5054",0,0,{}]]]},{"name":"dense_Dense5056","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5056","trainable":true},"inbound_nodes":[[["dense_Dense5055",0,0,{}]]]},{"name":"dense_Dense5057","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5057","trainable":true},"inbound_nodes":[[["dense_Dense5056",0,0,{}]]]},{"name":"dense_Dense5058","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5058","trainable":true},"inbound_nodes":[[["dense_Dense5057",0,0,{}]]]}],"input_layers":[["input843",0,0]],"output_layers":[["dense_Dense5058",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5053/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5053/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5054/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5054/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5055/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense5055/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5056/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense5056/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5057/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense5057/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5058/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5058/bias","shape":[1],"dtype":"float32"}]}]}