{"modelTopology":{"class_name":"Model","config":{"name":"model1208","layers":[{"name":"input1208","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1208"},"inbound_nodes":[]},{"name":"dense_Dense7243","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7243","trainable":true},"inbound_nodes":[[["input1208",0,0,{}]]]},{"name":"dense_Dense7244","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7244","trainable":true},"inbound_nodes":[[["dense_Dense7243",0,0,{}]]]},{"name":"dense_Dense7245","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7245","trainable":true},"inbound_nodes":[[["dense_Dense7244",0,0,{}]]]},{"name":"dense_Dense7246","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7246","trainable":true},"inbound_nodes":[[["dense_Dense7245",0,0,{}]]]},{"name":"dense_Dense7247","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7247","trainable":true},"inbound_nodes":[[["dense_Dense7246",0,0,{}]]]},{"name":"dense_Dense7248","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7248","trainable":true},"inbound_nodes":[[["dense_Dense7247",0,0,{}]]]}],"input_layers":[["input1208",0,0]],"output_layers":[["dense_Dense7248",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7243/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense7243/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7244/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense7244/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7245/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7245/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7246/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense7246/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7247/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense7247/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7248/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense7248/bias","shape":[1],"dtype":"float32"}]}]}