{"modelTopology":{"class_name":"Model","config":{"name":"model521","layers":[{"name":"input521","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input521"},"inbound_nodes":[]},{"name":"dense_Dense3121","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3121","trainable":true},"inbound_nodes":[[["input521",0,0,{}]]]},{"name":"dense_Dense3122","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3122","trainable":true},"inbound_nodes":[[["dense_Dense3121",0,0,{}]]]},{"name":"dense_Dense3123","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3123","trainable":true},"inbound_nodes":[[["dense_Dense3122",0,0,{}]]]},{"name":"dense_Dense3124","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3124","trainable":true},"inbound_nodes":[[["dense_Dense3123",0,0,{}]]]},{"name":"dense_Dense3125","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3125","trainable":true},"inbound_nodes":[[["dense_Dense3124",0,0,{}]]]},{"name":"dense_Dense3126","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3126","trainable":true},"inbound_nodes":[[["dense_Dense3125",0,0,{}]]]}],"input_layers":[["input521",0,0]],"output_layers":[["dense_Dense3126",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3121/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3121/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3122/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3122/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3123/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3123/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3124/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3124/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3125/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3125/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3126/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3126/bias","shape":[1],"dtype":"float32"}]}]}