{"modelTopology":{"class_name":"Model","config":{"name":"model14","layers":[{"name":"input14","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input14"},"inbound_nodes":[]},{"name":"dense_Dense66","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense66","trainable":true},"inbound_nodes":[[["input14",0,0,{}]]]},{"name":"dense_Dense67","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense67","trainable":true},"inbound_nodes":[[["dense_Dense66",0,0,{}]]]},{"name":"dense_Dense68","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense68","trainable":true},"inbound_nodes":[[["dense_Dense67",0,0,{}]]]},{"name":"dense_Dense69","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense69","trainable":true},"inbound_nodes":[[["dense_Dense68",0,0,{}]]]},{"name":"dense_Dense70","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense70","trainable":true},"inbound_nodes":[[["dense_Dense69",0,0,{}]]]}],"input_layers":[["input14",0,0]],"output_layers":[["dense_Dense70",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense66/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense66/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense67/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense67/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense68/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense68/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense69/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense69/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense70/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense70/bias","shape":[1],"dtype":"float32"}]}]}