{"modelTopology":{"class_name":"Model","config":{"name":"model1073","layers":[{"name":"input1073","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1073"},"inbound_nodes":[]},{"name":"dense_Dense6433","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6433","trainable":true},"inbound_nodes":[[["input1073",0,0,{}]]]},{"name":"dense_Dense6434","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6434","trainable":true},"inbound_nodes":[[["dense_Dense6433",0,0,{}]]]},{"name":"dense_Dense6435","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6435","trainable":true},"inbound_nodes":[[["dense_Dense6434",0,0,{}]]]},{"name":"dense_Dense6436","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6436","trainable":true},"inbound_nodes":[[["dense_Dense6435",0,0,{}]]]},{"name":"dense_Dense6437","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6437","trainable":true},"inbound_nodes":[[["dense_Dense6436",0,0,{}]]]},{"name":"dense_Dense6438","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6438","trainable":true},"inbound_nodes":[[["dense_Dense6437",0,0,{}]]]}],"input_layers":[["input1073",0,0]],"output_layers":[["dense_Dense6438",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6433/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense6433/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6434/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6434/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6435/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6435/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6436/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense6436/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6437/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6437/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6438/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6438/bias","shape":[1],"dtype":"float32"}]}]}