{"modelTopology":{"class_name":"Model","config":{"name":"model466","layers":[{"name":"input466","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input466"},"inbound_nodes":[]},{"name":"dense_Dense2791","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2791","trainable":true},"inbound_nodes":[[["input466",0,0,{}]]]},{"name":"dense_Dense2792","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2792","trainable":true},"inbound_nodes":[[["dense_Dense2791",0,0,{}]]]},{"name":"dense_Dense2793","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2793","trainable":true},"inbound_nodes":[[["dense_Dense2792",0,0,{}]]]},{"name":"dense_Dense2794","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2794","trainable":true},"inbound_nodes":[[["dense_Dense2793",0,0,{}]]]},{"name":"dense_Dense2795","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2795","trainable":true},"inbound_nodes":[[["dense_Dense2794",0,0,{}]]]},{"name":"dense_Dense2796","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2796","trainable":true},"inbound_nodes":[[["dense_Dense2795",0,0,{}]]]}],"input_layers":[["input466",0,0]],"output_layers":[["dense_Dense2796",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2791/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense2791/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2792/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2792/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2793/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2793/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2794/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense2794/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2795/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense2795/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2796/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2796/bias","shape":[1],"dtype":"float32"}]}]}