{"modelTopology":{"class_name":"Model","config":{"name":"model1035","layers":[{"name":"input1035","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1035"},"inbound_nodes":[]},{"name":"dense_Dense6205","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6205","trainable":true},"inbound_nodes":[[["input1035",0,0,{}]]]},{"name":"dense_Dense6206","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6206","trainable":true},"inbound_nodes":[[["dense_Dense6205",0,0,{}]]]},{"name":"dense_Dense6207","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6207","trainable":true},"inbound_nodes":[[["dense_Dense6206",0,0,{}]]]},{"name":"dense_Dense6208","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6208","trainable":true},"inbound_nodes":[[["dense_Dense6207",0,0,{}]]]},{"name":"dense_Dense6209","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6209","trainable":true},"inbound_nodes":[[["dense_Dense6208",0,0,{}]]]},{"name":"dense_Dense6210","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6210","trainable":true},"inbound_nodes":[[["dense_Dense6209",0,0,{}]]]}],"input_layers":[["input1035",0,0]],"output_layers":[["dense_Dense6210",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6205/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6205/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6206/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6206/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6207/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6207/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6208/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6208/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6209/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense6209/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6210/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6210/bias","shape":[1],"dtype":"float32"}]}]}