{"modelTopology":{"class_name":"Model","config":{"name":"model791","layers":[{"name":"input791","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input791"},"inbound_nodes":[]},{"name":"dense_Dense4741","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4741","trainable":true},"inbound_nodes":[[["input791",0,0,{}]]]},{"name":"dense_Dense4742","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4742","trainable":true},"inbound_nodes":[[["dense_Dense4741",0,0,{}]]]},{"name":"dense_Dense4743","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4743","trainable":true},"inbound_nodes":[[["dense_Dense4742",0,0,{}]]]},{"name":"dense_Dense4744","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4744","trainable":true},"inbound_nodes":[[["dense_Dense4743",0,0,{}]]]},{"name":"dense_Dense4745","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4745","trainable":true},"inbound_nodes":[[["dense_Dense4744",0,0,{}]]]},{"name":"dense_Dense4746","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4746","trainable":true},"inbound_nodes":[[["dense_Dense4745",0,0,{}]]]}],"input_layers":[["input791",0,0]],"output_layers":[["dense_Dense4746",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4741/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense4741/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4742/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4742/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4743/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4743/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4744/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4744/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4745/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense4745/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4746/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4746/bias","shape":[1],"dtype":"float32"}]}]}