{"modelTopology":{"class_name":"Model","config":{"name":"model148","layers":[{"name":"input148","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input148"},"inbound_nodes":[]},{"name":"dense_Dense736","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense736","trainable":true},"inbound_nodes":[[["input148",0,0,{}]]]},{"name":"dense_Dense737","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense737","trainable":true},"inbound_nodes":[[["dense_Dense736",0,0,{}]]]},{"name":"dense_Dense738","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense738","trainable":true},"inbound_nodes":[[["dense_Dense737",0,0,{}]]]},{"name":"dense_Dense739","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense739","trainable":true},"inbound_nodes":[[["dense_Dense738",0,0,{}]]]},{"name":"dense_Dense740","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense740","trainable":true},"inbound_nodes":[[["dense_Dense739",0,0,{}]]]}],"input_layers":[["input148",0,0]],"output_layers":[["dense_Dense740",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense736/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense736/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense737/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense737/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense738/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense738/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense739/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense739/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense740/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense740/bias","shape":[1],"dtype":"float32"}]}]}