{"modelTopology":{"class_name":"Model","config":{"name":"model963","layers":[{"name":"input963","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input963"},"inbound_nodes":[]},{"name":"dense_Dense4811","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4811","trainable":true},"inbound_nodes":[[["input963",0,0,{}]]]},{"name":"dense_Dense4812","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4812","trainable":true},"inbound_nodes":[[["dense_Dense4811",0,0,{}]]]},{"name":"dense_Dense4813","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4813","trainable":true},"inbound_nodes":[[["dense_Dense4812",0,0,{}]]]},{"name":"dense_Dense4814","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4814","trainable":true},"inbound_nodes":[[["dense_Dense4813",0,0,{}]]]},{"name":"dense_Dense4815","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4815","trainable":true},"inbound_nodes":[[["dense_Dense4814",0,0,{}]]]}],"input_layers":[["input963",0,0]],"output_layers":[["dense_Dense4815",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4811/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4811/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4812/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense4812/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4813/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense4813/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4814/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense4814/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4815/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4815/bias","shape":[1],"dtype":"float32"}]}]}