{"modelTopology":{"class_name":"Model","config":{"name":"model304","layers":[{"name":"input304","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input304"},"inbound_nodes":[]},{"name":"dense_Dense1819","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1819","trainable":true},"inbound_nodes":[[["input304",0,0,{}]]]},{"name":"dense_Dense1820","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1820","trainable":true},"inbound_nodes":[[["dense_Dense1819",0,0,{}]]]},{"name":"dense_Dense1821","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1821","trainable":true},"inbound_nodes":[[["dense_Dense1820",0,0,{}]]]},{"name":"dense_Dense1822","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1822","trainable":true},"inbound_nodes":[[["dense_Dense1821",0,0,{}]]]},{"name":"dense_Dense1823","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1823","trainable":true},"inbound_nodes":[[["dense_Dense1822",0,0,{}]]]},{"name":"dense_Dense1824","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1824","trainable":true},"inbound_nodes":[[["dense_Dense1823",0,0,{}]]]}],"input_layers":[["input304",0,0]],"output_layers":[["dense_Dense1824",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1819/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1819/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1820/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1820/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1821/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1821/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1822/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense1822/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1823/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1823/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1824/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1824/bias","shape":[1],"dtype":"float32"}]}]}