{"modelTopology":{"class_name":"Model","config":{"name":"model127","layers":[{"name":"input127","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input127"},"inbound_nodes":[]},{"name":"dense_Dense631","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense631","trainable":true},"inbound_nodes":[[["input127",0,0,{}]]]},{"name":"dense_Dense632","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense632","trainable":true},"inbound_nodes":[[["dense_Dense631",0,0,{}]]]},{"name":"dense_Dense633","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense633","trainable":true},"inbound_nodes":[[["dense_Dense632",0,0,{}]]]},{"name":"dense_Dense634","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense634","trainable":true},"inbound_nodes":[[["dense_Dense633",0,0,{}]]]},{"name":"dense_Dense635","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense635","trainable":true},"inbound_nodes":[[["dense_Dense634",0,0,{}]]]}],"input_layers":[["input127",0,0]],"output_layers":[["dense_Dense635",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense631/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense631/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense632/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense632/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense633/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense633/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense634/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense634/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense635/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense635/bias","shape":[1],"dtype":"float32"}]}]}