{"modelTopology":{"class_name":"Model","config":{"name":"model1046","layers":[{"name":"input1046","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1046"},"inbound_nodes":[]},{"name":"dense_Dense5226","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5226","trainable":true},"inbound_nodes":[[["input1046",0,0,{}]]]},{"name":"dense_Dense5227","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5227","trainable":true},"inbound_nodes":[[["dense_Dense5226",0,0,{}]]]},{"name":"dense_Dense5228","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5228","trainable":true},"inbound_nodes":[[["dense_Dense5227",0,0,{}]]]},{"name":"dense_Dense5229","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5229","trainable":true},"inbound_nodes":[[["dense_Dense5228",0,0,{}]]]},{"name":"dense_Dense5230","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5230","trainable":true},"inbound_nodes":[[["dense_Dense5229",0,0,{}]]]}],"input_layers":[["input1046",0,0]],"output_layers":[["dense_Dense5230",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5226/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5226/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5227/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense5227/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5228/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5228/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5229/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense5229/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5230/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5230/bias","shape":[1],"dtype":"float32"}]}]}