{"modelTopology":{"class_name":"Model","config":{"name":"model991","layers":[{"name":"input991","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input991"},"inbound_nodes":[]},{"name":"dense_Dense5941","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5941","trainable":true},"inbound_nodes":[[["input991",0,0,{}]]]},{"name":"dense_Dense5942","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5942","trainable":true},"inbound_nodes":[[["dense_Dense5941",0,0,{}]]]},{"name":"dense_Dense5943","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5943","trainable":true},"inbound_nodes":[[["dense_Dense5942",0,0,{}]]]},{"name":"dense_Dense5944","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5944","trainable":true},"inbound_nodes":[[["dense_Dense5943",0,0,{}]]]},{"name":"dense_Dense5945","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5945","trainable":true},"inbound_nodes":[[["dense_Dense5944",0,0,{}]]]},{"name":"dense_Dense5946","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5946","trainable":true},"inbound_nodes":[[["dense_Dense5945",0,0,{}]]]}],"input_layers":[["input991",0,0]],"output_layers":[["dense_Dense5946",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5941/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense5941/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5942/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense5942/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5943/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5943/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5944/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense5944/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5945/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5945/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5946/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5946/bias","shape":[1],"dtype":"float32"}]}]}