{"modelTopology":{"class_name":"Model","config":{"name":"model1280","layers":[{"name":"input1280","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1280"},"inbound_nodes":[]},{"name":"dense_Dense7675","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7675","trainable":true},"inbound_nodes":[[["input1280",0,0,{}]]]},{"name":"dense_Dense7676","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7676","trainable":true},"inbound_nodes":[[["dense_Dense7675",0,0,{}]]]},{"name":"dense_Dense7677","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7677","trainable":true},"inbound_nodes":[[["dense_Dense7676",0,0,{}]]]},{"name":"dense_Dense7678","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7678","trainable":true},"inbound_nodes":[[["dense_Dense7677",0,0,{}]]]},{"name":"dense_Dense7679","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7679","trainable":true},"inbound_nodes":[[["dense_Dense7678",0,0,{}]]]},{"name":"dense_Dense7680","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7680","trainable":true},"inbound_nodes":[[["dense_Dense7679",0,0,{}]]]}],"input_layers":[["input1280",0,0]],"output_layers":[["dense_Dense7680",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7675/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense7675/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7676/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense7676/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7677/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7677/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7678/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7678/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7679/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense7679/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7680/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense7680/bias","shape":[1],"dtype":"float32"}]}]}