{"modelTopology":{"class_name":"Model","config":{"name":"model752","layers":[{"name":"input752","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input752"},"inbound_nodes":[]},{"name":"dense_Dense3756","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3756","trainable":true},"inbound_nodes":[[["input752",0,0,{}]]]},{"name":"dense_Dense3757","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3757","trainable":true},"inbound_nodes":[[["dense_Dense3756",0,0,{}]]]},{"name":"dense_Dense3758","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3758","trainable":true},"inbound_nodes":[[["dense_Dense3757",0,0,{}]]]},{"name":"dense_Dense3759","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3759","trainable":true},"inbound_nodes":[[["dense_Dense3758",0,0,{}]]]},{"name":"dense_Dense3760","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3760","trainable":true},"inbound_nodes":[[["dense_Dense3759",0,0,{}]]]}],"input_layers":[["input752",0,0]],"output_layers":[["dense_Dense3760",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3756/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3756/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3757/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3757/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3758/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3758/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3759/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense3759/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3760/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3760/bias","shape":[1],"dtype":"float32"}]}]}