{"modelTopology":{"class_name":"Model","config":{"name":"model297","layers":[{"name":"input297","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input297"},"inbound_nodes":[]},{"name":"dense_Dense1777","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1777","trainable":true},"inbound_nodes":[[["input297",0,0,{}]]]},{"name":"dense_Dense1778","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1778","trainable":true},"inbound_nodes":[[["dense_Dense1777",0,0,{}]]]},{"name":"dense_Dense1779","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1779","trainable":true},"inbound_nodes":[[["dense_Dense1778",0,0,{}]]]},{"name":"dense_Dense1780","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1780","trainable":true},"inbound_nodes":[[["dense_Dense1779",0,0,{}]]]},{"name":"dense_Dense1781","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1781","trainable":true},"inbound_nodes":[[["dense_Dense1780",0,0,{}]]]},{"name":"dense_Dense1782","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1782","trainable":true},"inbound_nodes":[[["dense_Dense1781",0,0,{}]]]}],"input_layers":[["input297",0,0]],"output_layers":[["dense_Dense1782",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1777/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense1777/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1778/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense1778/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1779/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1779/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1780/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense1780/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1781/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1781/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1782/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1782/bias","shape":[1],"dtype":"float32"}]}]}