{"modelTopology":{"class_name":"Model","config":{"name":"model572","layers":[{"name":"input572","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input572"},"inbound_nodes":[]},{"name":"dense_Dense3427","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3427","trainable":true},"inbound_nodes":[[["input572",0,0,{}]]]},{"name":"dense_Dense3428","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3428","trainable":true},"inbound_nodes":[[["dense_Dense3427",0,0,{}]]]},{"name":"dense_Dense3429","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3429","trainable":true},"inbound_nodes":[[["dense_Dense3428",0,0,{}]]]},{"name":"dense_Dense3430","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3430","trainable":true},"inbound_nodes":[[["dense_Dense3429",0,0,{}]]]},{"name":"dense_Dense3431","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3431","trainable":true},"inbound_nodes":[[["dense_Dense3430",0,0,{}]]]},{"name":"dense_Dense3432","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3432","trainable":true},"inbound_nodes":[[["dense_Dense3431",0,0,{}]]]}],"input_layers":[["input572",0,0]],"output_layers":[["dense_Dense3432",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3427/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense3427/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3428/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3428/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3429/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3429/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3430/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense3430/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3431/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense3431/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3432/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3432/bias","shape":[1],"dtype":"float32"}]}]}