{"modelTopology":{"class_name":"Model","config":{"name":"model390","layers":[{"name":"input390","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input390"},"inbound_nodes":[]},{"name":"dense_Dense2335","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2335","trainable":true},"inbound_nodes":[[["input390",0,0,{}]]]},{"name":"dense_Dense2336","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2336","trainable":true},"inbound_nodes":[[["dense_Dense2335",0,0,{}]]]},{"name":"dense_Dense2337","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2337","trainable":true},"inbound_nodes":[[["dense_Dense2336",0,0,{}]]]},{"name":"dense_Dense2338","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2338","trainable":true},"inbound_nodes":[[["dense_Dense2337",0,0,{}]]]},{"name":"dense_Dense2339","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2339","trainable":true},"inbound_nodes":[[["dense_Dense2338",0,0,{}]]]},{"name":"dense_Dense2340","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2340","trainable":true},"inbound_nodes":[[["dense_Dense2339",0,0,{}]]]}],"input_layers":[["input390",0,0]],"output_layers":[["dense_Dense2340",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2335/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense2335/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2336/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense2336/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2337/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2337/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2338/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2338/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2339/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense2339/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2340/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2340/bias","shape":[1],"dtype":"float32"}]}]}