{"modelTopology":{"class_name":"Model","config":{"name":"model544","layers":[{"name":"input544","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input544"},"inbound_nodes":[]},{"name":"dense_Dense3259","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3259","trainable":true},"inbound_nodes":[[["input544",0,0,{}]]]},{"name":"dense_Dense3260","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3260","trainable":true},"inbound_nodes":[[["dense_Dense3259",0,0,{}]]]},{"name":"dense_Dense3261","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3261","trainable":true},"inbound_nodes":[[["dense_Dense3260",0,0,{}]]]},{"name":"dense_Dense3262","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3262","trainable":true},"inbound_nodes":[[["dense_Dense3261",0,0,{}]]]},{"name":"dense_Dense3263","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3263","trainable":true},"inbound_nodes":[[["dense_Dense3262",0,0,{}]]]},{"name":"dense_Dense3264","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3264","trainable":true},"inbound_nodes":[[["dense_Dense3263",0,0,{}]]]}],"input_layers":[["input544",0,0]],"output_layers":[["dense_Dense3264",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3259/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense3259/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3260/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense3260/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3261/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3261/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3262/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3262/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3263/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense3263/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3264/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3264/bias","shape":[1],"dtype":"float32"}]}]}