{"modelTopology":{"class_name":"Model","config":{"name":"model417","layers":[{"name":"input417","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input417"},"inbound_nodes":[]},{"name":"dense_Dense2081","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2081","trainable":true},"inbound_nodes":[[["input417",0,0,{}]]]},{"name":"dense_Dense2082","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2082","trainable":true},"inbound_nodes":[[["dense_Dense2081",0,0,{}]]]},{"name":"dense_Dense2083","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2083","trainable":true},"inbound_nodes":[[["dense_Dense2082",0,0,{}]]]},{"name":"dense_Dense2084","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2084","trainable":true},"inbound_nodes":[[["dense_Dense2083",0,0,{}]]]},{"name":"dense_Dense2085","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2085","trainable":true},"inbound_nodes":[[["dense_Dense2084",0,0,{}]]]}],"input_layers":[["input417",0,0]],"output_layers":[["dense_Dense2085",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2081/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2081/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2082/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2082/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2083/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense2083/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2084/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2084/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2085/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2085/bias","shape":[1],"dtype":"float32"}]}]}