{"modelTopology":{"class_name":"Model","config":{"name":"model122","layers":[{"name":"input122","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input122"},"inbound_nodes":[]},{"name":"dense_Dense606","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense606","trainable":true},"inbound_nodes":[[["input122",0,0,{}]]]},{"name":"dense_Dense607","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense607","trainable":true},"inbound_nodes":[[["dense_Dense606",0,0,{}]]]},{"name":"dense_Dense608","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense608","trainable":true},"inbound_nodes":[[["dense_Dense607",0,0,{}]]]},{"name":"dense_Dense609","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense609","trainable":true},"inbound_nodes":[[["dense_Dense608",0,0,{}]]]},{"name":"dense_Dense610","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense610","trainable":true},"inbound_nodes":[[["dense_Dense609",0,0,{}]]]}],"input_layers":[["input122",0,0]],"output_layers":[["dense_Dense610",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense606/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense606/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense607/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense607/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense608/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense608/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense609/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense609/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense610/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense610/bias","shape":[1],"dtype":"float32"}]}]}