{"modelTopology":{"class_name":"Model","config":{"name":"model279","layers":[{"name":"input279","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input279"},"inbound_nodes":[]},{"name":"dense_Dense1391","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1391","trainable":true},"inbound_nodes":[[["input279",0,0,{}]]]},{"name":"dense_Dense1392","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1392","trainable":true},"inbound_nodes":[[["dense_Dense1391",0,0,{}]]]},{"name":"dense_Dense1393","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1393","trainable":true},"inbound_nodes":[[["dense_Dense1392",0,0,{}]]]},{"name":"dense_Dense1394","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1394","trainable":true},"inbound_nodes":[[["dense_Dense1393",0,0,{}]]]},{"name":"dense_Dense1395","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1395","trainable":true},"inbound_nodes":[[["dense_Dense1394",0,0,{}]]]}],"input_layers":[["input279",0,0]],"output_layers":[["dense_Dense1395",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1391/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1391/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1392/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1392/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1393/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense1393/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1394/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense1394/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1395/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1395/bias","shape":[1],"dtype":"float32"}]}]}