{"modelTopology":{"class_name":"Model","config":{"name":"model632","layers":[{"name":"input632","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input632"},"inbound_nodes":[]},{"name":"dense_Dense3156","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3156","trainable":true},"inbound_nodes":[[["input632",0,0,{}]]]},{"name":"dense_Dense3157","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3157","trainable":true},"inbound_nodes":[[["dense_Dense3156",0,0,{}]]]},{"name":"dense_Dense3158","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3158","trainable":true},"inbound_nodes":[[["dense_Dense3157",0,0,{}]]]},{"name":"dense_Dense3159","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3159","trainable":true},"inbound_nodes":[[["dense_Dense3158",0,0,{}]]]},{"name":"dense_Dense3160","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3160","trainable":true},"inbound_nodes":[[["dense_Dense3159",0,0,{}]]]}],"input_layers":[["input632",0,0]],"output_layers":[["dense_Dense3160",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3156/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3156/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3157/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3157/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3158/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense3158/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3159/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense3159/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3160/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3160/bias","shape":[1],"dtype":"float32"}]}]}