{"modelTopology":{"class_name":"Model","config":{"name":"model1114","layers":[{"name":"input1114","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1114"},"inbound_nodes":[]},{"name":"dense_Dense5566","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5566","trainable":true},"inbound_nodes":[[["input1114",0,0,{}]]]},{"name":"dense_Dense5567","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5567","trainable":true},"inbound_nodes":[[["dense_Dense5566",0,0,{}]]]},{"name":"dense_Dense5568","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5568","trainable":true},"inbound_nodes":[[["dense_Dense5567",0,0,{}]]]},{"name":"dense_Dense5569","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5569","trainable":true},"inbound_nodes":[[["dense_Dense5568",0,0,{}]]]},{"name":"dense_Dense5570","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5570","trainable":true},"inbound_nodes":[[["dense_Dense5569",0,0,{}]]]}],"input_layers":[["input1114",0,0]],"output_layers":[["dense_Dense5570",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5566/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5566/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5567/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5567/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5568/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense5568/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5569/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense5569/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5570/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5570/bias","shape":[1],"dtype":"float32"}]}]}