{"modelTopology":{"class_name":"Model","config":{"name":"model1111","layers":[{"name":"input1111","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1111"},"inbound_nodes":[]},{"name":"dense_Dense5551","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5551","trainable":true},"inbound_nodes":[[["input1111",0,0,{}]]]},{"name":"dense_Dense5552","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5552","trainable":true},"inbound_nodes":[[["dense_Dense5551",0,0,{}]]]},{"name":"dense_Dense5553","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5553","trainable":true},"inbound_nodes":[[["dense_Dense5552",0,0,{}]]]},{"name":"dense_Dense5554","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5554","trainable":true},"inbound_nodes":[[["dense_Dense5553",0,0,{}]]]},{"name":"dense_Dense5555","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5555","trainable":true},"inbound_nodes":[[["dense_Dense5554",0,0,{}]]]}],"input_layers":[["input1111",0,0]],"output_layers":[["dense_Dense5555",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5551/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5551/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5552/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5552/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5553/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense5553/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5554/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5554/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5555/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5555/bias","shape":[1],"dtype":"float32"}]}]}