{"modelTopology":{"class_name":"Model","config":{"name":"model25","layers":[{"name":"input25","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input25"},"inbound_nodes":[]},{"name":"dense_Dense97","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense97","trainable":true},"inbound_nodes":[[["input25",0,0,{}]]]},{"name":"dense_Dense98","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense98","trainable":true},"inbound_nodes":[[["dense_Dense97",0,0,{}]]]},{"name":"dense_Dense99","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense99","trainable":true},"inbound_nodes":[[["dense_Dense98",0,0,{}]]]},{"name":"dense_Dense100","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense100","trainable":true},"inbound_nodes":[[["dense_Dense99",0,0,{}]]]}],"input_layers":[["input25",0,0]],"output_layers":[["dense_Dense100",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense97/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense97/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense98/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense98/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense99/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense99/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense100/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense100/bias","shape":[1],"dtype":"float32"}]}]}