{"modelTopology":{"class_name":"Model","config":{"name":"model460","layers":[{"name":"input460","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input460"},"inbound_nodes":[]},{"name":"dense_Dense2296","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2296","trainable":true},"inbound_nodes":[[["input460",0,0,{}]]]},{"name":"dense_Dense2297","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2297","trainable":true},"inbound_nodes":[[["dense_Dense2296",0,0,{}]]]},{"name":"dense_Dense2298","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2298","trainable":true},"inbound_nodes":[[["dense_Dense2297",0,0,{}]]]},{"name":"dense_Dense2299","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2299","trainable":true},"inbound_nodes":[[["dense_Dense2298",0,0,{}]]]},{"name":"dense_Dense2300","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2300","trainable":true},"inbound_nodes":[[["dense_Dense2299",0,0,{}]]]}],"input_layers":[["input460",0,0]],"output_layers":[["dense_Dense2300",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2296/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2296/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2297/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2297/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2298/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense2298/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2299/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense2299/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2300/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2300/bias","shape":[1],"dtype":"float32"}]}]}