{"modelTopology":{"class_name":"Model","config":{"name":"model127","layers":[{"name":"input127","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input127"},"inbound_nodes":[]},{"name":"dense_Dense505","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense505","trainable":true},"inbound_nodes":[[["input127",0,0,{}]]]},{"name":"dense_Dense506","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense506","trainable":true},"inbound_nodes":[[["dense_Dense505",0,0,{}]]]},{"name":"dense_Dense507","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense507","trainable":true},"inbound_nodes":[[["dense_Dense506",0,0,{}]]]},{"name":"dense_Dense508","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense508","trainable":true},"inbound_nodes":[[["dense_Dense507",0,0,{}]]]}],"input_layers":[["input127",0,0]],"output_layers":[["dense_Dense508",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense505/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense505/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense506/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense506/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense507/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense507/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense508/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense508/bias","shape":[1],"dtype":"float32"}]}]}