{"modelTopology":{"class_name":"Model","config":{"name":"model196","layers":[{"name":"input196","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input196"},"inbound_nodes":[]},{"name":"dense_Dense976","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense976","trainable":true},"inbound_nodes":[[["input196",0,0,{}]]]},{"name":"dense_Dense977","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense977","trainable":true},"inbound_nodes":[[["dense_Dense976",0,0,{}]]]},{"name":"dense_Dense978","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense978","trainable":true},"inbound_nodes":[[["dense_Dense977",0,0,{}]]]},{"name":"dense_Dense979","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense979","trainable":true},"inbound_nodes":[[["dense_Dense978",0,0,{}]]]},{"name":"dense_Dense980","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense980","trainable":true},"inbound_nodes":[[["dense_Dense979",0,0,{}]]]}],"input_layers":[["input196",0,0]],"output_layers":[["dense_Dense980",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense976/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense976/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense977/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense977/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense978/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense978/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense979/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense979/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense980/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense980/bias","shape":[1],"dtype":"float32"}]}]}