{"modelTopology":{"class_name":"Model","config":{"name":"model754","layers":[{"name":"input754","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input754"},"inbound_nodes":[]},{"name":"dense_Dense3766","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3766","trainable":true},"inbound_nodes":[[["input754",0,0,{}]]]},{"name":"dense_Dense3767","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3767","trainable":true},"inbound_nodes":[[["dense_Dense3766",0,0,{}]]]},{"name":"dense_Dense3768","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3768","trainable":true},"inbound_nodes":[[["dense_Dense3767",0,0,{}]]]},{"name":"dense_Dense3769","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3769","trainable":true},"inbound_nodes":[[["dense_Dense3768",0,0,{}]]]},{"name":"dense_Dense3770","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3770","trainable":true},"inbound_nodes":[[["dense_Dense3769",0,0,{}]]]}],"input_layers":[["input754",0,0]],"output_layers":[["dense_Dense3770",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3766/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3766/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3767/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3767/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3768/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3768/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3769/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense3769/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3770/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3770/bias","shape":[1],"dtype":"float32"}]}]}