{"modelTopology":{"class_name":"Model","config":{"name":"model1210","layers":[{"name":"input1210","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1210"},"inbound_nodes":[]},{"name":"dense_Dense7255","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7255","trainable":true},"inbound_nodes":[[["input1210",0,0,{}]]]},{"name":"dense_Dense7256","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7256","trainable":true},"inbound_nodes":[[["dense_Dense7255",0,0,{}]]]},{"name":"dense_Dense7257","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7257","trainable":true},"inbound_nodes":[[["dense_Dense7256",0,0,{}]]]},{"name":"dense_Dense7258","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7258","trainable":true},"inbound_nodes":[[["dense_Dense7257",0,0,{}]]]},{"name":"dense_Dense7259","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7259","trainable":true},"inbound_nodes":[[["dense_Dense7258",0,0,{}]]]},{"name":"dense_Dense7260","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7260","trainable":true},"inbound_nodes":[[["dense_Dense7259",0,0,{}]]]}],"input_layers":[["input1210",0,0]],"output_layers":[["dense_Dense7260",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7255/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense7255/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7256/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense7256/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7257/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7257/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7258/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense7258/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7259/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense7259/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7260/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7260/bias","shape":[1],"dtype":"float32"}]}]}