{"modelTopology":{"class_name":"Model","config":{"name":"model999","layers":[{"name":"input999","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input999"},"inbound_nodes":[]},{"name":"dense_Dense5989","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5989","trainable":true},"inbound_nodes":[[["input999",0,0,{}]]]},{"name":"dense_Dense5990","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5990","trainable":true},"inbound_nodes":[[["dense_Dense5989",0,0,{}]]]},{"name":"dense_Dense5991","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5991","trainable":true},"inbound_nodes":[[["dense_Dense5990",0,0,{}]]]},{"name":"dense_Dense5992","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5992","trainable":true},"inbound_nodes":[[["dense_Dense5991",0,0,{}]]]},{"name":"dense_Dense5993","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5993","trainable":true},"inbound_nodes":[[["dense_Dense5992",0,0,{}]]]},{"name":"dense_Dense5994","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5994","trainable":true},"inbound_nodes":[[["dense_Dense5993",0,0,{}]]]}],"input_layers":[["input999",0,0]],"output_layers":[["dense_Dense5994",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5989/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense5989/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5990/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense5990/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5991/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5991/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5992/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense5992/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5993/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense5993/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5994/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5994/bias","shape":[1],"dtype":"float32"}]}]}