{"modelTopology":{"class_name":"Model","config":{"name":"model571","layers":[{"name":"input571","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input571"},"inbound_nodes":[]},{"name":"dense_Dense3421","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3421","trainable":true},"inbound_nodes":[[["input571",0,0,{}]]]},{"name":"dense_Dense3422","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3422","trainable":true},"inbound_nodes":[[["dense_Dense3421",0,0,{}]]]},{"name":"dense_Dense3423","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3423","trainable":true},"inbound_nodes":[[["dense_Dense3422",0,0,{}]]]},{"name":"dense_Dense3424","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3424","trainable":true},"inbound_nodes":[[["dense_Dense3423",0,0,{}]]]},{"name":"dense_Dense3425","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3425","trainable":true},"inbound_nodes":[[["dense_Dense3424",0,0,{}]]]},{"name":"dense_Dense3426","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3426","trainable":true},"inbound_nodes":[[["dense_Dense3425",0,0,{}]]]}],"input_layers":[["input571",0,0]],"output_layers":[["dense_Dense3426",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3421/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense3421/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3422/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense3422/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3423/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3423/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3424/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense3424/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3425/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3425/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3426/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense3426/bias","shape":[1],"dtype":"float32"}]}]}