{"modelTopology":{"class_name":"Model","config":{"name":"model1180","layers":[{"name":"input1180","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1180"},"inbound_nodes":[]},{"name":"dense_Dense7075","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7075","trainable":true},"inbound_nodes":[[["input1180",0,0,{}]]]},{"name":"dense_Dense7076","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7076","trainable":true},"inbound_nodes":[[["dense_Dense7075",0,0,{}]]]},{"name":"dense_Dense7077","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7077","trainable":true},"inbound_nodes":[[["dense_Dense7076",0,0,{}]]]},{"name":"dense_Dense7078","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7078","trainable":true},"inbound_nodes":[[["dense_Dense7077",0,0,{}]]]},{"name":"dense_Dense7079","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7079","trainable":true},"inbound_nodes":[[["dense_Dense7078",0,0,{}]]]},{"name":"dense_Dense7080","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7080","trainable":true},"inbound_nodes":[[["dense_Dense7079",0,0,{}]]]}],"input_layers":[["input1180",0,0]],"output_layers":[["dense_Dense7080",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7075/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense7075/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7076/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense7076/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7077/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense7077/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7078/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense7078/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7079/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense7079/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7080/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7080/bias","shape":[1],"dtype":"float32"}]}]}