{"modelTopology":{"class_name":"Model","config":{"name":"model593","layers":[{"name":"input593","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input593"},"inbound_nodes":[]},{"name":"dense_Dense2961","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2961","trainable":true},"inbound_nodes":[[["input593",0,0,{}]]]},{"name":"dense_Dense2962","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2962","trainable":true},"inbound_nodes":[[["dense_Dense2961",0,0,{}]]]},{"name":"dense_Dense2963","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2963","trainable":true},"inbound_nodes":[[["dense_Dense2962",0,0,{}]]]},{"name":"dense_Dense2964","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2964","trainable":true},"inbound_nodes":[[["dense_Dense2963",0,0,{}]]]},{"name":"dense_Dense2965","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2965","trainable":true},"inbound_nodes":[[["dense_Dense2964",0,0,{}]]]}],"input_layers":[["input593",0,0]],"output_layers":[["dense_Dense2965",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2961/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2961/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2962/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2962/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2963/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2963/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2964/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2964/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2965/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2965/bias","shape":[1],"dtype":"float32"}]}]}