{"modelTopology":{"class_name":"Model","config":{"name":"model633","layers":[{"name":"input633","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input633"},"inbound_nodes":[]},{"name":"dense_Dense3793","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3793","trainable":true},"inbound_nodes":[[["input633",0,0,{}]]]},{"name":"dense_Dense3794","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3794","trainable":true},"inbound_nodes":[[["dense_Dense3793",0,0,{}]]]},{"name":"dense_Dense3795","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3795","trainable":true},"inbound_nodes":[[["dense_Dense3794",0,0,{}]]]},{"name":"dense_Dense3796","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3796","trainable":true},"inbound_nodes":[[["dense_Dense3795",0,0,{}]]]},{"name":"dense_Dense3797","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3797","trainable":true},"inbound_nodes":[[["dense_Dense3796",0,0,{}]]]},{"name":"dense_Dense3798","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3798","trainable":true},"inbound_nodes":[[["dense_Dense3797",0,0,{}]]]}],"input_layers":[["input633",0,0]],"output_layers":[["dense_Dense3798",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3793/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense3793/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3794/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3794/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3795/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3795/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3796/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense3796/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3797/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3797/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3798/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3798/bias","shape":[1],"dtype":"float32"}]}]}