{"modelTopology":{"class_name":"Model","config":{"name":"model893","layers":[{"name":"input893","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input893"},"inbound_nodes":[]},{"name":"dense_Dense4461","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4461","trainable":true},"inbound_nodes":[[["input893",0,0,{}]]]},{"name":"dense_Dense4462","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4462","trainable":true},"inbound_nodes":[[["dense_Dense4461",0,0,{}]]]},{"name":"dense_Dense4463","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4463","trainable":true},"inbound_nodes":[[["dense_Dense4462",0,0,{}]]]},{"name":"dense_Dense4464","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4464","trainable":true},"inbound_nodes":[[["dense_Dense4463",0,0,{}]]]},{"name":"dense_Dense4465","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4465","trainable":true},"inbound_nodes":[[["dense_Dense4464",0,0,{}]]]}],"input_layers":[["input893",0,0]],"output_layers":[["dense_Dense4465",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4461/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4461/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4462/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4462/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4463/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense4463/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4464/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense4464/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4465/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4465/bias","shape":[1],"dtype":"float32"}]}]}