{"modelTopology":{"class_name":"Model","config":{"name":"model310","layers":[{"name":"input310","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input310"},"inbound_nodes":[]},{"name":"dense_Dense1855","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1855","trainable":true},"inbound_nodes":[[["input310",0,0,{}]]]},{"name":"dense_Dense1856","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1856","trainable":true},"inbound_nodes":[[["dense_Dense1855",0,0,{}]]]},{"name":"dense_Dense1857","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1857","trainable":true},"inbound_nodes":[[["dense_Dense1856",0,0,{}]]]},{"name":"dense_Dense1858","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1858","trainable":true},"inbound_nodes":[[["dense_Dense1857",0,0,{}]]]},{"name":"dense_Dense1859","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1859","trainable":true},"inbound_nodes":[[["dense_Dense1858",0,0,{}]]]},{"name":"dense_Dense1860","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1860","trainable":true},"inbound_nodes":[[["dense_Dense1859",0,0,{}]]]}],"input_layers":[["input310",0,0]],"output_layers":[["dense_Dense1860",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1855/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense1855/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1856/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense1856/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1857/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1857/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1858/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1858/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1859/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense1859/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1860/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1860/bias","shape":[1],"dtype":"float32"}]}]}