{"modelTopology":{"class_name":"Model","config":{"name":"model530","layers":[{"name":"input530","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input530"},"inbound_nodes":[]},{"name":"dense_Dense3175","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3175","trainable":true},"inbound_nodes":[[["input530",0,0,{}]]]},{"name":"dense_Dense3176","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3176","trainable":true},"inbound_nodes":[[["dense_Dense3175",0,0,{}]]]},{"name":"dense_Dense3177","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3177","trainable":true},"inbound_nodes":[[["dense_Dense3176",0,0,{}]]]},{"name":"dense_Dense3178","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3178","trainable":true},"inbound_nodes":[[["dense_Dense3177",0,0,{}]]]},{"name":"dense_Dense3179","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3179","trainable":true},"inbound_nodes":[[["dense_Dense3178",0,0,{}]]]},{"name":"dense_Dense3180","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3180","trainable":true},"inbound_nodes":[[["dense_Dense3179",0,0,{}]]]}],"input_layers":[["input530",0,0]],"output_layers":[["dense_Dense3180",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3175/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense3175/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3176/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense3176/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3177/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3177/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3178/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3178/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3179/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense3179/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3180/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3180/bias","shape":[1],"dtype":"float32"}]}]}