{"modelTopology":{"class_name":"Model","config":{"name":"model663","layers":[{"name":"input663","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input663"},"inbound_nodes":[]},{"name":"dense_Dense3311","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3311","trainable":true},"inbound_nodes":[[["input663",0,0,{}]]]},{"name":"dense_Dense3312","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3312","trainable":true},"inbound_nodes":[[["dense_Dense3311",0,0,{}]]]},{"name":"dense_Dense3313","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3313","trainable":true},"inbound_nodes":[[["dense_Dense3312",0,0,{}]]]},{"name":"dense_Dense3314","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3314","trainable":true},"inbound_nodes":[[["dense_Dense3313",0,0,{}]]]},{"name":"dense_Dense3315","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3315","trainable":true},"inbound_nodes":[[["dense_Dense3314",0,0,{}]]]}],"input_layers":[["input663",0,0]],"output_layers":[["dense_Dense3315",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3311/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3311/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3312/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3312/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3313/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3313/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3314/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3314/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3315/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3315/bias","shape":[1],"dtype":"float32"}]}]}