{"modelTopology":{"class_name":"Model","config":{"name":"model370","layers":[{"name":"input370","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input370"},"inbound_nodes":[]},{"name":"dense_Dense2215","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2215","trainable":true},"inbound_nodes":[[["input370",0,0,{}]]]},{"name":"dense_Dense2216","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2216","trainable":true},"inbound_nodes":[[["dense_Dense2215",0,0,{}]]]},{"name":"dense_Dense2217","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2217","trainable":true},"inbound_nodes":[[["dense_Dense2216",0,0,{}]]]},{"name":"dense_Dense2218","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2218","trainable":true},"inbound_nodes":[[["dense_Dense2217",0,0,{}]]]},{"name":"dense_Dense2219","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2219","trainable":true},"inbound_nodes":[[["dense_Dense2218",0,0,{}]]]},{"name":"dense_Dense2220","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2220","trainable":true},"inbound_nodes":[[["dense_Dense2219",0,0,{}]]]}],"input_layers":[["input370",0,0]],"output_layers":[["dense_Dense2220",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2215/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2215/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2216/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2216/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2217/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2217/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2218/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense2218/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2219/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2219/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2220/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2220/bias","shape":[1],"dtype":"float32"}]}]}