{"modelTopology":{"class_name":"Model","config":{"name":"model520","layers":[{"name":"input520","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input520"},"inbound_nodes":[]},{"name":"dense_Dense2596","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2596","trainable":true},"inbound_nodes":[[["input520",0,0,{}]]]},{"name":"dense_Dense2597","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2597","trainable":true},"inbound_nodes":[[["dense_Dense2596",0,0,{}]]]},{"name":"dense_Dense2598","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2598","trainable":true},"inbound_nodes":[[["dense_Dense2597",0,0,{}]]]},{"name":"dense_Dense2599","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2599","trainable":true},"inbound_nodes":[[["dense_Dense2598",0,0,{}]]]},{"name":"dense_Dense2600","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2600","trainable":true},"inbound_nodes":[[["dense_Dense2599",0,0,{}]]]}],"input_layers":[["input520",0,0]],"output_layers":[["dense_Dense2600",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2596/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2596/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2597/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2597/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2598/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2598/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2599/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense2599/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2600/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2600/bias","shape":[1],"dtype":"float32"}]}]}