{"modelTopology":{"class_name":"Model","config":{"name":"model483","layers":[{"name":"input483","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input483"},"inbound_nodes":[]},{"name":"dense_Dense2893","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2893","trainable":true},"inbound_nodes":[[["input483",0,0,{}]]]},{"name":"dense_Dense2894","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2894","trainable":true},"inbound_nodes":[[["dense_Dense2893",0,0,{}]]]},{"name":"dense_Dense2895","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2895","trainable":true},"inbound_nodes":[[["dense_Dense2894",0,0,{}]]]},{"name":"dense_Dense2896","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2896","trainable":true},"inbound_nodes":[[["dense_Dense2895",0,0,{}]]]},{"name":"dense_Dense2897","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2897","trainable":true},"inbound_nodes":[[["dense_Dense2896",0,0,{}]]]},{"name":"dense_Dense2898","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2898","trainable":true},"inbound_nodes":[[["dense_Dense2897",0,0,{}]]]}],"input_layers":[["input483",0,0]],"output_layers":[["dense_Dense2898",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2893/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2893/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2894/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2894/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2895/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2895/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2896/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense2896/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2897/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2897/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2898/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2898/bias","shape":[1],"dtype":"float32"}]}]}