{"modelTopology":{"class_name":"Model","config":{"name":"model609","layers":[{"name":"input609","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input609"},"inbound_nodes":[]},{"name":"dense_Dense3649","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3649","trainable":true},"inbound_nodes":[[["input609",0,0,{}]]]},{"name":"dense_Dense3650","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3650","trainable":true},"inbound_nodes":[[["dense_Dense3649",0,0,{}]]]},{"name":"dense_Dense3651","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3651","trainable":true},"inbound_nodes":[[["dense_Dense3650",0,0,{}]]]},{"name":"dense_Dense3652","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3652","trainable":true},"inbound_nodes":[[["dense_Dense3651",0,0,{}]]]},{"name":"dense_Dense3653","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3653","trainable":true},"inbound_nodes":[[["dense_Dense3652",0,0,{}]]]},{"name":"dense_Dense3654","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3654","trainable":true},"inbound_nodes":[[["dense_Dense3653",0,0,{}]]]}],"input_layers":[["input609",0,0]],"output_layers":[["dense_Dense3654",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3649/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3649/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3650/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3650/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3651/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3651/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3652/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense3652/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3653/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3653/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3654/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3654/bias","shape":[1],"dtype":"float32"}]}]}