{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"dense_Dense31","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"dense_Dense32","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true},"inbound_nodes":[[["dense_Dense31",0,0,{}]]]},{"name":"dense_Dense33","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true},"inbound_nodes":[[["dense_Dense32",0,0,{}]]]},{"name":"dense_Dense34","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true},"inbound_nodes":[[["dense_Dense33",0,0,{}]]]},{"name":"dense_Dense35","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true},"inbound_nodes":[[["dense_Dense34",0,0,{}]]]},{"name":"dense_Dense36","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true},"inbound_nodes":[[["dense_Dense35",0,0,{}]]]}],"input_layers":[["input6",0,0]],"output_layers":[["dense_Dense36",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense31/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense31/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense32/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense32/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense33/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense35/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense36/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense36/bias","shape":[1],"dtype":"float32"}]}]}