{"modelTopology":{"class_name":"Model","config":{"name":"model593","layers":[{"name":"input593","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input593"},"inbound_nodes":[]},{"name":"dense_Dense3553","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3553","trainable":true},"inbound_nodes":[[["input593",0,0,{}]]]},{"name":"dense_Dense3554","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3554","trainable":true},"inbound_nodes":[[["dense_Dense3553",0,0,{}]]]},{"name":"dense_Dense3555","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3555","trainable":true},"inbound_nodes":[[["dense_Dense3554",0,0,{}]]]},{"name":"dense_Dense3556","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3556","trainable":true},"inbound_nodes":[[["dense_Dense3555",0,0,{}]]]},{"name":"dense_Dense3557","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3557","trainable":true},"inbound_nodes":[[["dense_Dense3556",0,0,{}]]]},{"name":"dense_Dense3558","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3558","trainable":true},"inbound_nodes":[[["dense_Dense3557",0,0,{}]]]}],"input_layers":[["input593",0,0]],"output_layers":[["dense_Dense3558",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3553/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3553/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3554/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3554/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3555/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3555/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3556/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense3556/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3557/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3557/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3558/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3558/bias","shape":[1],"dtype":"float32"}]}]}