{"modelTopology":{"class_name":"Model","config":{"name":"model361","layers":[{"name":"input361","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input361"},"inbound_nodes":[]},{"name":"dense_Dense2161","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2161","trainable":true},"inbound_nodes":[[["input361",0,0,{}]]]},{"name":"dense_Dense2162","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2162","trainable":true},"inbound_nodes":[[["dense_Dense2161",0,0,{}]]]},{"name":"dense_Dense2163","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2163","trainable":true},"inbound_nodes":[[["dense_Dense2162",0,0,{}]]]},{"name":"dense_Dense2164","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2164","trainable":true},"inbound_nodes":[[["dense_Dense2163",0,0,{}]]]},{"name":"dense_Dense2165","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2165","trainable":true},"inbound_nodes":[[["dense_Dense2164",0,0,{}]]]},{"name":"dense_Dense2166","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2166","trainable":true},"inbound_nodes":[[["dense_Dense2165",0,0,{}]]]}],"input_layers":[["input361",0,0]],"output_layers":[["dense_Dense2166",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2161/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2161/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2162/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2162/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2163/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2163/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2164/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2164/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2165/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2165/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2166/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2166/bias","shape":[1],"dtype":"float32"}]}]}