{"modelTopology":{"class_name":"Model","config":{"name":"model357","layers":[{"name":"input357","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input357"},"inbound_nodes":[]},{"name":"dense_Dense2137","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2137","trainable":true},"inbound_nodes":[[["input357",0,0,{}]]]},{"name":"dense_Dense2138","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2138","trainable":true},"inbound_nodes":[[["dense_Dense2137",0,0,{}]]]},{"name":"dense_Dense2139","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2139","trainable":true},"inbound_nodes":[[["dense_Dense2138",0,0,{}]]]},{"name":"dense_Dense2140","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2140","trainable":true},"inbound_nodes":[[["dense_Dense2139",0,0,{}]]]},{"name":"dense_Dense2141","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2141","trainable":true},"inbound_nodes":[[["dense_Dense2140",0,0,{}]]]},{"name":"dense_Dense2142","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2142","trainable":true},"inbound_nodes":[[["dense_Dense2141",0,0,{}]]]}],"input_layers":[["input357",0,0]],"output_layers":[["dense_Dense2142",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2137/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2137/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2138/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2138/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2139/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2139/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2140/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense2140/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2141/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense2141/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2142/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2142/bias","shape":[1],"dtype":"float32"}]}]}