{"modelTopology":{"class_name":"Model","config":{"name":"model161","layers":[{"name":"input161","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input161"},"inbound_nodes":[]},{"name":"dense_Dense961","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense961","trainable":true},"inbound_nodes":[[["input161",0,0,{}]]]},{"name":"dense_Dense962","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense962","trainable":true},"inbound_nodes":[[["dense_Dense961",0,0,{}]]]},{"name":"dense_Dense963","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense963","trainable":true},"inbound_nodes":[[["dense_Dense962",0,0,{}]]]},{"name":"dense_Dense964","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense964","trainable":true},"inbound_nodes":[[["dense_Dense963",0,0,{}]]]},{"name":"dense_Dense965","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense965","trainable":true},"inbound_nodes":[[["dense_Dense964",0,0,{}]]]},{"name":"dense_Dense966","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense966","trainable":true},"inbound_nodes":[[["dense_Dense965",0,0,{}]]]}],"input_layers":[["input161",0,0]],"output_layers":[["dense_Dense966",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense961/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense961/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense962/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense962/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense963/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense963/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense964/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense964/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense965/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense965/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense966/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense966/bias","shape":[1],"dtype":"float32"}]}]}