{"modelTopology":{"class_name":"Model","config":{"name":"model312","layers":[{"name":"input312","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input312"},"inbound_nodes":[]},{"name":"dense_Dense1556","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1556","trainable":true},"inbound_nodes":[[["input312",0,0,{}]]]},{"name":"dense_Dense1557","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1557","trainable":true},"inbound_nodes":[[["dense_Dense1556",0,0,{}]]]},{"name":"dense_Dense1558","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1558","trainable":true},"inbound_nodes":[[["dense_Dense1557",0,0,{}]]]},{"name":"dense_Dense1559","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1559","trainable":true},"inbound_nodes":[[["dense_Dense1558",0,0,{}]]]},{"name":"dense_Dense1560","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1560","trainable":true},"inbound_nodes":[[["dense_Dense1559",0,0,{}]]]}],"input_layers":[["input312",0,0]],"output_layers":[["dense_Dense1560",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1556/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1556/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1557/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1557/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1558/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1558/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1559/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense1559/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1560/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1560/bias","shape":[1],"dtype":"float32"}]}]}