{"modelTopology":{"class_name":"Model","config":{"name":"model247","layers":[{"name":"input247","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input247"},"inbound_nodes":[]},{"name":"dense_Dense1477","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1477","trainable":true},"inbound_nodes":[[["input247",0,0,{}]]]},{"name":"dense_Dense1478","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1478","trainable":true},"inbound_nodes":[[["dense_Dense1477",0,0,{}]]]},{"name":"dense_Dense1479","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1479","trainable":true},"inbound_nodes":[[["dense_Dense1478",0,0,{}]]]},{"name":"dense_Dense1480","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1480","trainable":true},"inbound_nodes":[[["dense_Dense1479",0,0,{}]]]},{"name":"dense_Dense1481","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1481","trainable":true},"inbound_nodes":[[["dense_Dense1480",0,0,{}]]]},{"name":"dense_Dense1482","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1482","trainable":true},"inbound_nodes":[[["dense_Dense1481",0,0,{}]]]}],"input_layers":[["input247",0,0]],"output_layers":[["dense_Dense1482",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1477/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense1477/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1478/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1478/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1479/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1479/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1480/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense1480/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1481/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1481/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1482/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense1482/bias","shape":[1],"dtype":"float32"}]}]}