{"modelTopology":{"class_name":"Model","config":{"name":"model1207","layers":[{"name":"input1207","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1207"},"inbound_nodes":[]},{"name":"dense_Dense7237","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7237","trainable":true},"inbound_nodes":[[["input1207",0,0,{}]]]},{"name":"dense_Dense7238","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7238","trainable":true},"inbound_nodes":[[["dense_Dense7237",0,0,{}]]]},{"name":"dense_Dense7239","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7239","trainable":true},"inbound_nodes":[[["dense_Dense7238",0,0,{}]]]},{"name":"dense_Dense7240","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7240","trainable":true},"inbound_nodes":[[["dense_Dense7239",0,0,{}]]]},{"name":"dense_Dense7241","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7241","trainable":true},"inbound_nodes":[[["dense_Dense7240",0,0,{}]]]},{"name":"dense_Dense7242","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7242","trainable":true},"inbound_nodes":[[["dense_Dense7241",0,0,{}]]]}],"input_layers":[["input1207",0,0]],"output_layers":[["dense_Dense7242",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7237/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense7237/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7238/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7238/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7239/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7239/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7240/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense7240/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7241/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7241/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7242/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense7242/bias","shape":[1],"dtype":"float32"}]}]}