{"modelTopology":{"class_name":"Model","config":{"name":"model150","layers":[{"name":"input150","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input150"},"inbound_nodes":[]},{"name":"dense_Dense895","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense895","trainable":true},"inbound_nodes":[[["input150",0,0,{}]]]},{"name":"dense_Dense896","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense896","trainable":true},"inbound_nodes":[[["dense_Dense895",0,0,{}]]]},{"name":"dense_Dense897","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense897","trainable":true},"inbound_nodes":[[["dense_Dense896",0,0,{}]]]},{"name":"dense_Dense898","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense898","trainable":true},"inbound_nodes":[[["dense_Dense897",0,0,{}]]]},{"name":"dense_Dense899","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense899","trainable":true},"inbound_nodes":[[["dense_Dense898",0,0,{}]]]},{"name":"dense_Dense900","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense900","trainable":true},"inbound_nodes":[[["dense_Dense899",0,0,{}]]]}],"input_layers":[["input150",0,0]],"output_layers":[["dense_Dense900",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense895/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense895/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense896/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense896/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense897/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense897/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense898/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense898/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense899/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense899/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense900/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense900/bias","shape":[1],"dtype":"float32"}]}]}