{"modelTopology":{"class_name":"Model","config":{"name":"model1147","layers":[{"name":"input1147","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1147"},"inbound_nodes":[]},{"name":"dense_Dense6877","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6877","trainable":true},"inbound_nodes":[[["input1147",0,0,{}]]]},{"name":"dense_Dense6878","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6878","trainable":true},"inbound_nodes":[[["dense_Dense6877",0,0,{}]]]},{"name":"dense_Dense6879","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6879","trainable":true},"inbound_nodes":[[["dense_Dense6878",0,0,{}]]]},{"name":"dense_Dense6880","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6880","trainable":true},"inbound_nodes":[[["dense_Dense6879",0,0,{}]]]},{"name":"dense_Dense6881","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6881","trainable":true},"inbound_nodes":[[["dense_Dense6880",0,0,{}]]]},{"name":"dense_Dense6882","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6882","trainable":true},"inbound_nodes":[[["dense_Dense6881",0,0,{}]]]}],"input_layers":[["input1147",0,0]],"output_layers":[["dense_Dense6882",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6877/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense6877/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6878/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense6878/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6879/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense6879/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6880/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense6880/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6881/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6881/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6882/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense6882/bias","shape":[1],"dtype":"float32"}]}]}