{"modelTopology":{"class_name":"Model","config":{"name":"model170","layers":[{"name":"input170","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input170"},"inbound_nodes":[]},{"name":"dense_Dense846","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense846","trainable":true},"inbound_nodes":[[["input170",0,0,{}]]]},{"name":"dense_Dense847","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense847","trainable":true},"inbound_nodes":[[["dense_Dense846",0,0,{}]]]},{"name":"dense_Dense848","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense848","trainable":true},"inbound_nodes":[[["dense_Dense847",0,0,{}]]]},{"name":"dense_Dense849","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense849","trainable":true},"inbound_nodes":[[["dense_Dense848",0,0,{}]]]},{"name":"dense_Dense850","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense850","trainable":true},"inbound_nodes":[[["dense_Dense849",0,0,{}]]]}],"input_layers":[["input170",0,0]],"output_layers":[["dense_Dense850",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense846/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense846/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense847/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense847/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense848/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense848/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense849/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense849/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense850/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense850/bias","shape":[1],"dtype":"float32"}]}]}