{"modelTopology":{"class_name":"Model","config":{"name":"model578","layers":[{"name":"input578","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input578"},"inbound_nodes":[]},{"name":"dense_Dense3463","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3463","trainable":true},"inbound_nodes":[[["input578",0,0,{}]]]},{"name":"dense_Dense3464","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3464","trainable":true},"inbound_nodes":[[["dense_Dense3463",0,0,{}]]]},{"name":"dense_Dense3465","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3465","trainable":true},"inbound_nodes":[[["dense_Dense3464",0,0,{}]]]},{"name":"dense_Dense3466","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3466","trainable":true},"inbound_nodes":[[["dense_Dense3465",0,0,{}]]]},{"name":"dense_Dense3467","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3467","trainable":true},"inbound_nodes":[[["dense_Dense3466",0,0,{}]]]},{"name":"dense_Dense3468","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3468","trainable":true},"inbound_nodes":[[["dense_Dense3467",0,0,{}]]]}],"input_layers":[["input578",0,0]],"output_layers":[["dense_Dense3468",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3463/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense3463/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3464/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3464/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3465/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense3465/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3466/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3466/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3467/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense3467/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3468/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense3468/bias","shape":[1],"dtype":"float32"}]}]}