{"modelTopology":{"class_name":"Model","config":{"name":"model450","layers":[{"name":"input450","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input450"},"inbound_nodes":[]},{"name":"dense_Dense2695","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2695","trainable":true},"inbound_nodes":[[["input450",0,0,{}]]]},{"name":"dense_Dense2696","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2696","trainable":true},"inbound_nodes":[[["dense_Dense2695",0,0,{}]]]},{"name":"dense_Dense2697","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2697","trainable":true},"inbound_nodes":[[["dense_Dense2696",0,0,{}]]]},{"name":"dense_Dense2698","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2698","trainable":true},"inbound_nodes":[[["dense_Dense2697",0,0,{}]]]},{"name":"dense_Dense2699","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2699","trainable":true},"inbound_nodes":[[["dense_Dense2698",0,0,{}]]]},{"name":"dense_Dense2700","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2700","trainable":true},"inbound_nodes":[[["dense_Dense2699",0,0,{}]]]}],"input_layers":[["input450",0,0]],"output_layers":[["dense_Dense2700",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2695/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2695/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2696/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense2696/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2697/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2697/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2698/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense2698/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2699/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense2699/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2700/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2700/bias","shape":[1],"dtype":"float32"}]}]}