{"modelTopology":{"class_name":"Model","config":{"name":"model29","layers":[{"name":"input29","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input29"},"inbound_nodes":[]},{"name":"dense_Dense113","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense113","trainable":true},"inbound_nodes":[[["input29",0,0,{}]]]},{"name":"dense_Dense114","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense114","trainable":true},"inbound_nodes":[[["dense_Dense113",0,0,{}]]]},{"name":"dense_Dense115","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense115","trainable":true},"inbound_nodes":[[["dense_Dense114",0,0,{}]]]},{"name":"dense_Dense116","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense116","trainable":true},"inbound_nodes":[[["dense_Dense115",0,0,{}]]]}],"input_layers":[["input29",0,0]],"output_layers":[["dense_Dense116",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense113/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense113/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense114/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense114/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense115/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense115/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense116/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense116/bias","shape":[1],"dtype":"float32"}]}]}