{"modelTopology":{"class_name":"Model","config":{"name":"model517","layers":[{"name":"input517","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input517"},"inbound_nodes":[]},{"name":"dense_Dense2581","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2581","trainable":true},"inbound_nodes":[[["input517",0,0,{}]]]},{"name":"dense_Dense2582","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2582","trainable":true},"inbound_nodes":[[["dense_Dense2581",0,0,{}]]]},{"name":"dense_Dense2583","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2583","trainable":true},"inbound_nodes":[[["dense_Dense2582",0,0,{}]]]},{"name":"dense_Dense2584","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2584","trainable":true},"inbound_nodes":[[["dense_Dense2583",0,0,{}]]]},{"name":"dense_Dense2585","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2585","trainable":true},"inbound_nodes":[[["dense_Dense2584",0,0,{}]]]}],"input_layers":[["input517",0,0]],"output_layers":[["dense_Dense2585",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2581/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2581/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2582/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2582/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2583/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2583/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2584/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2584/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2585/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2585/bias","shape":[1],"dtype":"float32"}]}]}