{"modelTopology":{"class_name":"Model","config":{"name":"model986","layers":[{"name":"input986","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input986"},"inbound_nodes":[]},{"name":"dense_Dense5911","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5911","trainable":true},"inbound_nodes":[[["input986",0,0,{}]]]},{"name":"dense_Dense5912","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5912","trainable":true},"inbound_nodes":[[["dense_Dense5911",0,0,{}]]]},{"name":"dense_Dense5913","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5913","trainable":true},"inbound_nodes":[[["dense_Dense5912",0,0,{}]]]},{"name":"dense_Dense5914","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5914","trainable":true},"inbound_nodes":[[["dense_Dense5913",0,0,{}]]]},{"name":"dense_Dense5915","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5915","trainable":true},"inbound_nodes":[[["dense_Dense5914",0,0,{}]]]},{"name":"dense_Dense5916","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5916","trainable":true},"inbound_nodes":[[["dense_Dense5915",0,0,{}]]]}],"input_layers":[["input986",0,0]],"output_layers":[["dense_Dense5916",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5911/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense5911/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5912/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense5912/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5913/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5913/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5914/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense5914/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5915/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense5915/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5916/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense5916/bias","shape":[1],"dtype":"float32"}]}]}