{"modelTopology":{"class_name":"Model","config":{"name":"model107","layers":[{"name":"input107","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input107"},"inbound_nodes":[]},{"name":"dense_Dense637","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense637","trainable":true},"inbound_nodes":[[["input107",0,0,{}]]]},{"name":"dense_Dense638","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense638","trainable":true},"inbound_nodes":[[["dense_Dense637",0,0,{}]]]},{"name":"dense_Dense639","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense639","trainable":true},"inbound_nodes":[[["dense_Dense638",0,0,{}]]]},{"name":"dense_Dense640","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense640","trainable":true},"inbound_nodes":[[["dense_Dense639",0,0,{}]]]},{"name":"dense_Dense641","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense641","trainable":true},"inbound_nodes":[[["dense_Dense640",0,0,{}]]]},{"name":"dense_Dense642","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense642","trainable":true},"inbound_nodes":[[["dense_Dense641",0,0,{}]]]}],"input_layers":[["input107",0,0]],"output_layers":[["dense_Dense642",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense637/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense637/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense638/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense638/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense639/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense639/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense640/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense640/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense641/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense641/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense642/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense642/bias","shape":[1],"dtype":"float32"}]}]}