{"modelTopology":{"class_name":"Model","config":{"name":"model423","layers":[{"name":"input423","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input423"},"inbound_nodes":[]},{"name":"dense_Dense2533","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2533","trainable":true},"inbound_nodes":[[["input423",0,0,{}]]]},{"name":"dense_Dense2534","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2534","trainable":true},"inbound_nodes":[[["dense_Dense2533",0,0,{}]]]},{"name":"dense_Dense2535","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2535","trainable":true},"inbound_nodes":[[["dense_Dense2534",0,0,{}]]]},{"name":"dense_Dense2536","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2536","trainable":true},"inbound_nodes":[[["dense_Dense2535",0,0,{}]]]},{"name":"dense_Dense2537","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2537","trainable":true},"inbound_nodes":[[["dense_Dense2536",0,0,{}]]]},{"name":"dense_Dense2538","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2538","trainable":true},"inbound_nodes":[[["dense_Dense2537",0,0,{}]]]}],"input_layers":[["input423",0,0]],"output_layers":[["dense_Dense2538",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2533/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2533/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2534/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense2534/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2535/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2535/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2536/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense2536/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2537/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2537/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2538/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2538/bias","shape":[1],"dtype":"float32"}]}]}