{"modelTopology":{"class_name":"Model","config":{"name":"model241","layers":[{"name":"input241","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input241"},"inbound_nodes":[]},{"name":"dense_Dense1441","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1441","trainable":true},"inbound_nodes":[[["input241",0,0,{}]]]},{"name":"dense_Dense1442","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1442","trainable":true},"inbound_nodes":[[["dense_Dense1441",0,0,{}]]]},{"name":"dense_Dense1443","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1443","trainable":true},"inbound_nodes":[[["dense_Dense1442",0,0,{}]]]},{"name":"dense_Dense1444","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1444","trainable":true},"inbound_nodes":[[["dense_Dense1443",0,0,{}]]]},{"name":"dense_Dense1445","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1445","trainable":true},"inbound_nodes":[[["dense_Dense1444",0,0,{}]]]},{"name":"dense_Dense1446","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1446","trainable":true},"inbound_nodes":[[["dense_Dense1445",0,0,{}]]]}],"input_layers":[["input241",0,0]],"output_layers":[["dense_Dense1446",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1441/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense1441/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1442/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense1442/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1443/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1443/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1444/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1444/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1445/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense1445/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1446/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense1446/bias","shape":[1],"dtype":"float32"}]}]}