{"modelTopology":{"class_name":"Model","config":{"name":"model922","layers":[{"name":"input922","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input922"},"inbound_nodes":[]},{"name":"dense_Dense4606","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4606","trainable":true},"inbound_nodes":[[["input922",0,0,{}]]]},{"name":"dense_Dense4607","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4607","trainable":true},"inbound_nodes":[[["dense_Dense4606",0,0,{}]]]},{"name":"dense_Dense4608","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4608","trainable":true},"inbound_nodes":[[["dense_Dense4607",0,0,{}]]]},{"name":"dense_Dense4609","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4609","trainable":true},"inbound_nodes":[[["dense_Dense4608",0,0,{}]]]},{"name":"dense_Dense4610","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4610","trainable":true},"inbound_nodes":[[["dense_Dense4609",0,0,{}]]]}],"input_layers":[["input922",0,0]],"output_layers":[["dense_Dense4610",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4606/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4606/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4607/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4607/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4608/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense4608/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4609/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4609/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4610/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4610/bias","shape":[1],"dtype":"float32"}]}]}