{"modelTopology":{"class_name":"Model","config":{"name":"model875","layers":[{"name":"input875","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input875"},"inbound_nodes":[]},{"name":"dense_Dense4371","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4371","trainable":true},"inbound_nodes":[[["input875",0,0,{}]]]},{"name":"dense_Dense4372","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4372","trainable":true},"inbound_nodes":[[["dense_Dense4371",0,0,{}]]]},{"name":"dense_Dense4373","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4373","trainable":true},"inbound_nodes":[[["dense_Dense4372",0,0,{}]]]},{"name":"dense_Dense4374","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4374","trainable":true},"inbound_nodes":[[["dense_Dense4373",0,0,{}]]]},{"name":"dense_Dense4375","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4375","trainable":true},"inbound_nodes":[[["dense_Dense4374",0,0,{}]]]}],"input_layers":[["input875",0,0]],"output_layers":[["dense_Dense4375",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4371/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4371/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4372/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4372/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4373/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense4373/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4374/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense4374/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4375/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4375/bias","shape":[1],"dtype":"float32"}]}]}