{"modelTopology":{"class_name":"Model","config":{"name":"model902","layers":[{"name":"input902","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input902"},"inbound_nodes":[]},{"name":"dense_Dense4506","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4506","trainable":true},"inbound_nodes":[[["input902",0,0,{}]]]},{"name":"dense_Dense4507","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4507","trainable":true},"inbound_nodes":[[["dense_Dense4506",0,0,{}]]]},{"name":"dense_Dense4508","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4508","trainable":true},"inbound_nodes":[[["dense_Dense4507",0,0,{}]]]},{"name":"dense_Dense4509","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4509","trainable":true},"inbound_nodes":[[["dense_Dense4508",0,0,{}]]]},{"name":"dense_Dense4510","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4510","trainable":true},"inbound_nodes":[[["dense_Dense4509",0,0,{}]]]}],"input_layers":[["input902",0,0]],"output_layers":[["dense_Dense4510",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4506/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4506/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4507/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4507/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4508/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4508/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4509/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense4509/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4510/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4510/bias","shape":[1],"dtype":"float32"}]}]}