{"modelTopology":{"class_name":"Model","config":{"name":"model216","layers":[{"name":"input216","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input216"},"inbound_nodes":[]},{"name":"dense_Dense1291","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1291","trainable":true},"inbound_nodes":[[["input216",0,0,{}]]]},{"name":"dense_Dense1292","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1292","trainable":true},"inbound_nodes":[[["dense_Dense1291",0,0,{}]]]},{"name":"dense_Dense1293","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1293","trainable":true},"inbound_nodes":[[["dense_Dense1292",0,0,{}]]]},{"name":"dense_Dense1294","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1294","trainable":true},"inbound_nodes":[[["dense_Dense1293",0,0,{}]]]},{"name":"dense_Dense1295","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1295","trainable":true},"inbound_nodes":[[["dense_Dense1294",0,0,{}]]]},{"name":"dense_Dense1296","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1296","trainable":true},"inbound_nodes":[[["dense_Dense1295",0,0,{}]]]}],"input_layers":[["input216",0,0]],"output_layers":[["dense_Dense1296",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1291/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense1291/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1292/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1292/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1293/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense1293/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1294/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense1294/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1295/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense1295/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1296/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1296/bias","shape":[1],"dtype":"float32"}]}]}