{"modelTopology":{"class_name":"Model","config":{"name":"model1169","layers":[{"name":"input1169","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1169"},"inbound_nodes":[]},{"name":"dense_Dense7009","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7009","trainable":true},"inbound_nodes":[[["input1169",0,0,{}]]]},{"name":"dense_Dense7010","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7010","trainable":true},"inbound_nodes":[[["dense_Dense7009",0,0,{}]]]},{"name":"dense_Dense7011","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7011","trainable":true},"inbound_nodes":[[["dense_Dense7010",0,0,{}]]]},{"name":"dense_Dense7012","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7012","trainable":true},"inbound_nodes":[[["dense_Dense7011",0,0,{}]]]},{"name":"dense_Dense7013","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7013","trainable":true},"inbound_nodes":[[["dense_Dense7012",0,0,{}]]]},{"name":"dense_Dense7014","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7014","trainable":true},"inbound_nodes":[[["dense_Dense7013",0,0,{}]]]}],"input_layers":[["input1169",0,0]],"output_layers":[["dense_Dense7014",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7009/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense7009/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7010/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense7010/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7011/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense7011/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7012/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense7012/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7013/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense7013/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7014/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7014/bias","shape":[1],"dtype":"float32"}]}]}