{"modelTopology":{"class_name":"Model","config":{"name":"model130","layers":[{"name":"input130","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input130"},"inbound_nodes":[]},{"name":"dense_Dense775","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense775","trainable":true},"inbound_nodes":[[["input130",0,0,{}]]]},{"name":"dense_Dense776","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense776","trainable":true},"inbound_nodes":[[["dense_Dense775",0,0,{}]]]},{"name":"dense_Dense777","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense777","trainable":true},"inbound_nodes":[[["dense_Dense776",0,0,{}]]]},{"name":"dense_Dense778","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense778","trainable":true},"inbound_nodes":[[["dense_Dense777",0,0,{}]]]},{"name":"dense_Dense779","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense779","trainable":true},"inbound_nodes":[[["dense_Dense778",0,0,{}]]]},{"name":"dense_Dense780","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense780","trainable":true},"inbound_nodes":[[["dense_Dense779",0,0,{}]]]}],"input_layers":[["input130",0,0]],"output_layers":[["dense_Dense780",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense775/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense775/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense776/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense776/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense777/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense777/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense778/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense778/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense779/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense779/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense780/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense780/bias","shape":[1],"dtype":"float32"}]}]}