{"modelTopology":{"class_name":"Model","config":{"name":"model953","layers":[{"name":"input953","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input953"},"inbound_nodes":[]},{"name":"dense_Dense4761","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4761","trainable":true},"inbound_nodes":[[["input953",0,0,{}]]]},{"name":"dense_Dense4762","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4762","trainable":true},"inbound_nodes":[[["dense_Dense4761",0,0,{}]]]},{"name":"dense_Dense4763","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4763","trainable":true},"inbound_nodes":[[["dense_Dense4762",0,0,{}]]]},{"name":"dense_Dense4764","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4764","trainable":true},"inbound_nodes":[[["dense_Dense4763",0,0,{}]]]},{"name":"dense_Dense4765","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4765","trainable":true},"inbound_nodes":[[["dense_Dense4764",0,0,{}]]]}],"input_layers":[["input953",0,0]],"output_layers":[["dense_Dense4765",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4761/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4761/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4762/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense4762/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4763/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense4763/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4764/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense4764/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4765/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4765/bias","shape":[1],"dtype":"float32"}]}]}