{"modelTopology":{"class_name":"Model","config":{"name":"model1253","layers":[{"name":"input1253","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1253"},"inbound_nodes":[]},{"name":"dense_Dense7513","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7513","trainable":true},"inbound_nodes":[[["input1253",0,0,{}]]]},{"name":"dense_Dense7514","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7514","trainable":true},"inbound_nodes":[[["dense_Dense7513",0,0,{}]]]},{"name":"dense_Dense7515","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7515","trainable":true},"inbound_nodes":[[["dense_Dense7514",0,0,{}]]]},{"name":"dense_Dense7516","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7516","trainable":true},"inbound_nodes":[[["dense_Dense7515",0,0,{}]]]},{"name":"dense_Dense7517","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7517","trainable":true},"inbound_nodes":[[["dense_Dense7516",0,0,{}]]]},{"name":"dense_Dense7518","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7518","trainable":true},"inbound_nodes":[[["dense_Dense7517",0,0,{}]]]}],"input_layers":[["input1253",0,0]],"output_layers":[["dense_Dense7518",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7513/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense7513/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7514/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense7514/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7515/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense7515/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7516/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense7516/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7517/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense7517/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7518/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7518/bias","shape":[1],"dtype":"float32"}]}]}