{"modelTopology":{"class_name":"Model","config":{"name":"model634","layers":[{"name":"input634","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input634"},"inbound_nodes":[]},{"name":"dense_Dense3166","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3166","trainable":true},"inbound_nodes":[[["input634",0,0,{}]]]},{"name":"dense_Dense3167","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3167","trainable":true},"inbound_nodes":[[["dense_Dense3166",0,0,{}]]]},{"name":"dense_Dense3168","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3168","trainable":true},"inbound_nodes":[[["dense_Dense3167",0,0,{}]]]},{"name":"dense_Dense3169","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3169","trainable":true},"inbound_nodes":[[["dense_Dense3168",0,0,{}]]]},{"name":"dense_Dense3170","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3170","trainable":true},"inbound_nodes":[[["dense_Dense3169",0,0,{}]]]}],"input_layers":[["input634",0,0]],"output_layers":[["dense_Dense3170",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3166/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3166/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3167/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3167/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3168/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense3168/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3169/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense3169/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3170/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3170/bias","shape":[1],"dtype":"float32"}]}]}