{"modelTopology":{"class_name":"Model","config":{"name":"model1031","layers":[{"name":"input1031","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1031"},"inbound_nodes":[]},{"name":"dense_Dense6181","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6181","trainable":true},"inbound_nodes":[[["input1031",0,0,{}]]]},{"name":"dense_Dense6182","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6182","trainable":true},"inbound_nodes":[[["dense_Dense6181",0,0,{}]]]},{"name":"dense_Dense6183","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6183","trainable":true},"inbound_nodes":[[["dense_Dense6182",0,0,{}]]]},{"name":"dense_Dense6184","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6184","trainable":true},"inbound_nodes":[[["dense_Dense6183",0,0,{}]]]},{"name":"dense_Dense6185","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6185","trainable":true},"inbound_nodes":[[["dense_Dense6184",0,0,{}]]]},{"name":"dense_Dense6186","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6186","trainable":true},"inbound_nodes":[[["dense_Dense6185",0,0,{}]]]}],"input_layers":[["input1031",0,0]],"output_layers":[["dense_Dense6186",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6181/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6181/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6182/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense6182/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6183/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6183/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6184/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6184/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6185/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6185/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6186/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6186/bias","shape":[1],"dtype":"float32"}]}]}