{"modelTopology":{"class_name":"Model","config":{"name":"model15","layers":[{"name":"input15","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input15"},"inbound_nodes":[]},{"name":"dense_Dense85","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense85","trainable":true},"inbound_nodes":[[["input15",0,0,{}]]]},{"name":"dense_Dense86","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense86","trainable":true},"inbound_nodes":[[["dense_Dense85",0,0,{}]]]},{"name":"dense_Dense87","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense87","trainable":true},"inbound_nodes":[[["dense_Dense86",0,0,{}]]]},{"name":"dense_Dense88","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense88","trainable":true},"inbound_nodes":[[["dense_Dense87",0,0,{}]]]},{"name":"dense_Dense89","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense89","trainable":true},"inbound_nodes":[[["dense_Dense88",0,0,{}]]]},{"name":"dense_Dense90","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense90","trainable":true},"inbound_nodes":[[["dense_Dense89",0,0,{}]]]}],"input_layers":[["input15",0,0]],"output_layers":[["dense_Dense90",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense85/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense85/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense86/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense86/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense87/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense87/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense88/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense88/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense89/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense89/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense90/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense90/bias","shape":[1],"dtype":"float32"}]}]}