{"modelTopology":{"class_name":"Model","config":{"name":"model258","layers":[{"name":"input258","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input258"},"inbound_nodes":[]},{"name":"dense_Dense1543","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1543","trainable":true},"inbound_nodes":[[["input258",0,0,{}]]]},{"name":"dense_Dense1544","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1544","trainable":true},"inbound_nodes":[[["dense_Dense1543",0,0,{}]]]},{"name":"dense_Dense1545","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1545","trainable":true},"inbound_nodes":[[["dense_Dense1544",0,0,{}]]]},{"name":"dense_Dense1546","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1546","trainable":true},"inbound_nodes":[[["dense_Dense1545",0,0,{}]]]},{"name":"dense_Dense1547","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1547","trainable":true},"inbound_nodes":[[["dense_Dense1546",0,0,{}]]]},{"name":"dense_Dense1548","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1548","trainable":true},"inbound_nodes":[[["dense_Dense1547",0,0,{}]]]}],"input_layers":[["input258",0,0]],"output_layers":[["dense_Dense1548",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1543/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense1543/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1544/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense1544/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1545/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1545/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1546/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1546/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1547/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense1547/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1548/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1548/bias","shape":[1],"dtype":"float32"}]}]}