{"modelTopology":{"class_name":"Model","config":{"name":"model377","layers":[{"name":"input377","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input377"},"inbound_nodes":[]},{"name":"dense_Dense2257","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2257","trainable":true},"inbound_nodes":[[["input377",0,0,{}]]]},{"name":"dense_Dense2258","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2258","trainable":true},"inbound_nodes":[[["dense_Dense2257",0,0,{}]]]},{"name":"dense_Dense2259","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2259","trainable":true},"inbound_nodes":[[["dense_Dense2258",0,0,{}]]]},{"name":"dense_Dense2260","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2260","trainable":true},"inbound_nodes":[[["dense_Dense2259",0,0,{}]]]},{"name":"dense_Dense2261","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2261","trainable":true},"inbound_nodes":[[["dense_Dense2260",0,0,{}]]]},{"name":"dense_Dense2262","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2262","trainable":true},"inbound_nodes":[[["dense_Dense2261",0,0,{}]]]}],"input_layers":[["input377",0,0]],"output_layers":[["dense_Dense2262",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2257/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense2257/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2258/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense2258/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2259/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2259/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2260/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2260/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2261/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2261/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2262/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2262/bias","shape":[1],"dtype":"float32"}]}]}