{"modelTopology":{"class_name":"Model","config":{"name":"model1161","layers":[{"name":"input1161","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1161"},"inbound_nodes":[]},{"name":"dense_Dense6961","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6961","trainable":true},"inbound_nodes":[[["input1161",0,0,{}]]]},{"name":"dense_Dense6962","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6962","trainable":true},"inbound_nodes":[[["dense_Dense6961",0,0,{}]]]},{"name":"dense_Dense6963","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6963","trainable":true},"inbound_nodes":[[["dense_Dense6962",0,0,{}]]]},{"name":"dense_Dense6964","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6964","trainable":true},"inbound_nodes":[[["dense_Dense6963",0,0,{}]]]},{"name":"dense_Dense6965","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6965","trainable":true},"inbound_nodes":[[["dense_Dense6964",0,0,{}]]]},{"name":"dense_Dense6966","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6966","trainable":true},"inbound_nodes":[[["dense_Dense6965",0,0,{}]]]}],"input_layers":[["input1161",0,0]],"output_layers":[["dense_Dense6966",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6961/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense6961/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6962/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense6962/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6963/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense6963/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6964/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense6964/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6965/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense6965/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6966/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6966/bias","shape":[1],"dtype":"float32"}]}]}