{"modelTopology":{"class_name":"Model","config":{"name":"model48","layers":[{"name":"input48","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input48"},"inbound_nodes":[]},{"name":"dense_Dense283","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense283","trainable":true},"inbound_nodes":[[["input48",0,0,{}]]]},{"name":"dense_Dense284","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense284","trainable":true},"inbound_nodes":[[["dense_Dense283",0,0,{}]]]},{"name":"dense_Dense285","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense285","trainable":true},"inbound_nodes":[[["dense_Dense284",0,0,{}]]]},{"name":"dense_Dense286","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense286","trainable":true},"inbound_nodes":[[["dense_Dense285",0,0,{}]]]},{"name":"dense_Dense287","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense287","trainable":true},"inbound_nodes":[[["dense_Dense286",0,0,{}]]]},{"name":"dense_Dense288","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense288","trainable":true},"inbound_nodes":[[["dense_Dense287",0,0,{}]]]}],"input_layers":[["input48",0,0]],"output_layers":[["dense_Dense288",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense283/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense283/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense284/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense284/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense285/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense285/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense286/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense286/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense287/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense287/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense288/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense288/bias","shape":[1],"dtype":"float32"}]}]}