{"modelTopology":{"class_name":"Model","config":{"name":"model200","layers":[{"name":"input200","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input200"},"inbound_nodes":[]},{"name":"dense_Dense996","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense996","trainable":true},"inbound_nodes":[[["input200",0,0,{}]]]},{"name":"dense_Dense997","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense997","trainable":true},"inbound_nodes":[[["dense_Dense996",0,0,{}]]]},{"name":"dense_Dense998","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense998","trainable":true},"inbound_nodes":[[["dense_Dense997",0,0,{}]]]},{"name":"dense_Dense999","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense999","trainable":true},"inbound_nodes":[[["dense_Dense998",0,0,{}]]]},{"name":"dense_Dense1000","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1000","trainable":true},"inbound_nodes":[[["dense_Dense999",0,0,{}]]]}],"input_layers":[["input200",0,0]],"output_layers":[["dense_Dense1000",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense996/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense996/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense997/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense997/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense998/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense998/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense999/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense999/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1000/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1000/bias","shape":[1],"dtype":"float32"}]}]}