{"modelTopology":{"class_name":"Model","config":{"name":"model118","layers":[{"name":"input118","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input118"},"inbound_nodes":[]},{"name":"dense_Dense703","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense703","trainable":true},"inbound_nodes":[[["input118",0,0,{}]]]},{"name":"dense_Dense704","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense704","trainable":true},"inbound_nodes":[[["dense_Dense703",0,0,{}]]]},{"name":"dense_Dense705","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense705","trainable":true},"inbound_nodes":[[["dense_Dense704",0,0,{}]]]},{"name":"dense_Dense706","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense706","trainable":true},"inbound_nodes":[[["dense_Dense705",0,0,{}]]]},{"name":"dense_Dense707","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense707","trainable":true},"inbound_nodes":[[["dense_Dense706",0,0,{}]]]},{"name":"dense_Dense708","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense708","trainable":true},"inbound_nodes":[[["dense_Dense707",0,0,{}]]]}],"input_layers":[["input118",0,0]],"output_layers":[["dense_Dense708",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense703/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense703/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense704/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense704/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense705/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense705/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense706/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense706/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense707/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense707/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense708/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense708/bias","shape":[1],"dtype":"float32"}]}]}