{"modelTopology":{"class_name":"Model","config":{"name":"model1264","layers":[{"name":"input1264","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1264"},"inbound_nodes":[]},{"name":"dense_Dense6316","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6316","trainable":true},"inbound_nodes":[[["input1264",0,0,{}]]]},{"name":"dense_Dense6317","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6317","trainable":true},"inbound_nodes":[[["dense_Dense6316",0,0,{}]]]},{"name":"dense_Dense6318","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6318","trainable":true},"inbound_nodes":[[["dense_Dense6317",0,0,{}]]]},{"name":"dense_Dense6319","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6319","trainable":true},"inbound_nodes":[[["dense_Dense6318",0,0,{}]]]},{"name":"dense_Dense6320","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6320","trainable":true},"inbound_nodes":[[["dense_Dense6319",0,0,{}]]]}],"input_layers":[["input1264",0,0]],"output_layers":[["dense_Dense6320",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6316/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6316/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6317/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense6317/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6318/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6318/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6319/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense6319/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6320/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense6320/bias","shape":[1],"dtype":"float32"}]}]}