{"modelTopology":{"class_name":"Model","config":{"name":"model973","layers":[{"name":"input973","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input973"},"inbound_nodes":[]},{"name":"dense_Dense5833","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5833","trainable":true},"inbound_nodes":[[["input973",0,0,{}]]]},{"name":"dense_Dense5834","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5834","trainable":true},"inbound_nodes":[[["dense_Dense5833",0,0,{}]]]},{"name":"dense_Dense5835","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5835","trainable":true},"inbound_nodes":[[["dense_Dense5834",0,0,{}]]]},{"name":"dense_Dense5836","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5836","trainable":true},"inbound_nodes":[[["dense_Dense5835",0,0,{}]]]},{"name":"dense_Dense5837","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5837","trainable":true},"inbound_nodes":[[["dense_Dense5836",0,0,{}]]]},{"name":"dense_Dense5838","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5838","trainable":true},"inbound_nodes":[[["dense_Dense5837",0,0,{}]]]}],"input_layers":[["input973",0,0]],"output_layers":[["dense_Dense5838",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5833/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense5833/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5834/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense5834/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5835/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5835/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5836/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5836/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5837/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5837/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense5838/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5838/bias","shape":[1],"dtype":"float32"}]}]}