{"modelTopology":{"class_name":"Model","config":{"name":"model351","layers":[{"name":"input351","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input351"},"inbound_nodes":[]},{"name":"dense_Dense2101","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2101","trainable":true},"inbound_nodes":[[["input351",0,0,{}]]]},{"name":"dense_Dense2102","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2102","trainable":true},"inbound_nodes":[[["dense_Dense2101",0,0,{}]]]},{"name":"dense_Dense2103","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2103","trainable":true},"inbound_nodes":[[["dense_Dense2102",0,0,{}]]]},{"name":"dense_Dense2104","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2104","trainable":true},"inbound_nodes":[[["dense_Dense2103",0,0,{}]]]},{"name":"dense_Dense2105","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2105","trainable":true},"inbound_nodes":[[["dense_Dense2104",0,0,{}]]]},{"name":"dense_Dense2106","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2106","trainable":true},"inbound_nodes":[[["dense_Dense2105",0,0,{}]]]}],"input_layers":[["input351",0,0]],"output_layers":[["dense_Dense2106",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2101/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense2101/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2102/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense2102/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2103/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2103/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2104/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense2104/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2105/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2105/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2106/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2106/bias","shape":[1],"dtype":"float32"}]}]}