{"modelTopology":{"class_name":"Model","config":{"name":"model469","layers":[{"name":"input469","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input469"},"inbound_nodes":[]},{"name":"dense_Dense2341","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2341","trainable":true},"inbound_nodes":[[["input469",0,0,{}]]]},{"name":"dense_Dense2342","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2342","trainable":true},"inbound_nodes":[[["dense_Dense2341",0,0,{}]]]},{"name":"dense_Dense2343","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2343","trainable":true},"inbound_nodes":[[["dense_Dense2342",0,0,{}]]]},{"name":"dense_Dense2344","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2344","trainable":true},"inbound_nodes":[[["dense_Dense2343",0,0,{}]]]},{"name":"dense_Dense2345","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2345","trainable":true},"inbound_nodes":[[["dense_Dense2344",0,0,{}]]]}],"input_layers":[["input469",0,0]],"output_layers":[["dense_Dense2345",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2341/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2341/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2342/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2342/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2343/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense2343/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2344/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2344/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2345/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2345/bias","shape":[1],"dtype":"float32"}]}]}