{"modelTopology":{"class_name":"Model","config":{"name":"model792","layers":[{"name":"input792","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input792"},"inbound_nodes":[]},{"name":"dense_Dense4747","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4747","trainable":true},"inbound_nodes":[[["input792",0,0,{}]]]},{"name":"dense_Dense4748","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4748","trainable":true},"inbound_nodes":[[["dense_Dense4747",0,0,{}]]]},{"name":"dense_Dense4749","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4749","trainable":true},"inbound_nodes":[[["dense_Dense4748",0,0,{}]]]},{"name":"dense_Dense4750","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4750","trainable":true},"inbound_nodes":[[["dense_Dense4749",0,0,{}]]]},{"name":"dense_Dense4751","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4751","trainable":true},"inbound_nodes":[[["dense_Dense4750",0,0,{}]]]},{"name":"dense_Dense4752","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4752","trainable":true},"inbound_nodes":[[["dense_Dense4751",0,0,{}]]]}],"input_layers":[["input792",0,0]],"output_layers":[["dense_Dense4752",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4747/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense4747/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4748/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense4748/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4749/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4749/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4750/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4750/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4751/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense4751/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4752/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4752/bias","shape":[1],"dtype":"float32"}]}]}