{"modelTopology":{"class_name":"Model","config":{"name":"model213","layers":[{"name":"input213","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input213"},"inbound_nodes":[]},{"name":"dense_Dense849","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense849","trainable":true},"inbound_nodes":[[["input213",0,0,{}]]]},{"name":"dense_Dense850","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense850","trainable":true},"inbound_nodes":[[["dense_Dense849",0,0,{}]]]},{"name":"dense_Dense851","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense851","trainable":true},"inbound_nodes":[[["dense_Dense850",0,0,{}]]]},{"name":"dense_Dense852","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense852","trainable":true},"inbound_nodes":[[["dense_Dense851",0,0,{}]]]}],"input_layers":[["input213",0,0]],"output_layers":[["dense_Dense852",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense849/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense849/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense850/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense850/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense851/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense851/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense852/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense852/bias","shape":[1],"dtype":"float32"}]}]}