{"modelTopology":{"class_name":"Model","config":{"name":"model1150","layers":[{"name":"input1150","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1150"},"inbound_nodes":[]},{"name":"dense_Dense5746","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5746","trainable":true},"inbound_nodes":[[["input1150",0,0,{}]]]},{"name":"dense_Dense5747","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5747","trainable":true},"inbound_nodes":[[["dense_Dense5746",0,0,{}]]]},{"name":"dense_Dense5748","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5748","trainable":true},"inbound_nodes":[[["dense_Dense5747",0,0,{}]]]},{"name":"dense_Dense5749","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5749","trainable":true},"inbound_nodes":[[["dense_Dense5748",0,0,{}]]]},{"name":"dense_Dense5750","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5750","trainable":true},"inbound_nodes":[[["dense_Dense5749",0,0,{}]]]}],"input_layers":[["input1150",0,0]],"output_layers":[["dense_Dense5750",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5746/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5746/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5747/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense5747/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5748/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense5748/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5749/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense5749/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5750/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5750/bias","shape":[1],"dtype":"float32"}]}]}