{"modelTopology":{"class_name":"Model","config":{"name":"model1112","layers":[{"name":"input1112","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1112"},"inbound_nodes":[]},{"name":"dense_Dense6667","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6667","trainable":true},"inbound_nodes":[[["input1112",0,0,{}]]]},{"name":"dense_Dense6668","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6668","trainable":true},"inbound_nodes":[[["dense_Dense6667",0,0,{}]]]},{"name":"dense_Dense6669","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6669","trainable":true},"inbound_nodes":[[["dense_Dense6668",0,0,{}]]]},{"name":"dense_Dense6670","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6670","trainable":true},"inbound_nodes":[[["dense_Dense6669",0,0,{}]]]},{"name":"dense_Dense6671","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6671","trainable":true},"inbound_nodes":[[["dense_Dense6670",0,0,{}]]]},{"name":"dense_Dense6672","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6672","trainable":true},"inbound_nodes":[[["dense_Dense6671",0,0,{}]]]}],"input_layers":[["input1112",0,0]],"output_layers":[["dense_Dense6672",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6667/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense6667/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6668/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6668/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6669/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6669/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6670/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense6670/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6671/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense6671/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6672/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6672/bias","shape":[1],"dtype":"float32"}]}]}