{"modelTopology":{"class_name":"Model","config":{"name":"model523","layers":[{"name":"input523","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input523"},"inbound_nodes":[]},{"name":"dense_Dense3133","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3133","trainable":true},"inbound_nodes":[[["input523",0,0,{}]]]},{"name":"dense_Dense3134","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3134","trainable":true},"inbound_nodes":[[["dense_Dense3133",0,0,{}]]]},{"name":"dense_Dense3135","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3135","trainable":true},"inbound_nodes":[[["dense_Dense3134",0,0,{}]]]},{"name":"dense_Dense3136","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3136","trainable":true},"inbound_nodes":[[["dense_Dense3135",0,0,{}]]]},{"name":"dense_Dense3137","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3137","trainable":true},"inbound_nodes":[[["dense_Dense3136",0,0,{}]]]},{"name":"dense_Dense3138","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3138","trainable":true},"inbound_nodes":[[["dense_Dense3137",0,0,{}]]]}],"input_layers":[["input523",0,0]],"output_layers":[["dense_Dense3138",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3133/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense3133/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3134/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3134/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3135/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3135/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3136/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3136/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3137/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3137/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3138/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense3138/bias","shape":[1],"dtype":"float32"}]}]}