{"modelTopology":{"class_name":"Model","config":{"name":"model180","layers":[{"name":"input180","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input180"},"inbound_nodes":[]},{"name":"dense_Dense1075","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1075","trainable":true},"inbound_nodes":[[["input180",0,0,{}]]]},{"name":"dense_Dense1076","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1076","trainable":true},"inbound_nodes":[[["dense_Dense1075",0,0,{}]]]},{"name":"dense_Dense1077","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1077","trainable":true},"inbound_nodes":[[["dense_Dense1076",0,0,{}]]]},{"name":"dense_Dense1078","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1078","trainable":true},"inbound_nodes":[[["dense_Dense1077",0,0,{}]]]},{"name":"dense_Dense1079","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1079","trainable":true},"inbound_nodes":[[["dense_Dense1078",0,0,{}]]]},{"name":"dense_Dense1080","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1080","trainable":true},"inbound_nodes":[[["dense_Dense1079",0,0,{}]]]}],"input_layers":[["input180",0,0]],"output_layers":[["dense_Dense1080",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1075/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense1075/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1076/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense1076/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1077/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1077/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1078/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense1078/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1079/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense1079/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1080/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1080/bias","shape":[1],"dtype":"float32"}]}]}