{"modelTopology":{"class_name":"Model","config":{"name":"model112","layers":[{"name":"input112","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input112"},"inbound_nodes":[]},{"name":"dense_Dense667","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense667","trainable":true},"inbound_nodes":[[["input112",0,0,{}]]]},{"name":"dense_Dense668","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense668","trainable":true},"inbound_nodes":[[["dense_Dense667",0,0,{}]]]},{"name":"dense_Dense669","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense669","trainable":true},"inbound_nodes":[[["dense_Dense668",0,0,{}]]]},{"name":"dense_Dense670","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense670","trainable":true},"inbound_nodes":[[["dense_Dense669",0,0,{}]]]},{"name":"dense_Dense671","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense671","trainable":true},"inbound_nodes":[[["dense_Dense670",0,0,{}]]]},{"name":"dense_Dense672","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense672","trainable":true},"inbound_nodes":[[["dense_Dense671",0,0,{}]]]}],"input_layers":[["input112",0,0]],"output_layers":[["dense_Dense672",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense667/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense667/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense668/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense668/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense669/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense669/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense670/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense670/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense671/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense671/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense672/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense672/bias","shape":[1],"dtype":"float32"}]}]}