{"modelTopology":{"class_name":"Model","config":{"name":"model1251","layers":[{"name":"input1251","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1251"},"inbound_nodes":[]},{"name":"dense_Dense6251","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6251","trainable":true},"inbound_nodes":[[["input1251",0,0,{}]]]},{"name":"dense_Dense6252","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6252","trainable":true},"inbound_nodes":[[["dense_Dense6251",0,0,{}]]]},{"name":"dense_Dense6253","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6253","trainable":true},"inbound_nodes":[[["dense_Dense6252",0,0,{}]]]},{"name":"dense_Dense6254","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6254","trainable":true},"inbound_nodes":[[["dense_Dense6253",0,0,{}]]]},{"name":"dense_Dense6255","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6255","trainable":true},"inbound_nodes":[[["dense_Dense6254",0,0,{}]]]}],"input_layers":[["input1251",0,0]],"output_layers":[["dense_Dense6255",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6251/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6251/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6252/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense6252/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6253/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6253/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6254/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense6254/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6255/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6255/bias","shape":[1],"dtype":"float32"}]}]}