{"modelTopology":{"class_name":"Model","config":{"name":"model800","layers":[{"name":"input800","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input800"},"inbound_nodes":[]},{"name":"dense_Dense4795","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4795","trainable":true},"inbound_nodes":[[["input800",0,0,{}]]]},{"name":"dense_Dense4796","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4796","trainable":true},"inbound_nodes":[[["dense_Dense4795",0,0,{}]]]},{"name":"dense_Dense4797","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4797","trainable":true},"inbound_nodes":[[["dense_Dense4796",0,0,{}]]]},{"name":"dense_Dense4798","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4798","trainable":true},"inbound_nodes":[[["dense_Dense4797",0,0,{}]]]},{"name":"dense_Dense4799","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4799","trainable":true},"inbound_nodes":[[["dense_Dense4798",0,0,{}]]]},{"name":"dense_Dense4800","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4800","trainable":true},"inbound_nodes":[[["dense_Dense4799",0,0,{}]]]}],"input_layers":[["input800",0,0]],"output_layers":[["dense_Dense4800",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4795/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense4795/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4796/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4796/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4797/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4797/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4798/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4798/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4799/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense4799/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4800/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4800/bias","shape":[1],"dtype":"float32"}]}]}