{"modelTopology":{"class_name":"Model","config":{"name":"model315","layers":[{"name":"input315","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input315"},"inbound_nodes":[]},{"name":"dense_Dense1885","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1885","trainable":true},"inbound_nodes":[[["input315",0,0,{}]]]},{"name":"dense_Dense1886","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1886","trainable":true},"inbound_nodes":[[["dense_Dense1885",0,0,{}]]]},{"name":"dense_Dense1887","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1887","trainable":true},"inbound_nodes":[[["dense_Dense1886",0,0,{}]]]},{"name":"dense_Dense1888","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1888","trainable":true},"inbound_nodes":[[["dense_Dense1887",0,0,{}]]]},{"name":"dense_Dense1889","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1889","trainable":true},"inbound_nodes":[[["dense_Dense1888",0,0,{}]]]},{"name":"dense_Dense1890","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1890","trainable":true},"inbound_nodes":[[["dense_Dense1889",0,0,{}]]]}],"input_layers":[["input315",0,0]],"output_layers":[["dense_Dense1890",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1885/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense1885/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1886/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense1886/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1887/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1887/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1888/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense1888/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1889/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense1889/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1890/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1890/bias","shape":[1],"dtype":"float32"}]}]}