{"modelTopology":{"class_name":"Model","config":{"name":"model1189","layers":[{"name":"input1189","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1189"},"inbound_nodes":[]},{"name":"dense_Dense7129","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7129","trainable":true},"inbound_nodes":[[["input1189",0,0,{}]]]},{"name":"dense_Dense7130","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7130","trainable":true},"inbound_nodes":[[["dense_Dense7129",0,0,{}]]]},{"name":"dense_Dense7131","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7131","trainable":true},"inbound_nodes":[[["dense_Dense7130",0,0,{}]]]},{"name":"dense_Dense7132","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7132","trainable":true},"inbound_nodes":[[["dense_Dense7131",0,0,{}]]]},{"name":"dense_Dense7133","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7133","trainable":true},"inbound_nodes":[[["dense_Dense7132",0,0,{}]]]},{"name":"dense_Dense7134","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7134","trainable":true},"inbound_nodes":[[["dense_Dense7133",0,0,{}]]]}],"input_layers":[["input1189",0,0]],"output_layers":[["dense_Dense7134",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7129/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense7129/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7130/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7130/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7131/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7131/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7132/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7132/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7133/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense7133/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7134/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense7134/bias","shape":[1],"dtype":"float32"}]}]}