{"modelTopology":{"class_name":"Model","config":{"name":"model376","layers":[{"name":"input376","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input376"},"inbound_nodes":[]},{"name":"dense_Dense1876","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1876","trainable":true},"inbound_nodes":[[["input376",0,0,{}]]]},{"name":"dense_Dense1877","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1877","trainable":true},"inbound_nodes":[[["dense_Dense1876",0,0,{}]]]},{"name":"dense_Dense1878","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1878","trainable":true},"inbound_nodes":[[["dense_Dense1877",0,0,{}]]]},{"name":"dense_Dense1879","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1879","trainable":true},"inbound_nodes":[[["dense_Dense1878",0,0,{}]]]},{"name":"dense_Dense1880","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1880","trainable":true},"inbound_nodes":[[["dense_Dense1879",0,0,{}]]]}],"input_layers":[["input376",0,0]],"output_layers":[["dense_Dense1880",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1876/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1876/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1877/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense1877/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1878/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense1878/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1879/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense1879/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1880/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1880/bias","shape":[1],"dtype":"float32"}]}]}