{"modelTopology":{"class_name":"Model","config":{"name":"model669","layers":[{"name":"input669","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input669"},"inbound_nodes":[]},{"name":"dense_Dense4009","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4009","trainable":true},"inbound_nodes":[[["input669",0,0,{}]]]},{"name":"dense_Dense4010","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4010","trainable":true},"inbound_nodes":[[["dense_Dense4009",0,0,{}]]]},{"name":"dense_Dense4011","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4011","trainable":true},"inbound_nodes":[[["dense_Dense4010",0,0,{}]]]},{"name":"dense_Dense4012","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4012","trainable":true},"inbound_nodes":[[["dense_Dense4011",0,0,{}]]]},{"name":"dense_Dense4013","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4013","trainable":true},"inbound_nodes":[[["dense_Dense4012",0,0,{}]]]},{"name":"dense_Dense4014","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4014","trainable":true},"inbound_nodes":[[["dense_Dense4013",0,0,{}]]]}],"input_layers":[["input669",0,0]],"output_layers":[["dense_Dense4014",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4009/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense4009/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4010/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense4010/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4011/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4011/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4012/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense4012/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4013/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense4013/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4014/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4014/bias","shape":[1],"dtype":"float32"}]}]}