{"modelTopology":{"class_name":"Model","config":{"name":"model702","layers":[{"name":"input702","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input702"},"inbound_nodes":[]},{"name":"dense_Dense4207","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4207","trainable":true},"inbound_nodes":[[["input702",0,0,{}]]]},{"name":"dense_Dense4208","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4208","trainable":true},"inbound_nodes":[[["dense_Dense4207",0,0,{}]]]},{"name":"dense_Dense4209","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4209","trainable":true},"inbound_nodes":[[["dense_Dense4208",0,0,{}]]]},{"name":"dense_Dense4210","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4210","trainable":true},"inbound_nodes":[[["dense_Dense4209",0,0,{}]]]},{"name":"dense_Dense4211","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4211","trainable":true},"inbound_nodes":[[["dense_Dense4210",0,0,{}]]]},{"name":"dense_Dense4212","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4212","trainable":true},"inbound_nodes":[[["dense_Dense4211",0,0,{}]]]}],"input_layers":[["input702",0,0]],"output_layers":[["dense_Dense4212",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4207/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4207/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4208/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4208/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4209/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense4209/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4210/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense4210/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4211/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense4211/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4212/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4212/bias","shape":[1],"dtype":"float32"}]}]}