{"modelTopology":{"class_name":"Model","config":{"name":"model558","layers":[{"name":"input558","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input558"},"inbound_nodes":[]},{"name":"dense_Dense3343","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3343","trainable":true},"inbound_nodes":[[["input558",0,0,{}]]]},{"name":"dense_Dense3344","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3344","trainable":true},"inbound_nodes":[[["dense_Dense3343",0,0,{}]]]},{"name":"dense_Dense3345","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3345","trainable":true},"inbound_nodes":[[["dense_Dense3344",0,0,{}]]]},{"name":"dense_Dense3346","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3346","trainable":true},"inbound_nodes":[[["dense_Dense3345",0,0,{}]]]},{"name":"dense_Dense3347","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3347","trainable":true},"inbound_nodes":[[["dense_Dense3346",0,0,{}]]]},{"name":"dense_Dense3348","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3348","trainable":true},"inbound_nodes":[[["dense_Dense3347",0,0,{}]]]}],"input_layers":[["input558",0,0]],"output_layers":[["dense_Dense3348",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3343/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense3343/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3344/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense3344/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3345/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense3345/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3346/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3346/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3347/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3347/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3348/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3348/bias","shape":[1],"dtype":"float32"}]}]}