{"modelTopology":{"class_name":"Model","config":{"name":"model327","layers":[{"name":"input327","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input327"},"inbound_nodes":[]},{"name":"dense_Dense1957","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1957","trainable":true},"inbound_nodes":[[["input327",0,0,{}]]]},{"name":"dense_Dense1958","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1958","trainable":true},"inbound_nodes":[[["dense_Dense1957",0,0,{}]]]},{"name":"dense_Dense1959","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1959","trainable":true},"inbound_nodes":[[["dense_Dense1958",0,0,{}]]]},{"name":"dense_Dense1960","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1960","trainable":true},"inbound_nodes":[[["dense_Dense1959",0,0,{}]]]},{"name":"dense_Dense1961","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1961","trainable":true},"inbound_nodes":[[["dense_Dense1960",0,0,{}]]]},{"name":"dense_Dense1962","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1962","trainable":true},"inbound_nodes":[[["dense_Dense1961",0,0,{}]]]}],"input_layers":[["input327",0,0]],"output_layers":[["dense_Dense1962",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1957/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense1957/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1958/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense1958/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1959/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense1959/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1960/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1960/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1961/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense1961/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1962/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1962/bias","shape":[1],"dtype":"float32"}]}]}