{"modelTopology":{"class_name":"Model","config":{"name":"model449","layers":[{"name":"input449","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input449"},"inbound_nodes":[]},{"name":"dense_Dense2689","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2689","trainable":true},"inbound_nodes":[[["input449",0,0,{}]]]},{"name":"dense_Dense2690","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2690","trainable":true},"inbound_nodes":[[["dense_Dense2689",0,0,{}]]]},{"name":"dense_Dense2691","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2691","trainable":true},"inbound_nodes":[[["dense_Dense2690",0,0,{}]]]},{"name":"dense_Dense2692","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2692","trainable":true},"inbound_nodes":[[["dense_Dense2691",0,0,{}]]]},{"name":"dense_Dense2693","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2693","trainable":true},"inbound_nodes":[[["dense_Dense2692",0,0,{}]]]},{"name":"dense_Dense2694","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2694","trainable":true},"inbound_nodes":[[["dense_Dense2693",0,0,{}]]]}],"input_layers":[["input449",0,0]],"output_layers":[["dense_Dense2694",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2689/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense2689/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2690/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense2690/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2691/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2691/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2692/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense2692/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2693/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2693/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2694/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2694/bias","shape":[1],"dtype":"float32"}]}]}