{"modelTopology":{"class_name":"Model","config":{"name":"model1008","layers":[{"name":"input1008","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1008"},"inbound_nodes":[]},{"name":"dense_Dense6043","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6043","trainable":true},"inbound_nodes":[[["input1008",0,0,{}]]]},{"name":"dense_Dense6044","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6044","trainable":true},"inbound_nodes":[[["dense_Dense6043",0,0,{}]]]},{"name":"dense_Dense6045","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6045","trainable":true},"inbound_nodes":[[["dense_Dense6044",0,0,{}]]]},{"name":"dense_Dense6046","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6046","trainable":true},"inbound_nodes":[[["dense_Dense6045",0,0,{}]]]},{"name":"dense_Dense6047","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6047","trainable":true},"inbound_nodes":[[["dense_Dense6046",0,0,{}]]]},{"name":"dense_Dense6048","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6048","trainable":true},"inbound_nodes":[[["dense_Dense6047",0,0,{}]]]}],"input_layers":[["input1008",0,0]],"output_layers":[["dense_Dense6048",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6043/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6043/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6044/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6044/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6045/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6045/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6046/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6046/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6047/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense6047/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6048/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6048/bias","shape":[1],"dtype":"float32"}]}]}