{"modelTopology":{"class_name":"Model","config":{"name":"model851","layers":[{"name":"input851","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input851"},"inbound_nodes":[]},{"name":"dense_Dense4251","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4251","trainable":true},"inbound_nodes":[[["input851",0,0,{}]]]},{"name":"dense_Dense4252","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4252","trainable":true},"inbound_nodes":[[["dense_Dense4251",0,0,{}]]]},{"name":"dense_Dense4253","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4253","trainable":true},"inbound_nodes":[[["dense_Dense4252",0,0,{}]]]},{"name":"dense_Dense4254","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4254","trainable":true},"inbound_nodes":[[["dense_Dense4253",0,0,{}]]]},{"name":"dense_Dense4255","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4255","trainable":true},"inbound_nodes":[[["dense_Dense4254",0,0,{}]]]}],"input_layers":[["input851",0,0]],"output_layers":[["dense_Dense4255",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4251/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4251/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4252/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4252/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4253/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4253/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4254/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4254/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4255/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4255/bias","shape":[1],"dtype":"float32"}]}]}