{"modelTopology":{"class_name":"Model","config":{"name":"model1065","layers":[{"name":"input1065","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1065"},"inbound_nodes":[]},{"name":"dense_Dense6385","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6385","trainable":true},"inbound_nodes":[[["input1065",0,0,{}]]]},{"name":"dense_Dense6386","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6386","trainable":true},"inbound_nodes":[[["dense_Dense6385",0,0,{}]]]},{"name":"dense_Dense6387","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6387","trainable":true},"inbound_nodes":[[["dense_Dense6386",0,0,{}]]]},{"name":"dense_Dense6388","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6388","trainable":true},"inbound_nodes":[[["dense_Dense6387",0,0,{}]]]},{"name":"dense_Dense6389","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6389","trainable":true},"inbound_nodes":[[["dense_Dense6388",0,0,{}]]]},{"name":"dense_Dense6390","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6390","trainable":true},"inbound_nodes":[[["dense_Dense6389",0,0,{}]]]}],"input_layers":[["input1065",0,0]],"output_layers":[["dense_Dense6390",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6385/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6385/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6386/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6386/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6387/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6387/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6388/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense6388/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6389/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense6389/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6390/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6390/bias","shape":[1],"dtype":"float32"}]}]}