{"modelTopology":{"class_name":"Model","config":{"name":"model1002","layers":[{"name":"input1002","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1002"},"inbound_nodes":[]},{"name":"dense_Dense6007","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6007","trainable":true},"inbound_nodes":[[["input1002",0,0,{}]]]},{"name":"dense_Dense6008","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6008","trainable":true},"inbound_nodes":[[["dense_Dense6007",0,0,{}]]]},{"name":"dense_Dense6009","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6009","trainable":true},"inbound_nodes":[[["dense_Dense6008",0,0,{}]]]},{"name":"dense_Dense6010","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6010","trainable":true},"inbound_nodes":[[["dense_Dense6009",0,0,{}]]]},{"name":"dense_Dense6011","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6011","trainable":true},"inbound_nodes":[[["dense_Dense6010",0,0,{}]]]},{"name":"dense_Dense6012","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6012","trainable":true},"inbound_nodes":[[["dense_Dense6011",0,0,{}]]]}],"input_layers":[["input1002",0,0]],"output_layers":[["dense_Dense6012",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6007/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense6007/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6008/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense6008/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6009/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6009/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6010/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6010/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6011/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6011/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6012/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6012/bias","shape":[1],"dtype":"float32"}]}]}