{"modelTopology":{"class_name":"Model","config":{"name":"model1059","layers":[{"name":"input1059","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1059"},"inbound_nodes":[]},{"name":"dense_Dense5291","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5291","trainable":true},"inbound_nodes":[[["input1059",0,0,{}]]]},{"name":"dense_Dense5292","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5292","trainable":true},"inbound_nodes":[[["dense_Dense5291",0,0,{}]]]},{"name":"dense_Dense5293","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5293","trainable":true},"inbound_nodes":[[["dense_Dense5292",0,0,{}]]]},{"name":"dense_Dense5294","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5294","trainable":true},"inbound_nodes":[[["dense_Dense5293",0,0,{}]]]},{"name":"dense_Dense5295","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5295","trainable":true},"inbound_nodes":[[["dense_Dense5294",0,0,{}]]]}],"input_layers":[["input1059",0,0]],"output_layers":[["dense_Dense5295",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5291/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5291/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5292/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense5292/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5293/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense5293/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5294/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense5294/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5295/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense5295/bias","shape":[1],"dtype":"float32"}]}]}