{"modelTopology":{"class_name":"Model","config":{"name":"model54","layers":[{"name":"input54","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input54"},"inbound_nodes":[]},{"name":"dense_Dense213","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense213","trainable":true},"inbound_nodes":[[["input54",0,0,{}]]]},{"name":"dense_Dense214","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense214","trainable":true},"inbound_nodes":[[["dense_Dense213",0,0,{}]]]},{"name":"dense_Dense215","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense215","trainable":true},"inbound_nodes":[[["dense_Dense214",0,0,{}]]]},{"name":"dense_Dense216","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense216","trainable":true},"inbound_nodes":[[["dense_Dense215",0,0,{}]]]}],"input_layers":[["input54",0,0]],"output_layers":[["dense_Dense216",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense213/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense213/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense214/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense214/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense215/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense215/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense216/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense216/bias","shape":[1],"dtype":"float32"}]}]}