{"modelTopology":{"class_name":"Model","config":{"name":"model41","layers":[{"name":"input41","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input41"},"inbound_nodes":[]},{"name":"dense_Dense241","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense241","trainable":true},"inbound_nodes":[[["input41",0,0,{}]]]},{"name":"dense_Dense242","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense242","trainable":true},"inbound_nodes":[[["dense_Dense241",0,0,{}]]]},{"name":"dense_Dense243","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense243","trainable":true},"inbound_nodes":[[["dense_Dense242",0,0,{}]]]},{"name":"dense_Dense244","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense244","trainable":true},"inbound_nodes":[[["dense_Dense243",0,0,{}]]]},{"name":"dense_Dense245","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense245","trainable":true},"inbound_nodes":[[["dense_Dense244",0,0,{}]]]},{"name":"dense_Dense246","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense246","trainable":true},"inbound_nodes":[[["dense_Dense245",0,0,{}]]]}],"input_layers":[["input41",0,0]],"output_layers":[["dense_Dense246",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense241/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense241/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense242/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense242/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense243/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense243/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense244/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense244/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense245/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense245/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense246/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense246/bias","shape":[1],"dtype":"float32"}]}]}