{"modelTopology":{"class_name":"Model","config":{"name":"model998","layers":[{"name":"input998","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input998"},"inbound_nodes":[]},{"name":"dense_Dense4986","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4986","trainable":true},"inbound_nodes":[[["input998",0,0,{}]]]},{"name":"dense_Dense4987","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4987","trainable":true},"inbound_nodes":[[["dense_Dense4986",0,0,{}]]]},{"name":"dense_Dense4988","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4988","trainable":true},"inbound_nodes":[[["dense_Dense4987",0,0,{}]]]},{"name":"dense_Dense4989","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4989","trainable":true},"inbound_nodes":[[["dense_Dense4988",0,0,{}]]]},{"name":"dense_Dense4990","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4990","trainable":true},"inbound_nodes":[[["dense_Dense4989",0,0,{}]]]}],"input_layers":[["input998",0,0]],"output_layers":[["dense_Dense4990",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4986/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4986/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4987/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4987/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4988/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4988/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4989/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4989/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4990/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4990/bias","shape":[1],"dtype":"float32"}]}]}