{"modelTopology":{"class_name":"Model","config":{"name":"model1208","layers":[{"name":"input1208","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1208"},"inbound_nodes":[]},{"name":"dense_Dense6036","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6036","trainable":true},"inbound_nodes":[[["input1208",0,0,{}]]]},{"name":"dense_Dense6037","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6037","trainable":true},"inbound_nodes":[[["dense_Dense6036",0,0,{}]]]},{"name":"dense_Dense6038","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6038","trainable":true},"inbound_nodes":[[["dense_Dense6037",0,0,{}]]]},{"name":"dense_Dense6039","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6039","trainable":true},"inbound_nodes":[[["dense_Dense6038",0,0,{}]]]},{"name":"dense_Dense6040","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6040","trainable":true},"inbound_nodes":[[["dense_Dense6039",0,0,{}]]]}],"input_layers":[["input1208",0,0]],"output_layers":[["dense_Dense6040",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6036/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6036/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6037/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense6037/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6038/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense6038/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6039/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense6039/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6040/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6040/bias","shape":[1],"dtype":"float32"}]}]}