{"modelTopology":{"class_name":"Model","config":{"name":"model422","layers":[{"name":"input422","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input422"},"inbound_nodes":[]},{"name":"dense_Dense2106","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2106","trainable":true},"inbound_nodes":[[["input422",0,0,{}]]]},{"name":"dense_Dense2107","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2107","trainable":true},"inbound_nodes":[[["dense_Dense2106",0,0,{}]]]},{"name":"dense_Dense2108","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2108","trainable":true},"inbound_nodes":[[["dense_Dense2107",0,0,{}]]]},{"name":"dense_Dense2109","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2109","trainable":true},"inbound_nodes":[[["dense_Dense2108",0,0,{}]]]},{"name":"dense_Dense2110","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2110","trainable":true},"inbound_nodes":[[["dense_Dense2109",0,0,{}]]]}],"input_layers":[["input422",0,0]],"output_layers":[["dense_Dense2110",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2106/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2106/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2107/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2107/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2108/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense2108/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2109/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense2109/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2110/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense2110/bias","shape":[1],"dtype":"float32"}]}]}