{"modelTopology":{"class_name":"Model","config":{"name":"model635","layers":[{"name":"input635","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input635"},"inbound_nodes":[]},{"name":"dense_Dense3805","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3805","trainable":true},"inbound_nodes":[[["input635",0,0,{}]]]},{"name":"dense_Dense3806","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3806","trainable":true},"inbound_nodes":[[["dense_Dense3805",0,0,{}]]]},{"name":"dense_Dense3807","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3807","trainable":true},"inbound_nodes":[[["dense_Dense3806",0,0,{}]]]},{"name":"dense_Dense3808","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3808","trainable":true},"inbound_nodes":[[["dense_Dense3807",0,0,{}]]]},{"name":"dense_Dense3809","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3809","trainable":true},"inbound_nodes":[[["dense_Dense3808",0,0,{}]]]},{"name":"dense_Dense3810","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3810","trainable":true},"inbound_nodes":[[["dense_Dense3809",0,0,{}]]]}],"input_layers":[["input635",0,0]],"output_layers":[["dense_Dense3810",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3805/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense3805/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3806/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3806/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3807/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3807/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3808/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense3808/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3809/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense3809/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3810/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3810/bias","shape":[1],"dtype":"float32"}]}]}