{"modelTopology":{"class_name":"Model","config":{"name":"model339","layers":[{"name":"input339","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input339"},"inbound_nodes":[]},{"name":"dense_Dense2029","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2029","trainable":true},"inbound_nodes":[[["input339",0,0,{}]]]},{"name":"dense_Dense2030","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2030","trainable":true},"inbound_nodes":[[["dense_Dense2029",0,0,{}]]]},{"name":"dense_Dense2031","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2031","trainable":true},"inbound_nodes":[[["dense_Dense2030",0,0,{}]]]},{"name":"dense_Dense2032","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2032","trainable":true},"inbound_nodes":[[["dense_Dense2031",0,0,{}]]]},{"name":"dense_Dense2033","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2033","trainable":true},"inbound_nodes":[[["dense_Dense2032",0,0,{}]]]},{"name":"dense_Dense2034","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2034","trainable":true},"inbound_nodes":[[["dense_Dense2033",0,0,{}]]]}],"input_layers":[["input339",0,0]],"output_layers":[["dense_Dense2034",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2029/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2029/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2030/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2030/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2031/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2031/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2032/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2032/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2033/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense2033/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2034/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2034/bias","shape":[1],"dtype":"float32"}]}]}