{"modelTopology":{"class_name":"Model","config":{"name":"model718","layers":[{"name":"input718","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input718"},"inbound_nodes":[]},{"name":"dense_Dense4303","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4303","trainable":true},"inbound_nodes":[[["input718",0,0,{}]]]},{"name":"dense_Dense4304","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4304","trainable":true},"inbound_nodes":[[["dense_Dense4303",0,0,{}]]]},{"name":"dense_Dense4305","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4305","trainable":true},"inbound_nodes":[[["dense_Dense4304",0,0,{}]]]},{"name":"dense_Dense4306","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4306","trainable":true},"inbound_nodes":[[["dense_Dense4305",0,0,{}]]]},{"name":"dense_Dense4307","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4307","trainable":true},"inbound_nodes":[[["dense_Dense4306",0,0,{}]]]},{"name":"dense_Dense4308","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4308","trainable":true},"inbound_nodes":[[["dense_Dense4307",0,0,{}]]]}],"input_layers":[["input718",0,0]],"output_layers":[["dense_Dense4308",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4303/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense4303/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4304/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4304/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4305/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense4305/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4306/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense4306/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4307/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4307/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4308/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4308/bias","shape":[1],"dtype":"float32"}]}]}