{"modelTopology":{"class_name":"Model","config":{"name":"model242","layers":[{"name":"input242","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input242"},"inbound_nodes":[]},{"name":"dense_Dense1206","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1206","trainable":true},"inbound_nodes":[[["input242",0,0,{}]]]},{"name":"dense_Dense1207","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1207","trainable":true},"inbound_nodes":[[["dense_Dense1206",0,0,{}]]]},{"name":"dense_Dense1208","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1208","trainable":true},"inbound_nodes":[[["dense_Dense1207",0,0,{}]]]},{"name":"dense_Dense1209","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1209","trainable":true},"inbound_nodes":[[["dense_Dense1208",0,0,{}]]]},{"name":"dense_Dense1210","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1210","trainable":true},"inbound_nodes":[[["dense_Dense1209",0,0,{}]]]}],"input_layers":[["input242",0,0]],"output_layers":[["dense_Dense1210",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1206/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1206/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1207/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1207/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1208/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1208/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1209/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense1209/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1210/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1210/bias","shape":[1],"dtype":"float32"}]}]}