{"modelTopology":{"class_name":"Model","config":{"name":"model82","layers":[{"name":"input82","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input82"},"inbound_nodes":[]},{"name":"dense_Dense487","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense487","trainable":true},"inbound_nodes":[[["input82",0,0,{}]]]},{"name":"dense_Dense488","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense488","trainable":true},"inbound_nodes":[[["dense_Dense487",0,0,{}]]]},{"name":"dense_Dense489","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense489","trainable":true},"inbound_nodes":[[["dense_Dense488",0,0,{}]]]},{"name":"dense_Dense490","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense490","trainable":true},"inbound_nodes":[[["dense_Dense489",0,0,{}]]]},{"name":"dense_Dense491","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense491","trainable":true},"inbound_nodes":[[["dense_Dense490",0,0,{}]]]},{"name":"dense_Dense492","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense492","trainable":true},"inbound_nodes":[[["dense_Dense491",0,0,{}]]]}],"input_layers":[["input82",0,0]],"output_layers":[["dense_Dense492",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense487/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense487/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense488/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense488/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense489/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense489/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense490/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense490/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense491/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense491/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense492/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense492/bias","shape":[1],"dtype":"float32"}]}]}