{"modelTopology":{"class_name":"Model","config":{"name":"model1234","layers":[{"name":"input1234","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1234"},"inbound_nodes":[]},{"name":"dense_Dense7399","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7399","trainable":true},"inbound_nodes":[[["input1234",0,0,{}]]]},{"name":"dense_Dense7400","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7400","trainable":true},"inbound_nodes":[[["dense_Dense7399",0,0,{}]]]},{"name":"dense_Dense7401","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7401","trainable":true},"inbound_nodes":[[["dense_Dense7400",0,0,{}]]]},{"name":"dense_Dense7402","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7402","trainable":true},"inbound_nodes":[[["dense_Dense7401",0,0,{}]]]},{"name":"dense_Dense7403","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7403","trainable":true},"inbound_nodes":[[["dense_Dense7402",0,0,{}]]]},{"name":"dense_Dense7404","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7404","trainable":true},"inbound_nodes":[[["dense_Dense7403",0,0,{}]]]}],"input_layers":[["input1234",0,0]],"output_layers":[["dense_Dense7404",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7399/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense7399/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7400/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7400/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7401/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense7401/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7402/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense7402/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7403/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense7403/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7404/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7404/bias","shape":[1],"dtype":"float32"}]}]}