{"modelTopology":{"class_name":"Model","config":{"name":"model1213","layers":[{"name":"input1213","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1213"},"inbound_nodes":[]},{"name":"dense_Dense6061","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6061","trainable":true},"inbound_nodes":[[["input1213",0,0,{}]]]},{"name":"dense_Dense6062","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6062","trainable":true},"inbound_nodes":[[["dense_Dense6061",0,0,{}]]]},{"name":"dense_Dense6063","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6063","trainable":true},"inbound_nodes":[[["dense_Dense6062",0,0,{}]]]},{"name":"dense_Dense6064","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6064","trainable":true},"inbound_nodes":[[["dense_Dense6063",0,0,{}]]]},{"name":"dense_Dense6065","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6065","trainable":true},"inbound_nodes":[[["dense_Dense6064",0,0,{}]]]}],"input_layers":[["input1213",0,0]],"output_layers":[["dense_Dense6065",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6061/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6061/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6062/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense6062/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6063/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6063/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6064/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6064/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6065/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense6065/bias","shape":[1],"dtype":"float32"}]}]}