{"modelTopology":{"class_name":"Model","config":{"name":"model1048","layers":[{"name":"input1048","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1048"},"inbound_nodes":[]},{"name":"dense_Dense6283","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6283","trainable":true},"inbound_nodes":[[["input1048",0,0,{}]]]},{"name":"dense_Dense6284","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6284","trainable":true},"inbound_nodes":[[["dense_Dense6283",0,0,{}]]]},{"name":"dense_Dense6285","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6285","trainable":true},"inbound_nodes":[[["dense_Dense6284",0,0,{}]]]},{"name":"dense_Dense6286","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6286","trainable":true},"inbound_nodes":[[["dense_Dense6285",0,0,{}]]]},{"name":"dense_Dense6287","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6287","trainable":true},"inbound_nodes":[[["dense_Dense6286",0,0,{}]]]},{"name":"dense_Dense6288","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6288","trainable":true},"inbound_nodes":[[["dense_Dense6287",0,0,{}]]]}],"input_layers":[["input1048",0,0]],"output_layers":[["dense_Dense6288",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6283/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6283/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6284/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense6284/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6285/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6285/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6286/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6286/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6287/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense6287/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6288/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense6288/bias","shape":[1],"dtype":"float32"}]}]}