{"modelTopology":{"class_name":"Model","config":{"name":"model1123","layers":[{"name":"input1123","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1123"},"inbound_nodes":[]},{"name":"dense_Dense6733","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6733","trainable":true},"inbound_nodes":[[["input1123",0,0,{}]]]},{"name":"dense_Dense6734","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6734","trainable":true},"inbound_nodes":[[["dense_Dense6733",0,0,{}]]]},{"name":"dense_Dense6735","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6735","trainable":true},"inbound_nodes":[[["dense_Dense6734",0,0,{}]]]},{"name":"dense_Dense6736","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6736","trainable":true},"inbound_nodes":[[["dense_Dense6735",0,0,{}]]]},{"name":"dense_Dense6737","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6737","trainable":true},"inbound_nodes":[[["dense_Dense6736",0,0,{}]]]},{"name":"dense_Dense6738","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6738","trainable":true},"inbound_nodes":[[["dense_Dense6737",0,0,{}]]]}],"input_layers":[["input1123",0,0]],"output_layers":[["dense_Dense6738",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6733/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6733/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6734/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense6734/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6735/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense6735/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6736/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense6736/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6737/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6737/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6738/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense6738/bias","shape":[1],"dtype":"float32"}]}]}