{"modelTopology":{"class_name":"Model","config":{"name":"model823","layers":[{"name":"input823","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input823"},"inbound_nodes":[]},{"name":"dense_Dense4933","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4933","trainable":true},"inbound_nodes":[[["input823",0,0,{}]]]},{"name":"dense_Dense4934","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4934","trainable":true},"inbound_nodes":[[["dense_Dense4933",0,0,{}]]]},{"name":"dense_Dense4935","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4935","trainable":true},"inbound_nodes":[[["dense_Dense4934",0,0,{}]]]},{"name":"dense_Dense4936","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4936","trainable":true},"inbound_nodes":[[["dense_Dense4935",0,0,{}]]]},{"name":"dense_Dense4937","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4937","trainable":true},"inbound_nodes":[[["dense_Dense4936",0,0,{}]]]},{"name":"dense_Dense4938","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4938","trainable":true},"inbound_nodes":[[["dense_Dense4937",0,0,{}]]]}],"input_layers":[["input823",0,0]],"output_layers":[["dense_Dense4938",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4933/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense4933/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4934/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense4934/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4935/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4935/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4936/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense4936/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4937/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4937/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4938/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense4938/bias","shape":[1],"dtype":"float32"}]}]}