{"modelTopology":{"class_name":"Model","config":{"name":"model66","layers":[{"name":"input66","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input66"},"inbound_nodes":[]},{"name":"dense_Dense261","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense261","trainable":true},"inbound_nodes":[[["input66",0,0,{}]]]},{"name":"dense_Dense262","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense262","trainable":true},"inbound_nodes":[[["dense_Dense261",0,0,{}]]]},{"name":"dense_Dense263","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense263","trainable":true},"inbound_nodes":[[["dense_Dense262",0,0,{}]]]},{"name":"dense_Dense264","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense264","trainable":true},"inbound_nodes":[[["dense_Dense263",0,0,{}]]]}],"input_layers":[["input66",0,0]],"output_layers":[["dense_Dense264",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense261/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense261/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense262/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense262/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense263/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense263/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense264/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense264/bias","shape":[1],"dtype":"float32"}]}]}