{"modelTopology":{"class_name":"Model","config":{"name":"model1017","layers":[{"name":"input1017","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1017"},"inbound_nodes":[]},{"name":"dense_Dense6097","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6097","trainable":true},"inbound_nodes":[[["input1017",0,0,{}]]]},{"name":"dense_Dense6098","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6098","trainable":true},"inbound_nodes":[[["dense_Dense6097",0,0,{}]]]},{"name":"dense_Dense6099","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6099","trainable":true},"inbound_nodes":[[["dense_Dense6098",0,0,{}]]]},{"name":"dense_Dense6100","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6100","trainable":true},"inbound_nodes":[[["dense_Dense6099",0,0,{}]]]},{"name":"dense_Dense6101","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6101","trainable":true},"inbound_nodes":[[["dense_Dense6100",0,0,{}]]]},{"name":"dense_Dense6102","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6102","trainable":true},"inbound_nodes":[[["dense_Dense6101",0,0,{}]]]}],"input_layers":[["input1017",0,0]],"output_layers":[["dense_Dense6102",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6097/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6097/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6098/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6098/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6099/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6099/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6100/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense6100/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6101/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense6101/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense6102/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense6102/bias","shape":[1],"dtype":"float32"}]}]}