{"modelTopology":{"class_name":"Model","config":{"name":"model657","layers":[{"name":"input657","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input657"},"inbound_nodes":[]},{"name":"dense_Dense3937","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3937","trainable":true},"inbound_nodes":[[["input657",0,0,{}]]]},{"name":"dense_Dense3938","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3938","trainable":true},"inbound_nodes":[[["dense_Dense3937",0,0,{}]]]},{"name":"dense_Dense3939","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3939","trainable":true},"inbound_nodes":[[["dense_Dense3938",0,0,{}]]]},{"name":"dense_Dense3940","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3940","trainable":true},"inbound_nodes":[[["dense_Dense3939",0,0,{}]]]},{"name":"dense_Dense3941","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3941","trainable":true},"inbound_nodes":[[["dense_Dense3940",0,0,{}]]]},{"name":"dense_Dense3942","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3942","trainable":true},"inbound_nodes":[[["dense_Dense3941",0,0,{}]]]}],"input_layers":[["input657",0,0]],"output_layers":[["dense_Dense3942",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3937/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3937/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3938/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense3938/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3939/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense3939/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3940/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense3940/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3941/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense3941/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3942/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3942/bias","shape":[1],"dtype":"float32"}]}]}