{"modelTopology":{"class_name":"Model","config":{"name":"model1286","layers":[{"name":"input1286","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1286"},"inbound_nodes":[]},{"name":"dense_Dense6426","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6426","trainable":true},"inbound_nodes":[[["input1286",0,0,{}]]]},{"name":"dense_Dense6427","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6427","trainable":true},"inbound_nodes":[[["dense_Dense6426",0,0,{}]]]},{"name":"dense_Dense6428","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6428","trainable":true},"inbound_nodes":[[["dense_Dense6427",0,0,{}]]]},{"name":"dense_Dense6429","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6429","trainable":true},"inbound_nodes":[[["dense_Dense6428",0,0,{}]]]},{"name":"dense_Dense6430","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6430","trainable":true},"inbound_nodes":[[["dense_Dense6429",0,0,{}]]]}],"input_layers":[["input1286",0,0]],"output_layers":[["dense_Dense6430",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6426/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense6426/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6427/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense6427/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6428/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense6428/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6429/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense6429/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6430/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6430/bias","shape":[1],"dtype":"float32"}]}]}