{"modelTopology":{"class_name":"Model","config":{"name":"model342","layers":[{"name":"input342","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input342"},"inbound_nodes":[]},{"name":"dense_Dense2047","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2047","trainable":true},"inbound_nodes":[[["input342",0,0,{}]]]},{"name":"dense_Dense2048","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2048","trainable":true},"inbound_nodes":[[["dense_Dense2047",0,0,{}]]]},{"name":"dense_Dense2049","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2049","trainable":true},"inbound_nodes":[[["dense_Dense2048",0,0,{}]]]},{"name":"dense_Dense2050","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2050","trainable":true},"inbound_nodes":[[["dense_Dense2049",0,0,{}]]]},{"name":"dense_Dense2051","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2051","trainable":true},"inbound_nodes":[[["dense_Dense2050",0,0,{}]]]},{"name":"dense_Dense2052","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2052","trainable":true},"inbound_nodes":[[["dense_Dense2051",0,0,{}]]]}],"input_layers":[["input342",0,0]],"output_layers":[["dense_Dense2052",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2047/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense2047/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2048/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense2048/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2049/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2049/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2050/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense2050/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2051/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense2051/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2052/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2052/bias","shape":[1],"dtype":"float32"}]}]}