{"modelTopology":{"class_name":"Model","config":{"name":"model87","layers":[{"name":"input87","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input87"},"inbound_nodes":[]},{"name":"dense_Dense345","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense345","trainable":true},"inbound_nodes":[[["input87",0,0,{}]]]},{"name":"dense_Dense346","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense346","trainable":true},"inbound_nodes":[[["dense_Dense345",0,0,{}]]]},{"name":"dense_Dense347","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense347","trainable":true},"inbound_nodes":[[["dense_Dense346",0,0,{}]]]},{"name":"dense_Dense348","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense348","trainable":true},"inbound_nodes":[[["dense_Dense347",0,0,{}]]]}],"input_layers":[["input87",0,0]],"output_layers":[["dense_Dense348",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense345/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense345/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense346/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense346/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense347/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense347/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense348/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense348/bias","shape":[1],"dtype":"float32"}]}]}