{"modelTopology":{"class_name":"Model","config":{"name":"model1275","layers":[{"name":"input1275","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1275"},"inbound_nodes":[]},{"name":"dense_Dense7645","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7645","trainable":true},"inbound_nodes":[[["input1275",0,0,{}]]]},{"name":"dense_Dense7646","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7646","trainable":true},"inbound_nodes":[[["dense_Dense7645",0,0,{}]]]},{"name":"dense_Dense7647","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7647","trainable":true},"inbound_nodes":[[["dense_Dense7646",0,0,{}]]]},{"name":"dense_Dense7648","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7648","trainable":true},"inbound_nodes":[[["dense_Dense7647",0,0,{}]]]},{"name":"dense_Dense7649","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7649","trainable":true},"inbound_nodes":[[["dense_Dense7648",0,0,{}]]]},{"name":"dense_Dense7650","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7650","trainable":true},"inbound_nodes":[[["dense_Dense7649",0,0,{}]]]}],"input_layers":[["input1275",0,0]],"output_layers":[["dense_Dense7650",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7645/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense7645/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7646/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense7646/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7647/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense7647/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7648/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense7648/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7649/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense7649/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7650/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense7650/bias","shape":[1],"dtype":"float32"}]}]}