{"modelTopology":{"class_name":"Model","config":{"name":"model795","layers":[{"name":"input795","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input795"},"inbound_nodes":[]},{"name":"dense_Dense3971","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3971","trainable":true},"inbound_nodes":[[["input795",0,0,{}]]]},{"name":"dense_Dense3972","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3972","trainable":true},"inbound_nodes":[[["dense_Dense3971",0,0,{}]]]},{"name":"dense_Dense3973","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3973","trainable":true},"inbound_nodes":[[["dense_Dense3972",0,0,{}]]]},{"name":"dense_Dense3974","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3974","trainable":true},"inbound_nodes":[[["dense_Dense3973",0,0,{}]]]},{"name":"dense_Dense3975","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3975","trainable":true},"inbound_nodes":[[["dense_Dense3974",0,0,{}]]]}],"input_layers":[["input795",0,0]],"output_layers":[["dense_Dense3975",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3971/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3971/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3972/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense3972/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3973/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense3973/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3974/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3974/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3975/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3975/bias","shape":[1],"dtype":"float32"}]}]}