{"modelTopology":{"class_name":"Model","config":{"name":"model1181","layers":[{"name":"input1181","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1181"},"inbound_nodes":[]},{"name":"dense_Dense7081","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7081","trainable":true},"inbound_nodes":[[["input1181",0,0,{}]]]},{"name":"dense_Dense7082","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7082","trainable":true},"inbound_nodes":[[["dense_Dense7081",0,0,{}]]]},{"name":"dense_Dense7083","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7083","trainable":true},"inbound_nodes":[[["dense_Dense7082",0,0,{}]]]},{"name":"dense_Dense7084","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7084","trainable":true},"inbound_nodes":[[["dense_Dense7083",0,0,{}]]]},{"name":"dense_Dense7085","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7085","trainable":true},"inbound_nodes":[[["dense_Dense7084",0,0,{}]]]},{"name":"dense_Dense7086","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7086","trainable":true},"inbound_nodes":[[["dense_Dense7085",0,0,{}]]]}],"input_layers":[["input1181",0,0]],"output_layers":[["dense_Dense7086",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7081/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense7081/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7082/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense7082/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7083/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense7083/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7084/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense7084/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7085/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense7085/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7086/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7086/bias","shape":[1],"dtype":"float32"}]}]}