{"modelTopology":{"class_name":"Model","config":{"name":"model223","layers":[{"name":"input223","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input223"},"inbound_nodes":[]},{"name":"dense_Dense1333","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1333","trainable":true},"inbound_nodes":[[["input223",0,0,{}]]]},{"name":"dense_Dense1334","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1334","trainable":true},"inbound_nodes":[[["dense_Dense1333",0,0,{}]]]},{"name":"dense_Dense1335","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1335","trainable":true},"inbound_nodes":[[["dense_Dense1334",0,0,{}]]]},{"name":"dense_Dense1336","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1336","trainable":true},"inbound_nodes":[[["dense_Dense1335",0,0,{}]]]},{"name":"dense_Dense1337","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1337","trainable":true},"inbound_nodes":[[["dense_Dense1336",0,0,{}]]]},{"name":"dense_Dense1338","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1338","trainable":true},"inbound_nodes":[[["dense_Dense1337",0,0,{}]]]}],"input_layers":[["input223",0,0]],"output_layers":[["dense_Dense1338",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1333/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense1333/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1334/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense1334/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1335/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1335/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1336/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense1336/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1337/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1337/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1338/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense1338/bias","shape":[1],"dtype":"float32"}]}]}