{"modelTopology":{"class_name":"Model","config":{"name":"model1001","layers":[{"name":"input1001","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1001"},"inbound_nodes":[]},{"name":"dense_Dense6001","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6001","trainable":true},"inbound_nodes":[[["input1001",0,0,{}]]]},{"name":"dense_Dense6002","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6002","trainable":true},"inbound_nodes":[[["dense_Dense6001",0,0,{}]]]},{"name":"dense_Dense6003","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6003","trainable":true},"inbound_nodes":[[["dense_Dense6002",0,0,{}]]]},{"name":"dense_Dense6004","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6004","trainable":true},"inbound_nodes":[[["dense_Dense6003",0,0,{}]]]},{"name":"dense_Dense6005","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6005","trainable":true},"inbound_nodes":[[["dense_Dense6004",0,0,{}]]]},{"name":"dense_Dense6006","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6006","trainable":true},"inbound_nodes":[[["dense_Dense6005",0,0,{}]]]}],"input_layers":[["input1001",0,0]],"output_layers":[["dense_Dense6006",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6001/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense6001/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6002/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense6002/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6003/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6003/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6004/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6004/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6005/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6005/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6006/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6006/bias","shape":[1],"dtype":"float32"}]}]}