{"modelTopology":{"class_name":"Model","config":{"name":"model687","layers":[{"name":"input687","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input687"},"inbound_nodes":[]},{"name":"dense_Dense4117","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4117","trainable":true},"inbound_nodes":[[["input687",0,0,{}]]]},{"name":"dense_Dense4118","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4118","trainable":true},"inbound_nodes":[[["dense_Dense4117",0,0,{}]]]},{"name":"dense_Dense4119","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4119","trainable":true},"inbound_nodes":[[["dense_Dense4118",0,0,{}]]]},{"name":"dense_Dense4120","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4120","trainable":true},"inbound_nodes":[[["dense_Dense4119",0,0,{}]]]},{"name":"dense_Dense4121","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4121","trainable":true},"inbound_nodes":[[["dense_Dense4120",0,0,{}]]]},{"name":"dense_Dense4122","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4122","trainable":true},"inbound_nodes":[[["dense_Dense4121",0,0,{}]]]}],"input_layers":[["input687",0,0]],"output_layers":[["dense_Dense4122",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4117/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense4117/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4118/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense4118/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4119/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense4119/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4120/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4120/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4121/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense4121/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4122/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4122/bias","shape":[1],"dtype":"float32"}]}]}