{"modelTopology":{"class_name":"Model","config":{"name":"model1060","layers":[{"name":"input1060","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1060"},"inbound_nodes":[]},{"name":"dense_Dense5296","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5296","trainable":true},"inbound_nodes":[[["input1060",0,0,{}]]]},{"name":"dense_Dense5297","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5297","trainable":true},"inbound_nodes":[[["dense_Dense5296",0,0,{}]]]},{"name":"dense_Dense5298","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5298","trainable":true},"inbound_nodes":[[["dense_Dense5297",0,0,{}]]]},{"name":"dense_Dense5299","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5299","trainable":true},"inbound_nodes":[[["dense_Dense5298",0,0,{}]]]},{"name":"dense_Dense5300","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5300","trainable":true},"inbound_nodes":[[["dense_Dense5299",0,0,{}]]]}],"input_layers":[["input1060",0,0]],"output_layers":[["dense_Dense5300",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5296/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense5296/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5297/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense5297/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5298/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense5298/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense5299/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense5299/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5300/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5300/bias","shape":[1],"dtype":"float32"}]}]}