{"modelTopology":{"class_name":"Model","config":{"name":"model1191","layers":[{"name":"input1191","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1191"},"inbound_nodes":[]},{"name":"dense_Dense7141","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7141","trainable":true},"inbound_nodes":[[["input1191",0,0,{}]]]},{"name":"dense_Dense7142","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7142","trainable":true},"inbound_nodes":[[["dense_Dense7141",0,0,{}]]]},{"name":"dense_Dense7143","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7143","trainable":true},"inbound_nodes":[[["dense_Dense7142",0,0,{}]]]},{"name":"dense_Dense7144","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7144","trainable":true},"inbound_nodes":[[["dense_Dense7143",0,0,{}]]]},{"name":"dense_Dense7145","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7145","trainable":true},"inbound_nodes":[[["dense_Dense7144",0,0,{}]]]},{"name":"dense_Dense7146","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7146","trainable":true},"inbound_nodes":[[["dense_Dense7145",0,0,{}]]]}],"input_layers":[["input1191",0,0]],"output_layers":[["dense_Dense7146",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7141/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense7141/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7142/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense7142/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7143/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7143/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7144/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense7144/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7145/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense7145/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense7146/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense7146/bias","shape":[1],"dtype":"float32"}]}]}