{"modelTopology":{"class_name":"Model","config":{"name":"model182","layers":[{"name":"input182","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input182"},"inbound_nodes":[]},{"name":"dense_Dense1087","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1087","trainable":true},"inbound_nodes":[[["input182",0,0,{}]]]},{"name":"dense_Dense1088","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1088","trainable":true},"inbound_nodes":[[["dense_Dense1087",0,0,{}]]]},{"name":"dense_Dense1089","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1089","trainable":true},"inbound_nodes":[[["dense_Dense1088",0,0,{}]]]},{"name":"dense_Dense1090","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1090","trainable":true},"inbound_nodes":[[["dense_Dense1089",0,0,{}]]]},{"name":"dense_Dense1091","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1091","trainable":true},"inbound_nodes":[[["dense_Dense1090",0,0,{}]]]},{"name":"dense_Dense1092","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1092","trainable":true},"inbound_nodes":[[["dense_Dense1091",0,0,{}]]]}],"input_layers":[["input182",0,0]],"output_layers":[["dense_Dense1092",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1087/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense1087/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1088/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense1088/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1089/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense1089/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1090/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense1090/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1091/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense1091/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1092/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1092/bias","shape":[1],"dtype":"float32"}]}]}