{"modelTopology":{"class_name":"Model","config":{"name":"model332","layers":[{"name":"input332","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input332"},"inbound_nodes":[]},{"name":"dense_Dense1987","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1987","trainable":true},"inbound_nodes":[[["input332",0,0,{}]]]},{"name":"dense_Dense1988","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1988","trainable":true},"inbound_nodes":[[["dense_Dense1987",0,0,{}]]]},{"name":"dense_Dense1989","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1989","trainable":true},"inbound_nodes":[[["dense_Dense1988",0,0,{}]]]},{"name":"dense_Dense1990","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1990","trainable":true},"inbound_nodes":[[["dense_Dense1989",0,0,{}]]]},{"name":"dense_Dense1991","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1991","trainable":true},"inbound_nodes":[[["dense_Dense1990",0,0,{}]]]},{"name":"dense_Dense1992","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1992","trainable":true},"inbound_nodes":[[["dense_Dense1991",0,0,{}]]]}],"input_layers":[["input332",0,0]],"output_layers":[["dense_Dense1992",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1987/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense1987/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1988/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1988/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1989/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense1989/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1990/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1990/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1991/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1991/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1992/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1992/bias","shape":[1],"dtype":"float32"}]}]}