{"modelTopology":{"class_name":"Model","config":{"name":"model982","layers":[{"name":"input982","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input982"},"inbound_nodes":[]},{"name":"dense_Dense5887","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5887","trainable":true},"inbound_nodes":[[["input982",0,0,{}]]]},{"name":"dense_Dense5888","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5888","trainable":true},"inbound_nodes":[[["dense_Dense5887",0,0,{}]]]},{"name":"dense_Dense5889","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5889","trainable":true},"inbound_nodes":[[["dense_Dense5888",0,0,{}]]]},{"name":"dense_Dense5890","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5890","trainable":true},"inbound_nodes":[[["dense_Dense5889",0,0,{}]]]},{"name":"dense_Dense5891","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5891","trainable":true},"inbound_nodes":[[["dense_Dense5890",0,0,{}]]]},{"name":"dense_Dense5892","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5892","trainable":true},"inbound_nodes":[[["dense_Dense5891",0,0,{}]]]}],"input_layers":[["input982",0,0]],"output_layers":[["dense_Dense5892",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5887/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense5887/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5888/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense5888/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5889/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense5889/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5890/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense5890/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense5891/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense5891/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense5892/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense5892/bias","shape":[1],"dtype":"float32"}]}]}