{"modelTopology":{"class_name":"Model","config":{"name":"model43","layers":[{"name":"input43","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input43"},"inbound_nodes":[]},{"name":"dense_Dense211","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense211","trainable":true},"inbound_nodes":[[["input43",0,0,{}]]]},{"name":"dense_Dense212","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense212","trainable":true},"inbound_nodes":[[["dense_Dense211",0,0,{}]]]},{"name":"dense_Dense213","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense213","trainable":true},"inbound_nodes":[[["dense_Dense212",0,0,{}]]]},{"name":"dense_Dense214","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense214","trainable":true},"inbound_nodes":[[["dense_Dense213",0,0,{}]]]},{"name":"dense_Dense215","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense215","trainable":true},"inbound_nodes":[[["dense_Dense214",0,0,{}]]]}],"input_layers":[["input43",0,0]],"output_layers":[["dense_Dense215",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense211/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense211/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense212/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense212/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense213/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense213/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense214/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense214/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense215/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense215/bias","shape":[1],"dtype":"float32"}]}]}