{"modelTopology":{"class_name":"Model","config":{"name":"model785","layers":[{"name":"input785","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input785"},"inbound_nodes":[]},{"name":"dense_Dense4705","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4705","trainable":true},"inbound_nodes":[[["input785",0,0,{}]]]},{"name":"dense_Dense4706","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4706","trainable":true},"inbound_nodes":[[["dense_Dense4705",0,0,{}]]]},{"name":"dense_Dense4707","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4707","trainable":true},"inbound_nodes":[[["dense_Dense4706",0,0,{}]]]},{"name":"dense_Dense4708","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4708","trainable":true},"inbound_nodes":[[["dense_Dense4707",0,0,{}]]]},{"name":"dense_Dense4709","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4709","trainable":true},"inbound_nodes":[[["dense_Dense4708",0,0,{}]]]},{"name":"dense_Dense4710","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4710","trainable":true},"inbound_nodes":[[["dense_Dense4709",0,0,{}]]]}],"input_layers":[["input785",0,0]],"output_layers":[["dense_Dense4710",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4705/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4705/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4706/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4706/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4707/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4707/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4708/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4708/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4709/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense4709/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4710/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense4710/bias","shape":[1],"dtype":"float32"}]}]}