{"modelTopology":{"class_name":"Model","config":{"name":"model291","layers":[{"name":"input291","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input291"},"inbound_nodes":[]},{"name":"dense_Dense1741","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1741","trainable":true},"inbound_nodes":[[["input291",0,0,{}]]]},{"name":"dense_Dense1742","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1742","trainable":true},"inbound_nodes":[[["dense_Dense1741",0,0,{}]]]},{"name":"dense_Dense1743","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1743","trainable":true},"inbound_nodes":[[["dense_Dense1742",0,0,{}]]]},{"name":"dense_Dense1744","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1744","trainable":true},"inbound_nodes":[[["dense_Dense1743",0,0,{}]]]},{"name":"dense_Dense1745","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1745","trainable":true},"inbound_nodes":[[["dense_Dense1744",0,0,{}]]]},{"name":"dense_Dense1746","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1746","trainable":true},"inbound_nodes":[[["dense_Dense1745",0,0,{}]]]}],"input_layers":[["input291",0,0]],"output_layers":[["dense_Dense1746",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1741/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense1741/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1742/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1742/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1743/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense1743/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1744/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1744/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1745/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense1745/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1746/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1746/bias","shape":[1],"dtype":"float32"}]}]}