{"modelTopology":{"class_name":"Model","config":{"name":"model64","layers":[{"name":"input64","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input64"},"inbound_nodes":[]},{"name":"dense_Dense316","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense316","trainable":true},"inbound_nodes":[[["input64",0,0,{}]]]},{"name":"dense_Dense317","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense317","trainable":true},"inbound_nodes":[[["dense_Dense316",0,0,{}]]]},{"name":"dense_Dense318","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense318","trainable":true},"inbound_nodes":[[["dense_Dense317",0,0,{}]]]},{"name":"dense_Dense319","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense319","trainable":true},"inbound_nodes":[[["dense_Dense318",0,0,{}]]]},{"name":"dense_Dense320","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense320","trainable":true},"inbound_nodes":[[["dense_Dense319",0,0,{}]]]}],"input_layers":[["input64",0,0]],"output_layers":[["dense_Dense320",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense316/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense316/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense317/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense317/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense318/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense318/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense319/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense319/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense320/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense320/bias","shape":[1],"dtype":"float32"}]}]}