{"modelTopology":{"class_name":"Model","config":{"name":"model401","layers":[{"name":"input401","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input401"},"inbound_nodes":[]},{"name":"dense_Dense2001","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2001","trainable":true},"inbound_nodes":[[["input401",0,0,{}]]]},{"name":"dense_Dense2002","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2002","trainable":true},"inbound_nodes":[[["dense_Dense2001",0,0,{}]]]},{"name":"dense_Dense2003","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2003","trainable":true},"inbound_nodes":[[["dense_Dense2002",0,0,{}]]]},{"name":"dense_Dense2004","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2004","trainable":true},"inbound_nodes":[[["dense_Dense2003",0,0,{}]]]},{"name":"dense_Dense2005","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2005","trainable":true},"inbound_nodes":[[["dense_Dense2004",0,0,{}]]]}],"input_layers":[["input401",0,0]],"output_layers":[["dense_Dense2005",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2001/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2001/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2002/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2002/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2003/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2003/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2004/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense2004/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2005/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2005/bias","shape":[1],"dtype":"float32"}]}]}