{"modelTopology":{"class_name":"Model","config":{"name":"model1010","layers":[{"name":"input1010","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1010"},"inbound_nodes":[]},{"name":"dense_Dense6055","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6055","trainable":true},"inbound_nodes":[[["input1010",0,0,{}]]]},{"name":"dense_Dense6056","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6056","trainable":true},"inbound_nodes":[[["dense_Dense6055",0,0,{}]]]},{"name":"dense_Dense6057","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6057","trainable":true},"inbound_nodes":[[["dense_Dense6056",0,0,{}]]]},{"name":"dense_Dense6058","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6058","trainable":true},"inbound_nodes":[[["dense_Dense6057",0,0,{}]]]},{"name":"dense_Dense6059","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6059","trainable":true},"inbound_nodes":[[["dense_Dense6058",0,0,{}]]]},{"name":"dense_Dense6060","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6060","trainable":true},"inbound_nodes":[[["dense_Dense6059",0,0,{}]]]}],"input_layers":[["input1010",0,0]],"output_layers":[["dense_Dense6060",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6055/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense6055/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6056/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6056/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6057/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6057/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6058/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6058/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6059/kernel","shape":[1,2],"dtype":"float32"},{"name":"dense_Dense6059/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6060/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6060/bias","shape":[1],"dtype":"float32"}]}]}