{"modelTopology":{"class_name":"Model","config":{"name":"model1004","layers":[{"name":"input1004","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1004"},"inbound_nodes":[]},{"name":"dense_Dense6019","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6019","trainable":true},"inbound_nodes":[[["input1004",0,0,{}]]]},{"name":"dense_Dense6020","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6020","trainable":true},"inbound_nodes":[[["dense_Dense6019",0,0,{}]]]},{"name":"dense_Dense6021","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6021","trainable":true},"inbound_nodes":[[["dense_Dense6020",0,0,{}]]]},{"name":"dense_Dense6022","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6022","trainable":true},"inbound_nodes":[[["dense_Dense6021",0,0,{}]]]},{"name":"dense_Dense6023","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6023","trainable":true},"inbound_nodes":[[["dense_Dense6022",0,0,{}]]]},{"name":"dense_Dense6024","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6024","trainable":true},"inbound_nodes":[[["dense_Dense6023",0,0,{}]]]}],"input_layers":[["input1004",0,0]],"output_layers":[["dense_Dense6024",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6019/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense6019/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6020/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6020/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6021/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense6021/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6022/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6022/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6023/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense6023/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense6024/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense6024/bias","shape":[1],"dtype":"float32"}]}]}