{"modelTopology":{"class_name":"Model","config":{"name":"model492","layers":[{"name":"input492","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input492"},"inbound_nodes":[]},{"name":"dense_Dense2947","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2947","trainable":true},"inbound_nodes":[[["input492",0,0,{}]]]},{"name":"dense_Dense2948","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2948","trainable":true},"inbound_nodes":[[["dense_Dense2947",0,0,{}]]]},{"name":"dense_Dense2949","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2949","trainable":true},"inbound_nodes":[[["dense_Dense2948",0,0,{}]]]},{"name":"dense_Dense2950","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2950","trainable":true},"inbound_nodes":[[["dense_Dense2949",0,0,{}]]]},{"name":"dense_Dense2951","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2951","trainable":true},"inbound_nodes":[[["dense_Dense2950",0,0,{}]]]},{"name":"dense_Dense2952","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2952","trainable":true},"inbound_nodes":[[["dense_Dense2951",0,0,{}]]]}],"input_layers":[["input492",0,0]],"output_layers":[["dense_Dense2952",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2947/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense2947/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2948/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense2948/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2949/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2949/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2950/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2950/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2951/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense2951/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2952/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2952/bias","shape":[1],"dtype":"float32"}]}]}