{"modelTopology":{"class_name":"Model","config":{"name":"model47","layers":[{"name":"input47","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input47"},"inbound_nodes":[]},{"name":"dense_Dense185","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense185","trainable":true},"inbound_nodes":[[["input47",0,0,{}]]]},{"name":"dense_Dense186","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense186","trainable":true},"inbound_nodes":[[["dense_Dense185",0,0,{}]]]},{"name":"dense_Dense187","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense187","trainable":true},"inbound_nodes":[[["dense_Dense186",0,0,{}]]]},{"name":"dense_Dense188","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense188","trainable":true},"inbound_nodes":[[["dense_Dense187",0,0,{}]]]}],"input_layers":[["input47",0,0]],"output_layers":[["dense_Dense188",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense185/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense185/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense186/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense186/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense187/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense187/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense188/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense188/bias","shape":[1],"dtype":"float32"}]}]}