{"modelTopology":{"class_name":"Model","config":{"name":"model278","layers":[{"name":"input278","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input278"},"inbound_nodes":[]},{"name":"dense_Dense1386","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1386","trainable":true},"inbound_nodes":[[["input278",0,0,{}]]]},{"name":"dense_Dense1387","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1387","trainable":true},"inbound_nodes":[[["dense_Dense1386",0,0,{}]]]},{"name":"dense_Dense1388","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1388","trainable":true},"inbound_nodes":[[["dense_Dense1387",0,0,{}]]]},{"name":"dense_Dense1389","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1389","trainable":true},"inbound_nodes":[[["dense_Dense1388",0,0,{}]]]},{"name":"dense_Dense1390","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1390","trainable":true},"inbound_nodes":[[["dense_Dense1389",0,0,{}]]]}],"input_layers":[["input278",0,0]],"output_layers":[["dense_Dense1390",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1386/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense1386/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1387/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense1387/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1388/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense1388/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1389/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense1389/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1390/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1390/bias","shape":[1],"dtype":"float32"}]}]}