{"modelTopology":{"class_name":"Model","config":{"name":"model769","layers":[{"name":"input769","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input769"},"inbound_nodes":[]},{"name":"dense_Dense3841","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3841","trainable":true},"inbound_nodes":[[["input769",0,0,{}]]]},{"name":"dense_Dense3842","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3842","trainable":true},"inbound_nodes":[[["dense_Dense3841",0,0,{}]]]},{"name":"dense_Dense3843","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3843","trainable":true},"inbound_nodes":[[["dense_Dense3842",0,0,{}]]]},{"name":"dense_Dense3844","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3844","trainable":true},"inbound_nodes":[[["dense_Dense3843",0,0,{}]]]},{"name":"dense_Dense3845","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3845","trainable":true},"inbound_nodes":[[["dense_Dense3844",0,0,{}]]]}],"input_layers":[["input769",0,0]],"output_layers":[["dense_Dense3845",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3841/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3841/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3842/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense3842/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3843/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3843/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3844/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3844/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3845/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense3845/bias","shape":[1],"dtype":"float32"}]}]}