{"modelTopology":{"class_name":"Model","config":{"name":"model402","layers":[{"name":"input402","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input402"},"inbound_nodes":[]},{"name":"dense_Dense2407","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2407","trainable":true},"inbound_nodes":[[["input402",0,0,{}]]]},{"name":"dense_Dense2408","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2408","trainable":true},"inbound_nodes":[[["dense_Dense2407",0,0,{}]]]},{"name":"dense_Dense2409","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2409","trainable":true},"inbound_nodes":[[["dense_Dense2408",0,0,{}]]]},{"name":"dense_Dense2410","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2410","trainable":true},"inbound_nodes":[[["dense_Dense2409",0,0,{}]]]},{"name":"dense_Dense2411","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2411","trainable":true},"inbound_nodes":[[["dense_Dense2410",0,0,{}]]]},{"name":"dense_Dense2412","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2412","trainable":true},"inbound_nodes":[[["dense_Dense2411",0,0,{}]]]}],"input_layers":[["input402",0,0]],"output_layers":[["dense_Dense2412",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2407/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2407/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2408/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2408/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2409/kernel","shape":[2,32],"dtype":"float32"},{"name":"dense_Dense2409/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2410/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2410/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2411/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense2411/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2412/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense2412/bias","shape":[1],"dtype":"float32"}]}]}