{"modelTopology":{"class_name":"Model","config":{"name":"model243","layers":[{"name":"input243","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input243"},"inbound_nodes":[]},{"name":"dense_Dense1453","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1453","trainable":true},"inbound_nodes":[[["input243",0,0,{}]]]},{"name":"dense_Dense1454","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1454","trainable":true},"inbound_nodes":[[["dense_Dense1453",0,0,{}]]]},{"name":"dense_Dense1455","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1455","trainable":true},"inbound_nodes":[[["dense_Dense1454",0,0,{}]]]},{"name":"dense_Dense1456","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1456","trainable":true},"inbound_nodes":[[["dense_Dense1455",0,0,{}]]]},{"name":"dense_Dense1457","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1457","trainable":true},"inbound_nodes":[[["dense_Dense1456",0,0,{}]]]},{"name":"dense_Dense1458","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1458","trainable":true},"inbound_nodes":[[["dense_Dense1457",0,0,{}]]]}],"input_layers":[["input243",0,0]],"output_layers":[["dense_Dense1458",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1453/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense1453/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense1454/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense1454/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense1455/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense1455/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense1456/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense1456/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1457/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense1457/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense1458/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense1458/bias","shape":[1],"dtype":"float32"}]}]}