{"modelTopology":{"class_name":"Model","config":{"name":"model909","layers":[{"name":"input909","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input909"},"inbound_nodes":[]},{"name":"dense_Dense4541","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4541","trainable":true},"inbound_nodes":[[["input909",0,0,{}]]]},{"name":"dense_Dense4542","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4542","trainable":true},"inbound_nodes":[[["dense_Dense4541",0,0,{}]]]},{"name":"dense_Dense4543","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4543","trainable":true},"inbound_nodes":[[["dense_Dense4542",0,0,{}]]]},{"name":"dense_Dense4544","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4544","trainable":true},"inbound_nodes":[[["dense_Dense4543",0,0,{}]]]},{"name":"dense_Dense4545","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4545","trainable":true},"inbound_nodes":[[["dense_Dense4544",0,0,{}]]]}],"input_layers":[["input909",0,0]],"output_layers":[["dense_Dense4545",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4541/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense4541/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4542/kernel","shape":[16,2],"dtype":"float32"},{"name":"dense_Dense4542/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4543/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense4543/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4544/kernel","shape":[2,4],"dtype":"float32"},{"name":"dense_Dense4544/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense4545/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense4545/bias","shape":[1],"dtype":"float32"}]}]}