{"modelTopology":{"class_name":"Model","config":{"name":"model478","layers":[{"name":"input478","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input478"},"inbound_nodes":[]},{"name":"dense_Dense2386","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2386","trainable":true},"inbound_nodes":[[["input478",0,0,{}]]]},{"name":"dense_Dense2387","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2387","trainable":true},"inbound_nodes":[[["dense_Dense2386",0,0,{}]]]},{"name":"dense_Dense2388","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2388","trainable":true},"inbound_nodes":[[["dense_Dense2387",0,0,{}]]]},{"name":"dense_Dense2389","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2389","trainable":true},"inbound_nodes":[[["dense_Dense2388",0,0,{}]]]},{"name":"dense_Dense2390","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2390","trainable":true},"inbound_nodes":[[["dense_Dense2389",0,0,{}]]]}],"input_layers":[["input478",0,0]],"output_layers":[["dense_Dense2390",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2386/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2386/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2387/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2387/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2388/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense2388/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2389/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense2389/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2390/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2390/bias","shape":[1],"dtype":"float32"}]}]}