{"modelTopology":{"class_name":"Model","config":{"name":"model137","layers":[{"name":"input137","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input137"},"inbound_nodes":[]},{"name":"dense_Dense545","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense545","trainable":true},"inbound_nodes":[[["input137",0,0,{}]]]},{"name":"dense_Dense546","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense546","trainable":true},"inbound_nodes":[[["dense_Dense545",0,0,{}]]]},{"name":"dense_Dense547","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense547","trainable":true},"inbound_nodes":[[["dense_Dense546",0,0,{}]]]},{"name":"dense_Dense548","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense548","trainable":true},"inbound_nodes":[[["dense_Dense547",0,0,{}]]]}],"input_layers":[["input137",0,0]],"output_layers":[["dense_Dense548",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense545/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense545/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense546/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense546/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense547/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense547/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense548/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense548/bias","shape":[1],"dtype":"float32"}]}]}