{"modelTopology":{"class_name":"Model","config":{"name":"model1104","layers":[{"name":"input1104","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1104"},"inbound_nodes":[]},{"name":"dense_Dense6619","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6619","trainable":true},"inbound_nodes":[[["input1104",0,0,{}]]]},{"name":"dense_Dense6620","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6620","trainable":true},"inbound_nodes":[[["dense_Dense6619",0,0,{}]]]},{"name":"dense_Dense6621","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6621","trainable":true},"inbound_nodes":[[["dense_Dense6620",0,0,{}]]]},{"name":"dense_Dense6622","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6622","trainable":true},"inbound_nodes":[[["dense_Dense6621",0,0,{}]]]},{"name":"dense_Dense6623","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6623","trainable":true},"inbound_nodes":[[["dense_Dense6622",0,0,{}]]]},{"name":"dense_Dense6624","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6624","trainable":true},"inbound_nodes":[[["dense_Dense6623",0,0,{}]]]}],"input_layers":[["input1104",0,0]],"output_layers":[["dense_Dense6624",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6619/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6619/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6620/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense6620/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6621/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6621/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6622/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense6622/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6623/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6623/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6624/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6624/bias","shape":[1],"dtype":"float32"}]}]}