{"modelTopology":{"class_name":"Model","config":{"name":"model1037","layers":[{"name":"input1037","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1037"},"inbound_nodes":[]},{"name":"dense_Dense6217","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6217","trainable":true},"inbound_nodes":[[["input1037",0,0,{}]]]},{"name":"dense_Dense6218","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6218","trainable":true},"inbound_nodes":[[["dense_Dense6217",0,0,{}]]]},{"name":"dense_Dense6219","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6219","trainable":true},"inbound_nodes":[[["dense_Dense6218",0,0,{}]]]},{"name":"dense_Dense6220","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6220","trainable":true},"inbound_nodes":[[["dense_Dense6219",0,0,{}]]]},{"name":"dense_Dense6221","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6221","trainable":true},"inbound_nodes":[[["dense_Dense6220",0,0,{}]]]},{"name":"dense_Dense6222","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6222","trainable":true},"inbound_nodes":[[["dense_Dense6221",0,0,{}]]]}],"input_layers":[["input1037",0,0]],"output_layers":[["dense_Dense6222",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6217/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense6217/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense6218/kernel","shape":[1,16],"dtype":"float32"},{"name":"dense_Dense6218/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6219/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6219/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6220/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6220/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6221/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense6221/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6222/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense6222/bias","shape":[1],"dtype":"float32"}]}]}