{"modelTopology":{"class_name":"Model","config":{"name":"model540","layers":[{"name":"input540","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input540"},"inbound_nodes":[]},{"name":"dense_Dense3235","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3235","trainable":true},"inbound_nodes":[[["input540",0,0,{}]]]},{"name":"dense_Dense3236","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3236","trainable":true},"inbound_nodes":[[["dense_Dense3235",0,0,{}]]]},{"name":"dense_Dense3237","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3237","trainable":true},"inbound_nodes":[[["dense_Dense3236",0,0,{}]]]},{"name":"dense_Dense3238","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3238","trainable":true},"inbound_nodes":[[["dense_Dense3237",0,0,{}]]]},{"name":"dense_Dense3239","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3239","trainable":true},"inbound_nodes":[[["dense_Dense3238",0,0,{}]]]},{"name":"dense_Dense3240","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3240","trainable":true},"inbound_nodes":[[["dense_Dense3239",0,0,{}]]]}],"input_layers":[["input540",0,0]],"output_layers":[["dense_Dense3240",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3235/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense3235/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense3236/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense3236/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3237/kernel","shape":[4,4],"dtype":"float32"},{"name":"dense_Dense3237/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3238/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3238/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3239/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense3239/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3240/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3240/bias","shape":[1],"dtype":"float32"}]}]}