{"modelTopology":{"class_name":"Model","config":{"name":"model387","layers":[{"name":"input387","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input387"},"inbound_nodes":[]},{"name":"dense_Dense2317","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2317","trainable":true},"inbound_nodes":[[["input387",0,0,{}]]]},{"name":"dense_Dense2318","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2318","trainable":true},"inbound_nodes":[[["dense_Dense2317",0,0,{}]]]},{"name":"dense_Dense2319","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2319","trainable":true},"inbound_nodes":[[["dense_Dense2318",0,0,{}]]]},{"name":"dense_Dense2320","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2320","trainable":true},"inbound_nodes":[[["dense_Dense2319",0,0,{}]]]},{"name":"dense_Dense2321","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2321","trainable":true},"inbound_nodes":[[["dense_Dense2320",0,0,{}]]]},{"name":"dense_Dense2322","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2322","trainable":true},"inbound_nodes":[[["dense_Dense2321",0,0,{}]]]}],"input_layers":[["input387",0,0]],"output_layers":[["dense_Dense2322",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2317/kernel","shape":[3,32],"dtype":"float32"},{"name":"dense_Dense2317/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2318/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense2318/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2319/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2319/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2320/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2320/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2321/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2321/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2322/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2322/bias","shape":[1],"dtype":"float32"}]}]}