{"modelTopology":{"class_name":"Model","config":{"name":"model784","layers":[{"name":"input784","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input784"},"inbound_nodes":[]},{"name":"dense_Dense4699","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4699","trainable":true},"inbound_nodes":[[["input784",0,0,{}]]]},{"name":"dense_Dense4700","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4700","trainable":true},"inbound_nodes":[[["dense_Dense4699",0,0,{}]]]},{"name":"dense_Dense4701","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4701","trainable":true},"inbound_nodes":[[["dense_Dense4700",0,0,{}]]]},{"name":"dense_Dense4702","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4702","trainable":true},"inbound_nodes":[[["dense_Dense4701",0,0,{}]]]},{"name":"dense_Dense4703","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4703","trainable":true},"inbound_nodes":[[["dense_Dense4702",0,0,{}]]]},{"name":"dense_Dense4704","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4704","trainable":true},"inbound_nodes":[[["dense_Dense4703",0,0,{}]]]}],"input_layers":[["input784",0,0]],"output_layers":[["dense_Dense4704",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4699/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4699/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4700/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4700/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4701/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4701/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4702/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense4702/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4703/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense4703/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4704/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense4704/bias","shape":[1],"dtype":"float32"}]}]}