{"modelTopology":{"class_name":"Model","config":{"name":"model834","layers":[{"name":"input834","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input834"},"inbound_nodes":[]},{"name":"dense_Dense4166","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4166","trainable":true},"inbound_nodes":[[["input834",0,0,{}]]]},{"name":"dense_Dense4167","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4167","trainable":true},"inbound_nodes":[[["dense_Dense4166",0,0,{}]]]},{"name":"dense_Dense4168","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4168","trainable":true},"inbound_nodes":[[["dense_Dense4167",0,0,{}]]]},{"name":"dense_Dense4169","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4169","trainable":true},"inbound_nodes":[[["dense_Dense4168",0,0,{}]]]},{"name":"dense_Dense4170","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4170","trainable":true},"inbound_nodes":[[["dense_Dense4169",0,0,{}]]]}],"input_layers":[["input834",0,0]],"output_layers":[["dense_Dense4170",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4166/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense4166/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4167/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4167/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4168/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4168/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4169/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense4169/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4170/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense4170/bias","shape":[1],"dtype":"float32"}]}]}