{"modelTopology":{"class_name":"Model","config":{"name":"model1068","layers":[{"name":"input1068","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1068"},"inbound_nodes":[]},{"name":"dense_Dense6403","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6403","trainable":true},"inbound_nodes":[[["input1068",0,0,{}]]]},{"name":"dense_Dense6404","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6404","trainable":true},"inbound_nodes":[[["dense_Dense6403",0,0,{}]]]},{"name":"dense_Dense6405","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6405","trainable":true},"inbound_nodes":[[["dense_Dense6404",0,0,{}]]]},{"name":"dense_Dense6406","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6406","trainable":true},"inbound_nodes":[[["dense_Dense6405",0,0,{}]]]},{"name":"dense_Dense6407","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6407","trainable":true},"inbound_nodes":[[["dense_Dense6406",0,0,{}]]]},{"name":"dense_Dense6408","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6408","trainable":true},"inbound_nodes":[[["dense_Dense6407",0,0,{}]]]}],"input_layers":[["input1068",0,0]],"output_layers":[["dense_Dense6408",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense6403/kernel","shape":[3,8],"dtype":"float32"},{"name":"dense_Dense6403/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6404/kernel","shape":[8,16],"dtype":"float32"},{"name":"dense_Dense6404/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense6405/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense6405/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6406/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense6406/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense6407/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense6407/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense6408/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense6408/bias","shape":[1],"dtype":"float32"}]}]}