{"modelTopology":{"class_name":"Model","config":{"name":"model143","layers":[{"name":"input143","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input143"},"inbound_nodes":[]},{"name":"dense_Dense711","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense711","trainable":true},"inbound_nodes":[[["input143",0,0,{}]]]},{"name":"dense_Dense712","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense712","trainable":true},"inbound_nodes":[[["dense_Dense711",0,0,{}]]]},{"name":"dense_Dense713","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense713","trainable":true},"inbound_nodes":[[["dense_Dense712",0,0,{}]]]},{"name":"dense_Dense714","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense714","trainable":true},"inbound_nodes":[[["dense_Dense713",0,0,{}]]]},{"name":"dense_Dense715","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense715","trainable":true},"inbound_nodes":[[["dense_Dense714",0,0,{}]]]}],"input_layers":[["input143",0,0]],"output_layers":[["dense_Dense715",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense711/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense711/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense712/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense712/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense713/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense713/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense714/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense714/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense715/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense715/bias","shape":[1],"dtype":"float32"}]}]}