{"modelTopology":{"class_name":"Model","config":{"name":"model1199","layers":[{"name":"input1199","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input1199"},"inbound_nodes":[]},{"name":"dense_Dense7189","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7189","trainable":true},"inbound_nodes":[[["input1199",0,0,{}]]]},{"name":"dense_Dense7190","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7190","trainable":true},"inbound_nodes":[[["dense_Dense7189",0,0,{}]]]},{"name":"dense_Dense7191","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7191","trainable":true},"inbound_nodes":[[["dense_Dense7190",0,0,{}]]]},{"name":"dense_Dense7192","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7192","trainable":true},"inbound_nodes":[[["dense_Dense7191",0,0,{}]]]},{"name":"dense_Dense7193","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7193","trainable":true},"inbound_nodes":[[["dense_Dense7192",0,0,{}]]]},{"name":"dense_Dense7194","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7194","trainable":true},"inbound_nodes":[[["dense_Dense7193",0,0,{}]]]}],"input_layers":[["input1199",0,0]],"output_layers":[["dense_Dense7194",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense7189/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense7189/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense7190/kernel","shape":[1,32],"dtype":"float32"},{"name":"dense_Dense7190/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense7191/kernel","shape":[32,8],"dtype":"float32"},{"name":"dense_Dense7191/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense7192/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense7192/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense7193/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense7193/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense7194/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense7194/bias","shape":[1],"dtype":"float32"}]}]}