{"modelTopology":{"class_name":"Model","config":{"name":"model385","layers":[{"name":"input385","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input385"},"inbound_nodes":[]},{"name":"dense_Dense2305","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2305","trainable":true},"inbound_nodes":[[["input385",0,0,{}]]]},{"name":"dense_Dense2306","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2306","trainable":true},"inbound_nodes":[[["dense_Dense2305",0,0,{}]]]},{"name":"dense_Dense2307","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2307","trainable":true},"inbound_nodes":[[["dense_Dense2306",0,0,{}]]]},{"name":"dense_Dense2308","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2308","trainable":true},"inbound_nodes":[[["dense_Dense2307",0,0,{}]]]},{"name":"dense_Dense2309","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2309","trainable":true},"inbound_nodes":[[["dense_Dense2308",0,0,{}]]]},{"name":"dense_Dense2310","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2310","trainable":true},"inbound_nodes":[[["dense_Dense2309",0,0,{}]]]}],"input_layers":[["input385",0,0]],"output_layers":[["dense_Dense2310",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2305/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2305/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2306/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense2306/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense2307/kernel","shape":[2,16],"dtype":"float32"},{"name":"dense_Dense2307/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2308/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2308/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2309/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense2309/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense2310/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense2310/bias","shape":[1],"dtype":"float32"}]}]}