{"modelTopology":{"class_name":"Model","config":{"name":"model788","layers":[{"name":"input788","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input788"},"inbound_nodes":[]},{"name":"dense_Dense4723","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4723","trainable":true},"inbound_nodes":[[["input788",0,0,{}]]]},{"name":"dense_Dense4724","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4724","trainable":true},"inbound_nodes":[[["dense_Dense4723",0,0,{}]]]},{"name":"dense_Dense4725","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4725","trainable":true},"inbound_nodes":[[["dense_Dense4724",0,0,{}]]]},{"name":"dense_Dense4726","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4726","trainable":true},"inbound_nodes":[[["dense_Dense4725",0,0,{}]]]},{"name":"dense_Dense4727","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4727","trainable":true},"inbound_nodes":[[["dense_Dense4726",0,0,{}]]]},{"name":"dense_Dense4728","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4728","trainable":true},"inbound_nodes":[[["dense_Dense4727",0,0,{}]]]}],"input_layers":[["input788",0,0]],"output_layers":[["dense_Dense4728",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4723/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense4723/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense4724/kernel","shape":[1,8],"dtype":"float32"},{"name":"dense_Dense4724/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4725/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense4725/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4726/kernel","shape":[8,32],"dtype":"float32"},{"name":"dense_Dense4726/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4727/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_Dense4727/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense4728/kernel","shape":[2,1],"dtype":"float32"},{"name":"dense_Dense4728/bias","shape":[1],"dtype":"float32"}]}]}