{"modelTopology":{"class_name":"Model","config":{"name":"model107","layers":[{"name":"input107","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input107"},"inbound_nodes":[]},{"name":"dense_Dense425","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense425","trainable":true},"inbound_nodes":[[["input107",0,0,{}]]]},{"name":"dense_Dense426","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense426","trainable":true},"inbound_nodes":[[["dense_Dense425",0,0,{}]]]},{"name":"dense_Dense427","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense427","trainable":true},"inbound_nodes":[[["dense_Dense426",0,0,{}]]]},{"name":"dense_Dense428","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense428","trainable":true},"inbound_nodes":[[["dense_Dense427",0,0,{}]]]}],"input_layers":[["input107",0,0]],"output_layers":[["dense_Dense428",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense425/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense425/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense426/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense426/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense427/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense427/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense428/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense428/bias","shape":[1],"dtype":"float32"}]}]}