{"modelTopology":{"class_name":"Model","config":{"name":"model645","layers":[{"name":"input645","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input645"},"inbound_nodes":[]},{"name":"dense_Dense3865","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3865","trainable":true},"inbound_nodes":[[["input645",0,0,{}]]]},{"name":"dense_Dense3866","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3866","trainable":true},"inbound_nodes":[[["dense_Dense3865",0,0,{}]]]},{"name":"dense_Dense3867","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3867","trainable":true},"inbound_nodes":[[["dense_Dense3866",0,0,{}]]]},{"name":"dense_Dense3868","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3868","trainable":true},"inbound_nodes":[[["dense_Dense3867",0,0,{}]]]},{"name":"dense_Dense3869","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3869","trainable":true},"inbound_nodes":[[["dense_Dense3868",0,0,{}]]]},{"name":"dense_Dense3870","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3870","trainable":true},"inbound_nodes":[[["dense_Dense3869",0,0,{}]]]}],"input_layers":[["input645",0,0]],"output_layers":[["dense_Dense3870",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense3865/kernel","shape":[3,1],"dtype":"float32"},{"name":"dense_Dense3865/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense3866/kernel","shape":[1,4],"dtype":"float32"},{"name":"dense_Dense3866/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3867/kernel","shape":[4,32],"dtype":"float32"},{"name":"dense_Dense3867/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3868/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense3868/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3869/kernel","shape":[32,4],"dtype":"float32"},{"name":"dense_Dense3869/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense3870/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense3870/bias","shape":[1],"dtype":"float32"}]}]}