{"modelTopology":{"class_name":"Model","config":{"name":"model592","layers":[{"name":"input592","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input592"},"inbound_nodes":[]},{"name":"dense_Dense2956","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2956","trainable":true},"inbound_nodes":[[["input592",0,0,{}]]]},{"name":"dense_Dense2957","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2957","trainable":true},"inbound_nodes":[[["dense_Dense2956",0,0,{}]]]},{"name":"dense_Dense2958","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2958","trainable":true},"inbound_nodes":[[["dense_Dense2957",0,0,{}]]]},{"name":"dense_Dense2959","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2959","trainable":true},"inbound_nodes":[[["dense_Dense2958",0,0,{}]]]},{"name":"dense_Dense2960","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2960","trainable":true},"inbound_nodes":[[["dense_Dense2959",0,0,{}]]]}],"input_layers":[["input592",0,0]],"output_layers":[["dense_Dense2960",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense2956/kernel","shape":[3,4],"dtype":"float32"},{"name":"dense_Dense2956/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2957/kernel","shape":[4,16],"dtype":"float32"},{"name":"dense_Dense2957/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2958/kernel","shape":[16,4],"dtype":"float32"},{"name":"dense_Dense2958/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2959/kernel","shape":[4,8],"dtype":"float32"},{"name":"dense_Dense2959/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2960/kernel","shape":[8,1],"dtype":"float32"},{"name":"dense_Dense2960/bias","shape":[1],"dtype":"float32"}]}]}