{"modelTopology":{"class_name":"Model","config":{"name":"model57","layers":[{"name":"input57","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input57"},"inbound_nodes":[]},{"name":"dense_Dense225","class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense225","trainable":true},"inbound_nodes":[[["input57",0,0,{}]]]},{"name":"dense_Dense226","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense226","trainable":true},"inbound_nodes":[[["dense_Dense225",0,0,{}]]]},{"name":"dense_Dense227","class_name":"Dense","config":{"units":4,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense227","trainable":true},"inbound_nodes":[[["dense_Dense226",0,0,{}]]]},{"name":"dense_Dense228","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense228","trainable":true},"inbound_nodes":[[["dense_Dense227",0,0,{}]]]}],"input_layers":[["input57",0,0]],"output_layers":[["dense_Dense228",0,0]]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense225/kernel","shape":[3,2],"dtype":"float32"},{"name":"dense_Dense225/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense226/kernel","shape":[2,8],"dtype":"float32"},{"name":"dense_Dense226/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense227/kernel","shape":[8,4],"dtype":"float32"},{"name":"dense_Dense227/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense228/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense228/bias","shape":[1],"dtype":"float32"}]}]}